[
    {
        "id": "",
        "name": "REVENGE",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "to punish sb because they have harmed or offended you",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "take/get revenge",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to do something to punish someone who has harmed you, your family, or your friends: trả thù",
                        "examples": [
                            "take/get revenge on",
                            "trả thù (ai)",
                            "▪ Gayle took revenge on her husband by cutting up all his best clothes.",
                            "Gayle đã trả thù chồng bà bằng cách cắt xé hết mọi quần áo đẹp của ông.",
                            "take/get revenge for",
                            "trả thù cho",
                            "▪ He was determined to get revenge for the murder of his sister.",
                            "Anh ta quyết định trả thù kẻ giết em gái mình.",
                            "take/get your revenge",
                            "rửa hận cho mình",
                            "▪ During the riot inmates took their revenge on prison guards.",
                            "Trong suốt cuộc bạo loạn, các tù nhân đã rửa hận lên các viên cai ngục."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "in retaliation",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "if you do something in retaliation for something that someone has done to you, you do it to make them suffer even more than you did: để trả đũa",
                        "examples": [
                            "▪ Ross said he feared that he might be fired in retaliation.",
                            "Ross nói anh ta sợ bị cho nghỉ việc để trả đũa",
                            "in retaliation for",
                            "trả đũa cho",
                            "▪ The President ordered the bombings in retaliation for the attack.",
                            "Tổng thống ra lệnh đánh bom để trả đũa cuộc tấn công."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "in revenge",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "if you do something in revenge for something that someone has done to you, you do it to get revenge: để trả thù, trả miếng",
                        "examples": [
                            "▪ When she learned of her husband’s affairs, she turned to another man in revenge.",
                            "Khi cô ta biết chồng ngoại tình, cô ta tìm đến người đàn ông khác để trả miếng.",
                            "in revenge for",
                            "trả thù cho",
                            "▪ They murdered Gillespi in revenge for the death of their brother.",
                            "Họ ám sát Gillespi để trả thù cho cái chết của anh trai họ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "get back atalso get your own back (on) British",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "informal to do something which causes problems for someone, because they have done something that causes problems for you: trả đũa. lấy lại",
                        "examples": [
                            "▪ Dad won’t let me go to the concert, but I’ll get back at him.",
                            "Cha sẽ không để tôi đi đến buổi hòa nhạc, nhưng tôi sẽ trả đũa lại.",
                            "▪ Even if it took me ten years, I was determined to get my own back.",
                            "Dù cho phải mất 10 năm, tôi đã quyết tìm lại chính mình.",
                            "▪ He kept looking for a chance to get his own back on Freddie.",
                            "Anh ấy tiếp tục tìm mọi cách để lấy lại Freddie.",
                            "get back at for",
                            "trả đũa vì",
                            "▪ He wanted to get back at his supervisor for criticizing him in front of the other workers.",
                            "Anh ta muốn trả đũa viên giám sát vì hắn dám chỉ trích anh trước mặt các nhân viên khác."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "get/pay sb back",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "get/pay somebody back  if you do something unpleasant or unkind to someone in order to get or pay them back, you do it in order to punish them because they have done something unkind or unpleasant to you: trả thù ai đó",
                        "examples": [
                            "▪ So then I told everyone one of her secrets to pay her back.",
                            "Vậy nên sau đó tôi đã đem bí mật lớn nhất của cô ta nói với mọi người để trả thù cô ta.",
                            "get/pay sb back for",
                            "trả thù ai đó vì",
                            "▪ Someday I’ll get you back for this!",
                            "Ngày nào đó ta sẽ trả thù ngươi về việc này.",
                            "▪ John’s being difficult about the divorce just to pay me back for leaving him.",
                            "John gây khó dễ việc ly hôn để trả thù việc tôi bỏ rơi anh ta."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "get even",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "[informal]",
                        "region": "",
                        "definition": "if you get even with someone, you get revenge by doing something equally bad to them, in order to make yourself feel satisfied: trả đũa",
                        "examples": [
                            "▪ He decided to get even by letting the air out of her tires.",
                            "Anh ta đã quyết định làm xì lốp xe để trả đũa cô.",
                            "get even with",
                            "trả đũa (ai)",
                            "▪ What can I do to get even with him?",
                            "Tôi phải làm gì để trả đũa anh ta?",
                            "▪ Hamilton’s supporters later tried to get even with Jefferson by calling him an adulterer.",
                            "Những người ủng hộ Hamilton sau cùng đã cố trả đũa Jefferson bằng cách cáo buộc anh ta ngoại tình."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "avenge",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if you avenge an action that someone has done to you, you do something unpleasant or unkind in order to get revenge - used especially in literature: rửa nhục",
                        "examples": [
                            "▪ It was an insult which only Cassio’s death could avenge.",
                            "Chỉ có cái chết của Cassio mới trả hết được nỗi nhục.",
                            "▪ The soldiers wanted to avenge their humiliating defeat the previous year.",
                            "Những người lính muốn trả thù cho sự thất bại nhục nhã năm xưa."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "I’ll get somebody for this",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "[spoken]",
                        "region": "",
                        "definition": "say this when someone has done something unpleasant to you and you are saying that you will get revenge: Tôi sẽ trả thù ai đó vì điều này",
                        "examples": [
                            "▪ I’ll get you for this, you little brat.",
                            "Ta sẽ trả thù ngươi vì điều này, thằng tồi.",
                            "▪ Did you hear what he just said to me? I’ll get him for this!",
                            "Bạn có nghe thấy những gì hắn vừa nói với tôi? Tôi sẽ trả thù hắn cho điều này."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "action that is taken in order to punish sb who has harmed or offended you",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "revenge",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "sự báo thù",
                            "▪ The motive for the murder was clearly revenge.",
                            "Động cơ của tên sát nhân rõ ràng là để báo thù.",
                            "seek revenge",
                            "báo thù",
                            "▪ Members of the party are seeking revenge for the assassination of their leader.",
                            "Các thành viên của tổ chức đang tìm cách báo thù cho vụ ám sát lãnh đạo của họ.",
                            "revenge attack/killing/bombing",
                            "Tấn công/giết người/thả bom báo thù",
                            "▪ Fearing revenge attacks, the government has sealed off the borders.",
                            "Lo sợ bị tấn công trả thù, chính phủ đã chặn các đường biên giới."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "reprisal",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun usually plural]",
                        "usage": "",
                        "region": "",
                        "definition": "an action, especially a military or political one, that is a reaction to something that has been done by a country, government, organization etc: sự trả thù",
                        "examples": [
                            "▪ Some people will not report attacks to the police for fear of reprisals.",
                            "Một số người không dám báo cáo cuộc tấn công cho cảnh sát vì sợ bị trả thù.",
                            "▪ Demonstrators surged through the capital city yesterday, ignoring threats of reprisals from the government",
                            "Hôm qua những người biểu tình đã dấy lên ở thủ đô thành phố, bỏ qua những mối đe dọa về sự trả đũa của chính phủ.",
                            "reprisal for",
                            "Trả thù cho",
                            "▪ His murder was a reprisal for an injury to a rival gang member.",
                            "Vụ sát hại ông là sự thù cho vết thương tích mà ông gây ra cho một tên trong băng đảng đối nghịch."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "vengeance",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "revenge, especially in the form of violent actions or behaviour, for something very harmful or violent that someone has done:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Sự trả thù",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Her desire for vengeance led her to shoot her daughter’s murderer.",
                                    "Khát khao trả thù đã khiến cô ta bắn chết kẻ đã sát hại em gái cô.",
                                    "▪ Nothing can justify the gunmens’ senseless acts of vengeance.",
                                    "Không gì có thể biện minh cho những hành động trả thù vô tính của những tên găngxtơ đó."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "vendetta",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a quarrel between two people or groups of people that has continued for a long time and during which the two sides keep trying to get revenge on each other: Mối thù địch",
                        "examples": [
                            "▪ The killing was the result of a long-standing vendetta over gambling profits.",
                            "Việc giết người là kết quả của mối thù truyền kiếp vì lợi nhuận bài bạc.",
                            "vendetta between",
                            "Mối thù địch giữa",
                            "▪ The recent bombings may be a sign of a renewed vendetta between rival separatists.",
                            "Các cuộc đánh bom gần đây là dấu hiệu của mối hận thù mới giữa những người li khai thù nghịch.",
                            "vendetta against",
                            "mối thù với",
                            "▪ One of the gang members began a vendetta against her after she testified.",
                            "Một thành viên băng đảng giang hồ đã bắt đầu trả thù cô ấy sau khi cô ấy ra làm chứng.",
                            "family/tribal/private/personal vendetta",
                            "Mối thù gia tộc/bộ tộc/tư/cá nhân",
                            "▪ Ellis claims he is the victim of a conspiracy with a personal vendetta against him.",
                            "Ellis cho rằng anh ta là nạn nhân của một âm mưu trả thù anh ta."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "tit for tat",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[noun phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "something unpleasant done because someone has done something unpleasant to you: có qua có lại",
                        "examples": [
                            "▪ I didn’t invite her to my party because she didn’t invite me to hers. It was just tit for tat.",
                            "Cô ta không mời sinh nhật tôi nên tôi cũng không mời cô ta. Này là có qua có lại thôi.",
                            "tit-for-tat killings/bombings/raids etc",
                            "Cuộc giết người/đánh bom/đột kích trả thù",
                            "▪ Eight people have died in this latest round of tit-for-tat killings.",
                            "8 người đã chết trong các vụ giết người báo thù gần đây nhất."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]