[
    {
        "id": "",
        "name": "bosses managers and directors",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "middle manager",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "manager",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone whose job is to be in charge of a group of people, a project, a department, or a bank, shop, hotel etc:",
                        "examples": [
                            "quản lí ( một công ty, một bộ phận, một dự án, công việc kinh doanh )",
                            "▪ I’d like to speak to the manager.",
                            "Tôi muốn nói chuyện vói quản lí",
                            "manager of: quản lí về cái gì",
                            "▪ the advertising manager of a mail-order company",
                            "Quan lí quảng cáo của công ty đặt hàng qua thư",
                            "bank/hotel/restaurant etc manager: giám đốc ngân hàng/ khách sạn",
                            "▪ All new loans must be approved by the bank manager.",
                            "Tát cả nhungwng khoản vay cần được tán thành bởi quản lí ngân hàng",
                            "marketing/sales/accounts etc manager: quản lí marketing/bán hàng/tài khoản",
                            "▪ She’s one of our regional sales managers.",
                            "Cô ấy là một trong những giám đốc bán hàng",
                            "manager/ˈmænɪdʒəʳ/ [countable noun] someone whose job is to run part or all of a company or other organization and who is in charge of you at work:",
                            "quản lý",
                            "▪ He was a manager for Safeway Stores before leaving to start his own business.",
                            "▪ If the sales clerk cannot help you, ask to see the manager.",
                            "▪ McBride was a general manager in charge of research and development.",
                            "line managerthe person who is directly in charge of your work quản lý, điều hành",
                            "▪ Notify your line manager if you are ill.",
                            "managernoun[ C ] người chỉ đạo; giám đốc",
                            "the person who is responsible for managing an organization",
                            "_a bank manager",
                            "_a station manager",
                            "_the production manager",
                            "_I wish to speak to the manager.",
                            "line managernoun",
                            "one of the managers who are responsible for the most important activities of a largecompany, such as production"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "boss",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[countable noun]",
                        "usage": "[informal]",
                        "region": "",
                        "definition": "the person who is in charge of you at work:",
                        "examples": [
                            "xếp, quản lý",
                            "▪ Does your boss know you’re looking for another job?",
                            "Xếp bạn có biết bạn đanng tìm coog việc khác không?",
                            "▪ There’s a new guy at work who’s always trying to impress the boss.",
                            "Nhân viên mới luôn luôn tạo ấn tượng với xếp",
                            "▪ The front page of the paper announced ‘Company bosses get record pay increases’.",
                            "Trang đầu của một tờ báo nó rằng\" Những giám đốc công ty sẽ được tăng lương kỉ luc\"",
                            "boss/bɒsǁbɔːs/ [countable noun] the person who is in charge of you at work: ông chủ",
                            "▪ As a secretary, my job includes taking my boss’s phone calls.",
                            "▪ She accuses her former boss of sexually harassing her.",
                            "immediate bossthe person who is directly in charge of you chủ trực tiếp",
                            "▪ The managing director is a man but my immediate boss is a woman.",
                            "be your own bossto run your own business and organize your own work tự làm chủ",
                            "▪ I don’t make as much money as I used to, but I prefer being my own boss.",
                            "bossnoun[ C ]MANAGER ông chủ, thủ trưởngông trùm",
                            "the person who is in charge of an organization and who tells others what to do",
                            "_She was the boss of a large international company.",
                            "_I started up my own business and now I'm myownboss (= I work for myself and no one tells me what to do) .",
                            "_informalWho's the boss (= the person who makes all the important decisions) in your house?"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "foreman",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is in charge of a group of factory workers or builders, whose job is to make sure that the workers do what the manager wants:",
                        "examples": [
                            "quản đôc , đốc công",
                            "▪ Anton hated the foreman, who was never satisfied with anyone’s work.",
                            "Anto ghét quản đốc của anh ta, người khoog bao giờ hài lòng với bất kì công việc của ai",
                            "foreman of: quản đốc của....",
                            "▪ He spoke as though he were a rich landowner instead of just the foreman of a modest building firm.",
                            "Anh ấy nói như thể là anh ta là một nhà giàu có chứ khong phải là nhà thầu xây dựng",
                            "foreman/ˈfɔːʳmən/ [countable noun] someone who is in charge of a group of factory workers or builders and is responsible for seeing that orders from managers are carried out: quản lý, quản đốc",
                            "▪ Time taken in unloading should be recorded by the foreman and paid at the agreed rate.",
                            "foremannoun[ C ]PERSON AT WORK quản đốc;đốc công",
                            "specialized a skilled person with experience who is in charge of and watches over a group of workers"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "supervisor",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is in charge of a group of workers, such as cleaners or secretaries, in an office, factory, airport etc, whose job is to make sure that the workers do what the manager wants:",
                        "examples": [
                            "giám sát viên",
                            "▪ We still need to replace the office supervisor.",
                            "Chúng tôi cần thay đổi giám sát viên van phòng",
                            "supervisor of: giám sát viên của",
                            "▪ She has worked her way up the company and is now supervisor of 50 staff members.",
                            "Cô ấy làm việc theo cách của mình ở công ty va bây giờ là giám sat viên của 50 nhân viên",
                            "supervisor/ˈsuːpəʳvaɪzəʳ, ˈsjuː-ǁˈsuː-/ [countable noun] someone who is in charge of a group of workers, and makes sure they do their jobs properly:",
                            "người quản lí, giám sát",
                            "▪ You must receive approval from a supervisor before visiting a high-risk area.",
                            "▪ Haworth, formerly a supervisor of 120 people at a printing company, left to start his own business.",
                            "supervisornoun[ C ] người giám sát; người giám thị",
                            "a person whose job is tosupervisesomeone or something",
                            "supervisornoun[ C ] người giám sát; người giám thị",
                            "a person whose job is tosupervisesomeone or something"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "top positions",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "chairman/chairwoman",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "the person who is in charge of alargecompany , especially the most powerful member of itsboard:",
                        "examples": [
                            "chủ tịch ( một công ty lớn )",
                            "▪Doreen’s leaving party looked more like a board meeting, with the chairman and directors there to say goodbye.",
                            "Buổi tiệc chia tay của Doreen trong giống như một cuộc họp cổ đông với sự tham gia của chủ tịch và giám đốc",
                            "chairman/chairwoman of : Chủ tịch của",
                            "▪ Manley gradually worked her way up, and within ten years became chairwoman of the board.",
                            "Manley đã tự mình làm việc và trong vòng 10 năm đã trở thành chủ tịch của bộ",
                            "▪ The Chairman of British Airways visited Downing Street last week.",
                            "Chủ tịch của đường hàng không đã tham quan Dowingstreet vào tuần rước"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "chief executive officer",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "chief executivealsochiefexecutiveofficer/CEOAmerican   the manager withmostauthorityin the normal, everyday management of a company. This job is often combined with other jobs, such as that ofpresident:",
                        "examples": [
                            "giám đốc điều hành ( thường thì chức này được nắm giữ bởi chủ tịch )",
                            "▪ Universal Studios is looking for a new chief executive.",
                            "Universal Studio đang tiềm kiếm một giám đóc điều hanh mới",
                            "chief executive of:",
                            "▪ the CEO of General Motors:",
                            "Giam đốc của General Motors",
                            "chief executive officernoun[ C ] (abbreviationCEO)Giám đốc điều hành",
                            "the person with the most important position in a company",
                            "CEOnoun[ C ] Giám đốc điều hành",
                            "abbreviation forchief executive officer : the person with the most important position in a company"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "president",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "the person in charge of alargecompany,especially in the US:",
                        "examples": [
                            "chủ tịch ( của một công ty lớn đặc biệt là ở Mỹ )",
                            "▪ Angry shareholders called for the resignation of the company preside",
                            "Cổ đông công ty Angry kêu gọi sự từ chức của chủ tịch",
                            "president of: Chủ tịch của cái gì",
                            "▪ the president of CBS new",
                            "Chủ tịch của đài CBS",
                            "presidentnoun[ C ]ORGANIZATION chủ tịch",
                            "the person who has the highest position in an organization or, especially in theUS, in a company",
                            "_a former President of the Royal Society",
                            "_mainly USShe's a friend of the presidentofthe bank."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "managing director",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "Britishthe person in charge of thedailymanagement of acompanyororganization. This job is often combined with that ofchairman:",
                        "examples": [
                            "giám đốc điều hành ( thường thì chức này được nắm giữ bởi chủ tịch )",
                            "managing director of: giám đốc quản li của..",
                            "▪ Silva has been appointed managing director of the sales division.",
                            "Silva được tiến cử cho vị trí giám đốc quản lí bán hàng",
                            "▪ He’s the managing director of a small printing firm.",
                            "Anh ấy là giám đốc quản lí của văn phòng nghệ thuật quy mô nhỏ",
                            "managing directornoun[ C ] (abbreviationMD)UK giám đốc điều hành",
                            "the person in charge of the way a company operates",
                            "_There's a board of five directors, but she is the Managing Director.",
                            "_You should talk to the MD about your proposal."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "chief operating officer",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "(alsochief operations officer) noun  (abbrCOO) a person who is employed to manage the daily affairs of a company, usually under the authority of a chief executive officer",
                        "examples": [],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "a manager who is in a lower position",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "deputy",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is immediately below the rank of anothermanager, and who is officially in charge when that other person is away or ill:",
                        "examples": [
                            "phó",
                            "deputy director/manager/principal etc giám đốc đại diện",
                            "▪ The deputy director is authorized to act in the director’s absence.",
                            "Giám đốc đại diện có quyền quyêt định thay cho giám đốc khi nghỉ phép",
                            "▪ He became the deputy head of the FBI at the age of only 36.",
                            "Anh ấy trở thành giám đốc đại dện của FBI chiwr ở độ tuổi 36"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "second-in-command",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a manager who is in charge of anorganizationordepartmentwhen a more senior manager is not there:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "phó",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "D",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ I left the planning to my second- in-command while I was away.",
                                    "▪ She had been second- in-command at the nursing home and was now a senior manager in one of the big Boston hospitals."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "executive directors top executives senior executives",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "director",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "an important manager who is in charge of adepartmentin a company:",
                        "examples": [
                            "giám đốc ( 1 bộ phận công ty lớn, thành viên của ban quản trị )",
                            "▪ The directors are meeting today to discuss the company’s future",
                            "Những người giám đốc hôm nay sẽ họp để thảo luận về tương lai của công ty",
                            "finance/sales/personnel etc director:",
                            "Giám đốc tài chính/ bán hàng/ nhân viên",
                            "▪ Have you met the new finance director?",
                            "Bạn đã gặp giám đốc tài chính mới chưa?",
                            "director of: Giám đốc của",
                            "▪ Dr Jane Wilde, director of the Health Promotion Agency",
                            "Bác sĩ Jane Wide, giám đốc của cục tăng cường sức khỏe",
                            "chief financial officer(alsochieffinanceofficer) noun [C] (abbrCFO) the person in charge of the financial department of a company",
                            "chief operating officer(alsochief operations officer) noun [C] (abbrCOO) a person who is employed to manage the daily affairs of a company, usually under the authority of a chief executive officer Copyright Oxford University Press 2005"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "executive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a manager, especially an important one:",
                        "examples": [
                            "ủy viên ban quản trị",
                            "▪ We were visited by a young, dynamic executive from a small computer company.",
                            "Chúng tôi được thăm hỏi bởi một nhân viên trẻ, năng động từ công ty máy tính quy mô nhỏ",
                            "executive for: ủy vieenveef cái gì",
                            "▪ Clifford, a former congressman, is now an executive for a large charity.",
                            "Clifford, một cựu nghị sĩ Mỹ bây giờ là ủy viên ban quản trị cho nhà từ thiện lớn",
                            "executive stress : căng thẳng hành chính",
                            "an illness suffered by managers who are under a lot of pressure in their jobs",
                            "▪ a psychiatrist who specializes in executive stress",
                            "Một nhà tâm lí học chuyên về thực chữa trị cang thẳng hành chính",
                            "executivenoun[ C ] uỷ viên ban chấp hành, uỷ viên ban quản trị",
                            "(informalexec) someone in a high position, especially inbusiness,who makes decisions and puts them into action",
                            "_She is now aseniorexecutive, having worked her way up through the company."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "head",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/hed/  the person in charge of anorganizationordepartment:",
                        "examples": [
                            "người đứng đầu ( 1 công ty, 1 tổ chức )",
                            "trưởng phòng ( 1 phòng ban )",
                            "head of",
                            "▪the former head of MI5, the British Intelligence Service",
                            "trưởng phòng MI5 của cơ quan tình báo Anh",
                            "▪ She’s the head of research and development.",
                            "Cô ấy là trưởng phòng nghiên cứu và phát triển",
                            "head/hed/ [countable noun] the person who is in charge of a company, department, or particular activity:",
                            "người đứng đầu",
                            "head of người đứng đầu của",
                            "▪ According to Rice, the head of the planning committee, the project is 25% completed.",
                            "be head of something người đứng đầu của gì đó",
                            "▪ Hwang is head of the local Communist Party, and is also a farmer.",
                            "headnounLEADER người đứng đầu; người chỉ huy; thủ trưởng",
                            "[ C ] someone in charge of or leading an organization, group, etc",
                            "_the head of the History department",
                            "_the head chef"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "vice president",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "American abbreviationVP the person in acompanyororganizationwho is directly below the president in rank, and who is usually responsible for aparticularpartof the company:",
                        "examples": [
                            "phó chủ tịch ( bộ phận nào đó )",
                            "▪ Meyer hopes to become the company’s first female vice president.",
                            "Meyer hy vọng trở thành nữ phó chủ tich đầu tiên của công ty",
                            "vice president of/for: Phó chủ tịch của...",
                            "▪ the vice president for sales and marketing",
                            "Phó chủ tịch của nhân viên và marketing",
                            "▪ the VP of corporate affairs",
                            "Phó chủ tịch các vấn đề hợp tác",
                            "vice presidentnoun[ C ] phó chủ tịch",
                            "USthe person who is responsible for a large important part of a company ororganization",
                            "_She's vice president of sales and marketing."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "somebody who establishes a company",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "founder",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "noun người thành lập; người sáng lập",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "someone who establishes an organization",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_She is the founder and managing director of the company."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "sb who can make decisions or not",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "executive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "non-executive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "usage": "",
                        "region": "",
                        "definition": "adjective used to describe sb who is not employed by a company but takes part in meetings of the board of directors and gives independent advice:",
                        "examples": [
                            "ko thuộc ban quản trị ( cố vấn )",
                            "She works for a television company in a non-executive role.",
                            "a non-executive board member/chairperson/officer",
                            "a non-executive committee/panel"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "executive// adjective",
                        "examples": [
                            "1 connected with managing a business or an organization, and with making plans and decisions:",
                            "She has an executive position in a finance company.",
                            "the executive management team",
                            "executive decisions/duties/jobs/positions",
                            "executive bonuses/pay/perks",
                            "2 having the power to put important laws and decisions into effect; connected with this:",
                            "The executive board have approved the redundancies. He sits on the board but has no executive power.",
                            "an executive board/committee/officer",
                            "3 for the use of sb who is important; expensive and of good quality: the executive lounge (= at an airport) What has been happening in the company\\sis executive suite (= the offices used by the senior managers)? an executive jet/lounge/suite executive cars/housing Copyright Oxford University Press 2005",
                            "executiveadjective[ before noun ] châp hành; quản trị",
                            "relating to making decisions and managing businesses, or suitable for people with important jobs in business",
                            "_His executive skills will be very useful to the company.",
                            "_executive cars",
                            "_an executive suite"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "a group of managers",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "management",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "the people who are in charge of an organization, not the ordinary workers:",
                        "examples": [
                            "ban quản trị, ban điều hành",
                            "▪ Talks between the workers and the management broke down today.",
                            "Cuộc nói chuyện giữa công nhân và ban quản lí đã thất bại",
                            "senior management: Ban quản trị cấp cao",
                            "▪ Senior management seem to be completely out of touch with their staff’s needs.",
                            "Dường như ban quản trị cấp cao hoàn toàn đề câp đến nhu cầu nhân viên",
                            "managementnoun ban quản lý;ban quản đốc;ban quản trị",
                            "[ C + singular or plural verb ]the group of people responsible for controlling and organizing a company",
                            "_Management has/have offered staff a 3% pay increase."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "the board/the board of directors",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "the group of people who have been chosen to manage a company, and who meet regularly to make important decisions:",
                        "examples": [
                            "hội đồng quản trị",
                            "▪ There are only two women on the company’s board of directors.",
                            "Chỉ có hai người phụ nữ trong ban hội đồng quản trị của công ty",
                            "▪ Last year the board approved use of funds to improve staff training.",
                            "Năm ngoái ban quan trị ủng hộ viêc dùng tiền quỷ để đào tạo nhân viên",
                            "be appointed to the board (of directors) : được bổ nhiệm vào ban quản trị",
                            "▪ Carmichael was appointed to the board in July.",
                            "Carmichael được bổ nhiệm làm họi đồng quản trị vào thang bảy",
                            "board meeting: Cuộc họp hội đồng quản trị",
                            "▪ An emergency board meeting was hastily arranged.",
                            "Cuộc họp khẩn cấp hội đồng quản trị đã được sắp xếp một cách vôi vã",
                            "boardnounPEOPLE ban;uỷ ban; hội đồng;bộ",
                            "[ C usually singular + singular or plural verb ]",
                            "the group of people who are responsible for controlling and organizing a company or organization",
                            "_Every decision has to be passed bytheboard(of directors).",
                            "_She started in the firm by making the tea and now she'son theboard/a boardmember",
                            "_Theboardof governorsmeet/meets once a month to discuss school policy."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "head office",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[singular noun]",
                        "usage": "",
                        "region": "",
                        "definition": "British /the head officeAmerican   the group of top managers of a company who work in it’scentraloffice and control the rest of the company’s offices from there:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "trụ sở chính, cơ quan đầu não ( ý nói tất cả những quản lý cấp cao trong đó )",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "D",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Head office must approve any order for new equipment."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Trụ sở chính phải ủng hộ đơn đặt hàng trang thiết bị mới",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "D",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ In the past, strategy was dictated by the head office."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Trong quá khứ, chiến lược này được đề ra bởi trụ sở chính",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "D",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "the powers that be",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[noun phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "an expression meaning the management of an organization, used especially when the organization is solargethat you donot know who the managementis:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "những người có thẩm quyền ( của 1 công ty tổ chức lớn, dùng khi bạn ko biết họ là ai )",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "D",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The powers that be have decided that our lunch breaks should be reduced to 45 minutes."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Những ngưỡi có thẩm quyền đã quyết định giờ nghỉ trưa của chúng tôi được giảm xuống còn 45 phút",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "D",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "executive directors top executives senior executives",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "finance director",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "director  an important manager who is in charge of adepartmentin a company:",
                        "examples": [
                            "giám đốc ( 1 bộ phận công ty lớn, thành viên của ban quản trị )",
                            "▪ The directors are meeting today to discuss the company’s future",
                            "Những người giám đốc hôm nay sẽ họp để thảo luận về tương lai của công ty",
                            "finance/marketing/sales/personnel/human resources/IT/research etc director:",
                            "▪ Have you met the new finance director?",
                            "Bạn đã gặp giám đốc tài chính mới chưa?",
                            "director of financefinance/marketing/sales/personnel/human resources/IT/research etc : Giám đốc của",
                            "finance director of ...",
                            "▪ Dr Jane Wilde, finance director of the Health Promotion Agency",
                            "Bác sĩ Jane Wide, giám đốc của cục tăng cường sức khỏe"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "executive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a manager, especially an important one:",
                        "examples": [
                            "ủy viên ban quản trị",
                            "▪ We were visited by a young, dynamic executive from a small computer company.",
                            "Chúng tôi được thăm hỏi bởi một nhân viên trẻ, năng động từ công ty máy tính quy mô nhỏ",
                            "executive for: ủy vieenveef cái gì",
                            "▪ Clifford, a former congressman, is now an executive for a large charity.",
                            "Clifford, một cựu nghị sĩ Mỹ bây giờ là ủy viên ban quản trị cho nhà từ thiện lớn",
                            "executive stress : căng thẳng hành chính",
                            "an illness suffered by managers who are under a lot of pressure in their jobs",
                            "▪ a psychiatrist who specializes in executive stress",
                            "Một nhà tâm lí học chuyên về thực chữa trị cang thẳng hành chính",
                            "executivenoun[ C ] uỷ viên ban chấp hành, uỷ viên ban quản trị",
                            "(informalexec) someone in a high position, especially inbusiness,who makes decisions and puts them into action",
                            "_She is now aseniorexecutive, having worked her way up through the company."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "vice president",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "American abbreviationVP the person in acompanywho is directly below thepresidentin rank, and who is usually responsible for aparticularpartof the company:",
                        "examples": [
                            "phó chủ tịch ( bộ phận nào đó )",
                            "▪ Meyer hopes to become the company’s first female vice president.",
                            "Meyer hy vọng trở thành nữ phó chủ tich đầu tiên của công ty",
                            "vice president of/for: Phó chủ tịch của...",
                            "▪ the vice president for sales and marketing",
                            "Phó chủ tịch của nhân viên và marketing",
                            "▪ the VP of corporate affairs",
                            "Phó chủ tịch các vấn đề hợp tác",
                            "vice presidentnoun[ C ] phó chủ tịch",
                            "USthe person who is responsible for a large important part of a company ororganization",
                            "_She's vice president of sales and marketing."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "head of finance",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "head/hed/  the person in charge of andepartment:",
                        "examples": [
                            "trưởng phòng( bộ phận nào đó )",
                            "head offinance/marketing/sales/personnel/human resources/IT/research etc",
                            "▪ She’s the head of research and development.",
                            "Cô ấy là trưởng phòng nghiên cứu và phát triển"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "chief financial officer",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "(alsochieffinanceofficer) noun  (abbrCFO) the person in charge of the financial department of a company",
                        "examples": [],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "uncategoried",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "leadership",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "the people in charge of a political party or country:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "ban lãnh đạo",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Party members had lost confidence in the leadership.",
                                    "▪ Turkey has lacked any clear leadership since the collapse of the coalition government four months ago."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "leadership of ban lãnh đạo của",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The leadership of the Association was criticized for not making its plans more easily accessible."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "employer",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "the person, company, or organization that you work for:",
                        "examples": [
                            "ông chủ , chủ lao động ( có thể là người, tổ chức, công ty )",
                            "▪ We will need a reference from your last employer before we can send you a contract.",
                            "Chúng tôi sẽ cần một giấy giới thiệu từ chủ lao động cũ của bạn trước khi chúng tôi có thể đưa cho bạn 1 hợp đồng",
                            "▪ She applied to her employer for a redundancy payment, but she was refused.",
                            "employernoun[ C ] chủ;người sử dụng lao động",
                            "a person or organization that employs people",
                            "_We need a reference from your former employer."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "partner",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "noun người chung phần; cộng sự; đối tác",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "one of the owners of a company",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_He's a partnerinan insurance company/a law firm."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "superior",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "someone who is in a higher position than you at work:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "cấp trên",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The report he submitted to his superiors accurately reflected the poor morale of the workers."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "immediate superiorthe person in the position directly above you cấp trên trực tiếp",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Your most important working relationship is with your immediate superior."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "directorship",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "noun chức giám đốc",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "the position of being thedirectorof a company",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_He holds several company directorships."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "boss",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[countable noun]",
                        "usage": "[informal]",
                        "region": "",
                        "definition": "the person who is in charge of you at work:",
                        "examples": [
                            "xếp ( người )",
                            "▪ Does your boss know you’re looking for another job?",
                            "Xếp bạn có biết bạn đanng tìm coog việc khác không?",
                            "▪ There’s a new guy at work who’s always trying to impress the boss.",
                            "Nhân viên mới luôn luôn tạo ấn tượng với xếp",
                            "▪ The front page of the paper announced ‘Company bosses get record pay increases’.",
                            "Trang đầu của một tờ báo nó rằng\" Những giám đốc công ty sẽ được tăng lương kỉ luc\"",
                            "bossnoun[ C ]MANAGER ông chủ, thủ trưởngông trùm",
                            "the person who is in charge of an organization and who tells others what to do",
                            "_She was the boss of a large international company.",
                            "_I started up my own business and now I'm myownboss (= I work for myself and no one tells me what to do) .",
                            "_informalWho's the boss (= the person who makes all the important decisions) in your house?"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "general",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "",
                        "region": "",
                        "definition": "adjectiveNOT LIMITED tổng",
                        "examples": [
                            "used as part of the title of a job of someone who is in charge of a whole organization or company",
                            "_the generalmanager tổng giám đốc",
                            "_the General Secretary of the UN"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "sb's line manager",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "line manager  the manager who is directly in charge of you in a company, rather than a more senior manager:",
                        "examples": [
                            "cấp trên",
                            "▪ If you want to take a holiday, first ask your line manager.",
                            "Nếu bạn muốn đi nghĩ, bạn phải hỏi nhà quản lí dây chuyên trước đã",
                            "sb'sline manager",
                            "mainly UK someone who is responsible for managing someone else in a company or business"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "report to",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[transitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if you report to someone in a company, they are your line manager:",
                        "examples": [
                            "là cấp dưới của ...",
                            "▪ Jan is based in Birmingham and reports to the Head of Marketing.",
                            "Jan dựa vào Birmingham và báo cáo với giám đốc Marketing",
                            "report tosbphrasal verb",
                            "Someone you report to at work is the person in authority over you who gives you tasks and checks that you do them",
                            "_You will report directly to the boss."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "senior",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "usage": "",
                        "region": "",
                        "definition": "nounHIGH RANK nhân viên, quanchứccấp cao",
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "middle managers",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "manager",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone whose job is to be in charge of a department",
                        "examples": [
                            "quản lí ( một bộ phận )",
                            "manager of: quản lí về cái gì",
                            "▪ the advertising manager of a mail-order company",
                            "Quan lí quảng cáo của công ty đặt hàng qua thư",
                            "marketing/sales/accounts etc manager: quản lí marketing/bán hàng/tài khoản",
                            "▪ She’s one of our regional sales managers.",
                            "Cô ấy là một trong những giám đốc bán hàng",
                            "line managerthe person who is directly in charge of your work",
                            "quản lý, điều hành",
                            "▪ Notify your line manager if you are ill.",
                            "managernoun[ C ] người chỉ đạo; giám đốc",
                            "the person who is responsible for managing an organization",
                            "_a bank manager",
                            "_a station manager",
                            "_the production manager",
                            "_I wish to speak to the manager.",
                            "line managernoun",
                            "one of the managers who are responsible for the most important activities of a largecompany, such as production"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "bottom positions",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "line manager",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "",
                        "region": "",
                        "definition": "the person who is directly in charge of your work",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "quản lý, điều hành",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Notify your line manager if you are ill."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]