[
    {
        "id": "",
        "name": "industrial action",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "to stop working in order to get higher wages etc",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "go on strike",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "if workers go on strike, they stop working in order to demand better pay or working conditions, or to protest about something:",
                        "examples": [
                            "đình công",
                            "▪ In 1926, all Britain’s miners, railway workers, and transport workers went on strike.",
                            "Năm 1926, tất cả các thợ mỏ, công nhân đường sắt, và công nhân vận tải của Anh đều đình công.",
                            "go on strike for",
                            "Đình công để được",
                            "▪ The engineers have gone on strike for better pay and shorter working hours.",
                            "Các kỹ sư đã đình công để được trả lương tốt hơn và làm việc ít hơn.",
                            "go on indefinite strike",
                            "cuộc đình công vô thời hạn",
                            "go on strike until something is done to change a situation",
                            "▪ From tomorrow, we’re going on indefinite strike unless something’s done to reduce the number of accidents in the factory.",
                            "Từ ngày mai, chúng tôi sẽ đình công vô thời hạn trừ khi có điều gì đó làm giảm số tai nạn trong nhà máy.",
                            "go on strike đình công;bãi công",
                            "to start to strike",
                            "_All 2 500 employeeswenton strike in protest at the decision to close the factory."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "strike",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[intransitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if workersstrike, they stop working in order to demand higher wages etc - used especially innewsreports:",
                        "examples": [
                            "đình công, bãi công",
                            "▪ Female workers are often more reluctant than men to strike in order to get what they want.",
                            "Lao động nữ thường không sẵn lòng đình công để có được những gì họ muốn so với nam giới.",
                            "strike for",
                            "Đình công vì",
                            "▪ Teachers were not striking for higher pay, but for higher standards in education.",
                            "Giáo viên không đình công để có mức lương cao hơn, mà vì muốn có các tiêu chuẩn cao hơn về giáo dục.",
                            "striking[adjective only before noun]",
                            "đình công",
                            "▪ Outside the offices, standing in the rain, were 1400 striking clerical workers.",
                            "1400 công nhân văn thư đứng dưới mưa bên ngoài văn phòng để đình công.",
                            "strikeverbSTOP WORK bãi công, đình công",
                            "[ I ]struck,struckto refuse to continue working because of an argument with anemployer about working conditions, pay levels or job losses",
                            "_Democratization has brought workersthe right tostrike and join a trade union.",
                            "_We're strikingfora reduction in the working week and improved safety standards."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "come out on strike",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "British if a group of workerscome out on strike,they deliberately stop working as a protest, especially after discussions with their employers have failed to produce any agreement:",
                        "examples": [
                            "đình công",
                            "▪ Union leaders are calling on their members to come out on strike from next Monday.",
                            "Các nhà lãnh đạo Liên minh đang kêu gọi các thành viên của họ đình công ngay từ ngày thứ Hai tới.",
                            "come out on strike in support of somebody/something",
                            "đình công để hỗ trợ ai đó / cái gì đó",
                            "▪ The government just didn’t expect teachers to come out on strike in support of the miners.",
                            "Chính phủ không mong giáo viên sẽ đình công để hỗ trợ các thợ mỏ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "walk out",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[intransitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if workerswalk out, they stop working and leave the place where they are working, especially when this has not been planned but happens as a protest about something that hasjusthappened:",
                        "examples": [
                            "đình công, bãi công ( tự phát ngay lúc xảy ra sự việc )",
                            "▪ This afternoon, three hundred car workers walked out as a protest over cuts in overtime.",
                            "Chiều nay, ba trăm công nhân xe đình công để kháng nghị về cắt giảm việc tăng ca.",
                            "▪ Ambulance drivers have threatened to walk out if their pay claim is rejected.",
                            "Các tài xế cứu thương đã đe dọa sẽ đình công nếu yêu cầu bồi thường của họ bị từ chối.",
                            "walk outphrasal verbSTOP WORK đình công;bãi công",
                            "to stop working or leave your job because of a disagreement with your employer",
                            "_Workers are threatening to walk out."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "down tools",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "Britishif workers in a factorydown tools, they stop working as a protest about something that hasjusthappened:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "đình công",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ After their workmate was sacked, the other machinists all downed tools until she was reinstated.",
                                    "Sau khi đồng nghiệp của họ bị sa thải, các công nhân khác đã đình công cho đến khi cô được phục chức."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "be on strike",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "if workersare on strike, they have stopped working in order to demand higher wages etc:",
                        "examples": [
                            "đình công",
                            "▪ Some two-thirds of the country’s diamond miners are now on strike.",
                            "2/3 số thợ mỏ kim cương của nước này đang đình công.",
                            "be out on strike",
                            "bãi công, đình công",
                            "▪ There were frequent power cuts when the electricity workers were out on strike.",
                            "Điện bị cắt giảm thường xuyên khi các công nhân điện lực đình công.",
                            "on strike(UKalsoout on strike)đình công;bãi công",
                            "taking part in a strike",
                            "_The city's bus drivers have been on strike for three weeks."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "when workers are on strike",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "strike",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "cuộc đình công",
                            "▪ The offices were closed by a strike that lasted two months.",
                            "Các văn phòng đã bị đóng cửa bởi một cuộc đình công kéo dài hai tháng.",
                            "miners’/teachers’/railworkers’ etc strike",
                            "Cuộc đình công của thợ mỏ / giáo viên /nhân viên đường sắt...",
                            "▪ Since the miners’ strike, thirty of the mines in the area have been closed.",
                            "Kể từ cuộc đình công của những người thợ mỏ, 30 mỏ trong khu vực đã bị đóng cửa.",
                            "coal/rail/dock etc strike",
                            "Cuộc đình công của ngành than mỏ/đường sắt/ cuộc đình công ở bến tàu...",
                            "▪ The roads were a nightmare as commuters were hit by a rail strike.",
                            "Các con đường là một cơn ác mộng với những người đi làm gặp khi họ phải cuộc đình công của ngành đường sắt.",
                            "call a strike ask workers to strike",
                            "kêu gọi đình công",
                            "▪ When union bosses called a strike in protest over low pay, the response was overwhelming.",
                            "Khi các quản lý công đoàn kêu gọi đình công để phản đối mức lương thấp, phản ứng lại rất nhiệt liệt.",
                            "call off a strike stop striking",
                            "dừng cuộc đình công",
                            "▪ The administration has officially asked transportation workers to call off their strike.",
                            "Chính quyền đã chính thức yêu cầu nhân viên vận tải phải dừng cuộc đình công lại.",
                            "general strike",
                            "Cuộc đình công toàn quốc, cuộc tổng đình công",
                            "when most workers in a country strike",
                            "▪ Following a general strike and calls for his resignation, the President was arrested on 26 March.",
                            "Sau cuộc tổng đình công và kêu gọi từ chức, Tổng thống đã bị bắt vào ngày 26 tháng 3.",
                            "strike action",
                            "hành động đình công",
                            "▪ Shipbuilders and dockers were solidly in favour of strike action in support of their claim.",
                            "Các công ty đóng tàu và thợ đóng hàng kiên quyết ủng hộ hành động đình công để ủng hộ yêu sách của họ.",
                            "strikenoun[ C ]STOP WORK cuộc đình công, cuộc bãi công",
                            "when workers refuse to continue working because of an argument with an employerabout working conditions, pay levels or job losses",
                            "_After last year's long and bitter strike, few people want further industrial action.",
                            "_Most of the workers have ignored their union'scallfor strikeaction.",
                            "_Some miners arecalling fora nationwide strike in support of their sacked colleagues.",
                            "_They have voted to stagelightning/wildcat",
                            "(= sudden and short) strikes in pursuit of their demands.",
                            "_We've voted tostagea series ofone-daystrikes.",
                            "_Awave ofstrikes swept the country.",
                            "_The result of the strikeballotwill be known tomorrow morning."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "industrial action",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "when a group of workers try to persuade their employer to improve pay or conditions, either by going on strike or by doing less work than they usually do:",
                        "examples": [
                            "cuộc bãi công",
                            "▪ Exactly what form the industrial action will take is not yet known.",
                            "Cuộc bãi công sẽ giành được chính xác những gì thì vẫn chưa ai biết.",
                            "▪ Most of the workers are against industrial action, but are asking for talks with employers.",
                            "Hầu hết công nhân đều không chịu đình công, nhưng đang yêu cầu đàm phán với nhà tuyển dụng.",
                            "take industrial action",
                            "dùng biện pháp bãi công, đình công",
                            "▪ A survey of 2,000 federation members had shown that 48% believed police should have the right to take industrial action.",
                            "Một cuộc điều tra của 2.000 thành viên liên đoàn đã cho thấy rằng 48% tin rằng cảnh sát cũng có quyền đình công.",
                            "industrial actionnoun[ U ] sự bãi công, đình công",
                            "when workers act in a way that is intended to force an employer to agree to something,especially by stopping work",
                            "_Workers at the plant arethreateningindustrial action."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "work-to-rule",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[singular noun]",
                        "usage": "",
                        "region": "",
                        "definition": "when workers do only the amount of work they legally have to do and no more, as a protests against something:",
                        "examples": [
                            "đình công theo luật",
                            "▪ Because of their work-to-rule, teachers were no longer taking after-school clubs or supervising lunch hours.",
                            "Vì đang đình công theo luật, giáo viên không còn đi câu lạc bộ sau giờ học hoặc giám sát giờ ăn trưa.",
                            "work-to-rulenoun[ C usually singular ] sự đình công theo luật (công nhân theo đúng các qui định của chủ và từ chối không chịu làm thêm giờ, ngoài giờ...)",
                            "a situation in which people carefully obey all the rules and instructionsgiven tothem about their jobs, with the intention of reducing the amount of work they do",
                            "_A work-to-rule is seen as a way to protest against low pay or bad working conditions."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "stoppage",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "British alsowork stoppageAmerican   when a group of workers stop working for a short time until their complaint, protest, or demand is dealt with: sự đình chỉ",
                        "examples": [
                            "▪ Customs officers will return to work today after a twenty-four hour stoppage.",
                            "Các viên chức hải quan sẽ trở lại làm việc hôm nay sau khi đình chỉ 24 giờ.",
                            "▪ Railworkers in central Poland also joined the stoppage, cutting the link with the industrial south-west.",
                            "Các công nhân đường sắt ở miền trung Ba Lan cũng tham gia vào việc đình chỉ, cắt liên kết với khu công nghiệp phía tây nam.",
                            "▪ The plan is likely to be met with work stoppages and other labor disruptions.",
                            "Kế hoạch này có thể sẽ gặp phải tình trạng đình chỉ và các sự gián đoạn lao động khác.",
                            "stoppagenoun[ C ]NOT WORKING",
                            "sự ngừng làm việc (trong một nhà máy..; nhất là do bãi công)",
                            "a timewhen work is stopped because of a disagreement between workers and employers"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "go-slow",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "British when a group of workers deliberately work more slowly than usual as a way of protesting about low wages, bad working conditions etc: sự lãn công, làm việc chậm",
                        "examples": [
                            "▪ The hospital seemed to be treating as many patients as possible before the go-slow came into effect.",
                            "Bệnh viện dường như đang điều trị càng nhiều bệnh nhân càng tốt trước khi cuộc lãn công có hiệu lực.",
                            "go-slownoun[ C usually singular]UK(USslowdown) (sự) lãn công; (sự) giảm tốc độ",
                            "when employees work more slowly and with less effort than usual to try to persuadean employer to agree to higher pay or better working conditions or arrangements"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "job action",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[C usually singular]",
                        "usage": "",
                        "region": "",
                        "definition": "nounUS sự bãi công, đình công",
                        "examples": [
                            "a temporary show ofdissatisfactionby a group of workers, often by doing theirworkmore slowly, in order to make managers pay attention to their demands"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "sb who is on strike",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "striker",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "nounSTOP WORK công nhân bãi công, công nhân đình công",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "someone who is involved in a strike",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_Many people sympathize with the strikers."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]