[
    {
        "id": "",
        "name": "dangerous and harmful",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "harming sb/sth",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "harmful",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "có hại, gây hại [tính từ]",
                            "▪ Pushing kids so hard from such an early age is likely to have some harmful results.",
                            "Thúc ép trẻ em thật nghiêm khắc từ độ tuổi còn nhỏ như vậy có vẻ sẽ gây ra một số tác hại.",
                            "▪ Scientists tend to agree that most diets don’t work and can be harmful.",
                            "Các nhà học có xu hướng đồng ý rằng đa số chế độ ăn kiêng không hiệu quả và có thể gây hại.",
                            "▪ The destruction of the ozone layer will have a very harmful effect on the environment.",
                            "Sự hủy diệt tầng ozone sẽ gây ra tác hại tiêu cực lên môi trường.",
                            "harmful to",
                            "có hại đến",
                            "▪ 80% of Americans think that television is harmful to society and especially to children.",
                            "80% người Mỹ nghĩ rằng ti vi có hại đến xã hội và nhất là đến trẻ em."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "damaging",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "harmful and usually having a permanent effect:",
                        "examples": [
                            "có hại, gây thiệt hại[tính từ] có hại và thường có ảnh hưởng lâu dài",
                            "▪ Up to 1500 patients suffered damaging side-effects after taking the drug.",
                            "Lên đến 1500 bệnh nhân chịu đựng tác dụng phụ có hại sau khi sử dụng thuốc.",
                            "▪ The publicity that followed the scandal has been extremely damaging.",
                            "Sự công khai sau một số vụ bê bối đã gây ra hủy hoại lớn.",
                            "damaging to",
                            "gây hại đến",
                            "▪ The British beef crisis was damaging to the livelihoods of thousands of people in the industry.",
                            "Sự khủng hoảng thịt bò nước Anh đã gây hại đến kế sinh nhai của hàng ngàn người trong ngành công nghiệp."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "negative",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "likely to harm someone or something, especially in a way that is not too serious - use this especially about something that could also have a good effect if the situation was different:",
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be bad for",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A1",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to have a harmful effect on something such as an activity, organization, or type of work:",
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "not harming anything or anyone",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "harmless",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "không có hại, vô hại[tính từ]",
                            "▪ I don’t know why you’re so upset -- it was only a harmless bit of fun.",
                            "Tôi không biết tại sao bạn buồn nữa -- chỉ là một chút đùa vui vô hại thôi mà.",
                            "▪ Radioactive waste needs to be stored for 25,000 years before it is harmless.",
                            "Rác thải nhiễm phóng xạ cần được lưu trữ khoảng 25000 năm tới trước khi nó trở nên vô hại.",
                            "harmless enoughused to say that someone or something that may seem harmful, is in fact not harmful",
                            "có vẻ vô hại dùng để nói về ai đó hay vật gì có thể trông vô hại nhưng sự thật thì không",
                            "▪ He’s a little crazy, I know, but he’s harmless enough.",
                            "Anh ấy hơi điên rồ một chút, tôi biết, nhưng anh ấy trông có vẻ vô hại",
                            "harmlessly[adverb]",
                            "một cách vô hại[trạng từ]",
                            "▪ Fortunately the knife missed me and landed harmlessly on the floor.",
                            "May mắn thay, con dao trượt qua người tôi và cắm xuống sàn một cách vô hại."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "innocuous",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "not harmful - use this especially when people have said or believe that something or someone is harmful:",
                        "examples": [
                            "không có hại, vô hại[tính từ] không gây hại - dùng đặc biệt khi mọi người nói hay tin rằng vật gì hay người nào có hại",
                            "▪ The producer dismissed the comment as quite innocuous.",
                            "Nhà sản xuất đã xóa những bình luận tưởng chừng khá vô hại.",
                            "▪ The murder suspect was an innocuous-looking man with wire-framed glasses.",
                            "Nghi phạm giết người là một người đàn ông trông có vẻ vô hại với cặp kính cận.",
                            "seemingly/apparently innocuous",
                            "seeming harmless, but actually intended to be harmful",
                            "tưởng chừng vô hại, trông có vẻ vô hại",
                            "trông vô hại nhưng thật ra có hại",
                            "▪ Someone stood up and asked the professor an apparently innocuous question about his laboratory work.",
                            "Ai đó đứng lên và hỏi giáo sư một câu hỏi trông có vẻ vô hại về công trình thí nghiệm của ông ấy."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "do no harm",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/not do any harm  if an action, activity, experience etc does no harm, it does not harm someone or something and may even help:",
                        "examples": [
                            "không gây hại/ không có hại gì cả[cụm động từ] không làm hại người hay vật và có khi còn giúp ích",
                            "▪ Learning how to live on your own for a while will do you no harm at all.",
                            "Học cách sống tự lập một khoảng thời gian sẽ chẳng có hại gì cho bạn.",
                            "it would do no harm to do something",
                            "sẽ không sao khi làm điều gì",
                            "▪ I expect they’ve sold all the tickets, but it won’t do any harm to ask.",
                            "Tôi mong rằng họ đã bán hết vé, nhưng sẽ không sao khi hỏi họ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "friendly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "thận thiện, hòa đồng, cởi mở[tính từ]",
                            "environment-friendly/ozone-friendly etc",
                            "used especially about products in shops, meaning that they do not harm the environment etc:",
                            "thân thiện với môi trường/ tầng ozone vâng vâng",
                            "dùng khi để nói về sản phẩm trong các cửa hàng, khichúng không gây hại cho môi trường vâng vâng",
                            "▪ Look for aerosols which say ‘ozone-friendly’ on the can.",
                            "Hãy tìm những bình thuốc trừ sâu mà ghi chữ 'thân thiện với tầng ozone' trên bình.",
                            "▪ Tighter laws are needed to prevent manufacturers from falsely claiming their products are environment friendly.",
                            "Những quy định chặt chẽ là cần thiết để ngăn chặn các nhà sản xuất khỏi việc quả quyết sai lầm rằng các sản phẩm của họ thân thiện với môi trường."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "likely to harm people’s health or the environment",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "harmful",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "gây hại, có hại[tính từ]",
                            "▪ Scientists have recommended that new technology be used to target harmful bacteria.",
                            "Các nhà khoa học đề xuất một công nghệ mới được sử dụng để nhắm đến những vi khuẩn có hại.",
                            "▪ Many of the products that we have around our homes are harmful if swallowed.",
                            "Nhiều sản phẩm mà chúng ta có trong nhà gây hại nếu chúng ta nuốt chúng.",
                            "▪ The protests were aimed at ending the dumping of harmful industrial waste at sea.",
                            "Những phản đối nhắm đến việc kết thúc nạn xả thải rác thải công nghiệp ra biển.",
                            "harmful to",
                            "gây hại đến, có hại cho",
                            "▪ The sun’s rays can be very harmful to the skin.",
                            "Các tia từ mặt trời có thể rất hại cho làn da."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "poisonous",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "something that is poisonous contains a chemical that makes people, animals, or plants etc very ill or could kill them if they breathe it, swallow it, or touch it etc:",
                        "examples": [
                            "gây độc, có độc[tính từ] thứ gì có độc khi chứa những chất hóa học làm con người, động vật, thực vật vâng vâng đau yếu hay có thể giết họ nếu họ hít phải nó, nuốt nó, hay chạm vào nó vâng vâng",
                            "▪ Don’t drink that -- it’s poisonous!",
                            "Đừng uống cái đó! -- nó có độc!",
                            "▪ The adder is the only poisonous snake in Britain.",
                            "Con rắn vipe là loài rắn duy nhất có độc ở Anh.",
                            "highly poisonous",
                            "cực độc",
                            "▪ Carbon monoxide is a highly poisonous gas, mostly produced by cars.",
                            "Các-bon mô-nô-xít là khí cực độc, hầu hết được thải ra từ xe hơi."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "hazardous",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adjective usually before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "mạo hiểm, nguy hiểm[tính từ thường trước danh từ]",
                            "hazardous chemicals/waste/substances etcsubstances that are poisonous and will harm people, animals, or the environment if they are not dealt with or got rid of carefully",
                            ":chất/ rác thải/ hợp chất nguy hiểm vâng vângnhững chất có độc và có thể gây hại cho người, động vật, cây cối, hay môi trường nếu chúng không được xử lý hay khử một cách cẩn thận",
                            "▪ Lead is one of the most hazardous substances known, causing cancer and nerve damage.",
                            "Chì là một trong những chất độc nhất từng được biết, gây ra bệnh ung thư và thiệt hại thần kinh.",
                            "▪ The building is now unoccupied, and all radioactive or hazardous materials have been removed.",
                            "Tòa nhà giờ đã bị bỏ trống và tất cả các phóng xạ hay chất độc đã bị loại bỏ",
                            "▪ We need better regulations regarding the transportation of hazardous waste along public roads.",
                            "Chúng tôi cần những quy định tốt hơn liên quan đến việc vận chuyển các rác thải nguy hiệm trên đường phố công cộng."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "toxic",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "chemicals, gases, or waste products that are poisonous and harmful to people, animals, or the environment - used especially in technical or scientific contexts:",
                        "examples": [
                            "độc[tính từ] chất hóa học, khí, hay sản phẩm rác thải có độc và gây hại đến con người, động - thực vật, hay môi trường - đặc biệt dùng trong kỹ thuật và khoa học",
                            "▪ Research has found that the drug contains a toxic chemical that can cause respiratory problems.",
                            "Nghiên cứu đã tìm ra rằng thuốc này có chứa một chất hóa học gây độc có thể gây ra một số vấn đề hô hấp.",
                            "toxic waste from factories etc",
                            "rác thải độc từ nhà máy vâng vâng",
                            "▪ We need more installations for the disposal of toxic waste.",
                            "chúng ta cần nhiều hơn thiết bị lắp đặt cho việc xả thải rác thải độc.",
                            "highly toxic",
                            "cực độc",
                            "▪ highly toxic radioactive waste products",
                            "sản phẩm rác thải phóng xạ cực độc",
                            "toxic to",
                            "có độc cho",
                            "▪ Carbon dioxide is not highly toxic to animals or humans in small amounts.",
                            "Carbon dioxide không quá độc cho động vật hay con người nếu ở lượng nhỏ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "noxious",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "a noxious chemical or gas harms your health and is very unpleasant:",
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]