[
    {
        "id": "",
        "name": "serious situation",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "when a situation, problem accident etc is bad",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "serious",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "very bad - use this about problems, accidents, illnesses, or crimes: nghiêm trọng",
                        "examples": [
                            "▪ The recent storms have caused serious damage.",
                            "Các cơn bão gần đây đã gây ra thiệt hại nghiêm trọng.",
                            "▪ The climbers got into serious difficulties and had to be air-lifted to safety.",
                            "Các nhà leo núi gặp những khó khăn nghiêm trọng và phải được không vận đến nơi an toàn.",
                            "▪ In the last two weeks, the situation has become more serious, with riots and strikes spreading across the country.",
                            "Trong vòng 2 tuần qua, tình trạng trở nên nghiêm trọng hơn, với những cuộc bạo loạn và đình công trên khắp đất nước.",
                            "▪ Violent crime is a serious problem in and around the capital.",
                            "Tội hành hung là 1 vấn đề nghiêm trọng trong thủ đô cũng như các vùng lân cận.",
                            "▪ The boy was taken to hospital with serious head injuries.",
                            "Chàng trai được đưa đến bệnh viện với chấn thương đầu nghiêm trọng.",
                            "seriously[adverb]",
                            "1 cách nghiêm trọng",
                            "▪ The collapse in coffee prices has seriously affected the economies of Brazil and Colombia.",
                            "Sự sụp đổ giá cà phê đã ảnh hưởng nghiêm trọng đến nền kinh tế Braxin và Colombia.",
                            "seriously ill/injured",
                            "bị bệnh/thương nặng",
                            "▪ Her father is seriously ill in hospital.",
                            "Cha cô ta bị bệnh nặng trong bệnh viện.",
                            "seriousness[uncountable noun]",
                            "sự nghiêm trọng",
                            "▪ The public are beginning to realize the seriousness of drunk driving.",
                            "Công chúng đang dần nhận ra sự nghiêm trọng của việc lái xe khi say xỉn."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "bad",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "a problem, illness, or accident that is bad is severe, and makes you feel worried: nặng",
                        "examples": [
                            "▪ The pain was really bad.",
                            "Đau rất nặng.",
                            "▪ Paul’s off work - he’s got a bad cold.",
                            "Paul phải nghỉ việc vì cảm nặng.",
                            "▪ Judy had been in a bad car crash several years before, and was still too nervous to drive.",
                            "Vài năm trước Judy bị tai nạn xe nặng và giờ cô ấy vẫn còn thấy lo lắng khi lái xe.",
                            "things are bada situation is bad spoken",
                            "Tình hình tệ đi",
                            "▪ Things are bad in York - some people’s houses have been flooded three times.",
                            "Tình hình tệ đi ở York - một số nhà của người dân đã bị ngập 3 lần.",
                            "badly[adverb]tệ",
                            "badly injured/damaged/affected etc",
                            "Bị thương/hư/ảnh hưởng... nặng",
                            "▪ Two of the passengers were killed, and the driver was badly injured.",
                            "2 trong số các hành khách bị giết còn tài xế bị thương nặng.",
                            "▪ The front of the shop had been blown away, and the roof was badly damaged.",
                            "Mặt trước của cửa hàng bị thổi bay còn mái nhà thì bị hư nặng."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "grave",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "a grave situation or mistake is very serious and worrying because people are in danger and because the situation seems likely to get worse: trầm trọng, nghiêm trọng",
                        "examples": [
                            "▪ The situation is grave -- war now seems inevitable.",
                            "Tình hình đang dần nghiêm trọng -- chiến tranh dường như là không thể tránh.",
                            "▪ The ambassador declared that there would be grave consequences if the hostages were not released.",
                            "Đại sứ tuyên bố rằng sẽ có những hậu quả trầm trọng nếu các con tin không được thả ra.",
                            "grave danger",
                            "Hiểm nguy trầm trọng",
                            "▪ A thick fog descended on the mountain, and I knew that we were in grave danger.",
                            "Sương mù dày đặc trên núi và tôi nhận ra chúng ta đang gặp hiểm nguy trầm trọng.",
                            "grave risk",
                            "nguy cơ nghiêm trọng",
                            "▪ There was a grave risk that the operation would leave him partly paralysed.",
                            "Có nguy cơ nghiêm trọng là cuộc phẫu thuật sẽ khiến anh ta bị liệt 1 phần.",
                            "grave mistake/error",
                            "lỗi nghiêm trọng",
                            "▪ ‘It would be a grave mistake,’ said the president, ‘to ignore the problem, and pretend that it will go away.’",
                            "\"Sẽ là lỗi lầm nghiêm trọng\", tổng thống nói, \"nếu làm ngơ vấn đề này và giả vờ rằng nó sẽ biến mất\".",
                            "gravely[adverb]",
                            "1 cách nghiêm trọng",
                            "gravely ill",
                            "bệnh trầm trọng",
                            "▪ Leopold’s mother was gravely ill, and he returned to Vienna as quickly as he could.",
                            "Mẹ của Leopold bị bệnh trầm trọng nên anh ấy sẽ cố trở về Vienna càng sớm càng tốt.",
                            "gravity/ˈgrævɪti, ˈgrævəti/ [uncountable noun] when something is grave:sự nghiêm trọng",
                            "▪ He didn’t seem to realize the gravity of the situation.",
                            "Anh ta dường như không nhận ra sự nghiêm trọng của tình hình."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "critical",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "a critical situation is very serious and dangerous and might get worse very suddenly - use this especially when people will die if it does not improve: cấp bách, nguy cấp",
                        "examples": [
                            "▪ The situation is said to be critical and the army has been brought in to disperse the mob.",
                            "Tình hình được cho là rất cấp bách và quân đội được điều động tới để giải tán đám đông.",
                            "▪ Things are now critical. Hospitals have no medicine, and people are running out of food.",
                            "Mọi thứ đang trở nên nguy cấp. Bệnh viện không còn thuốc và mọi người cũng sắp hết thức ăn.",
                            "be in a critical conditionBritish /be in critical conditionAmerican so ill or badly injured that you could die",
                            "trong tình trạng nguy kịch",
                            "▪ Eight people were killed and four are still in a critical condition.",
                            "8 người đã bị giết và 4 người vẫn trong tình trạng nguy kịch.",
                            "critically[adverb]",
                            "1 cách cấp bách",
                            "critically ill/injured",
                            "Bị bệnh/thương nặng",
                            "▪ A police officer is critically ill after being shot in the chest.",
                            "Viên sĩ quan cảnh sát bị thương nặng sau khi bị bắn vào ngực."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "desperate",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "a desperate situation or problem is very serious or dangerous, and it does not seem possible that it will improve - use this especially when people will die if it does not improve: ghê gớm, dữ dội",
                        "examples": [
                            "▪ Refugees on the border are living in appalling conditions with desperate shortages of food, medicine and water.",
                            "Những người tị nạn ở biên giới đang sống trong những điều kiện khủng khiếp với sự thiếu hụt ghê gớm thức ăn, thuốc men và nước sạch.",
                            "▪ The situation was desperate. The enemy were now only a mile away.",
                            "Tình hình trở nên dữ dội hơn. Kẻ thù giờ chỉ cách vài dặm."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "be in desperate need of something đang rất cần",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The hospital is full of people in desperate need of medical attention.",
                                    "Bệnh viện đầy những người đang rất cần sự chăm sóc y tế."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "acute",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "an acute illness, problem, or situation is one that has become very serious or dangerous, and needs to be dealt with quickly: cấp tính, nghiêm trọng, nguy cấp",
                        "examples": [
                            "▪ She was taken to the hospital suffering from acute appendicitis.",
                            "Cô ấy đã được đưa đến bệnh viện vì bị viêm ruột thừa cấp tính.",
                            "▪ Patients suffering from acute depression may well need medication.",
                            "Bệnh nhân bị trầm cảm nghiêm trọng có lẽ phải chữa trị bằng thuốc.",
                            "▪ Nowhere is the problem more acute than Los Angeles County, where gang-related homicide is on the increase.",
                            "Không đâu mà vấn đề nghiêm trọng hơn Los Angeles bây giờ khi mà tình trạng giết người liên quan đến các băng đảng đang leo thang.",
                            "▪ In San Diego, the shortage of skilled workers is acute.",
                            "Tại San Diego, tình trạng thiếu lao động có tay nghề đang nguy cấp."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "grim",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "a situation or piece of news that is grim is serious and unpleasant, and people think it will not get better: tồi tệ, khắc nghiệt",
                        "examples": [
                            "▪ The situation is grim for the innocent people, caught up in this conflict.",
                            "Tình hình trở nên tồi tệ đối với những người vô tội khi bị cuốn vào cuộc xung đột này.",
                            "▪ Rescue workers are continuing the grim task of searching for bodies.",
                            "Các nhân viên cứu hộ tiếp tục công việc tìm kiếm xác đầy khắc nghiệt.",
                            "grim news",
                            "Tin xấu",
                            "▪ The next few weeks brought more grim news, as the economic crisis began to deepen.",
                            "Vài tuần tiếp theo đã mang lại nhiều tin xấu vì khủng hoảng kinh tế trở nên sâu sắc hơn.",
                            "grim prospectsomethingbad that will probably happen",
                            "viễn cảnh tồi tệ",
                            "▪ Two thousand car workers face the grim prospect of redundancy.",
                            "2000 công nhân trong ngành ô tô phải đối mặt với viễn cảnh dư thừa tồi tệ.",
                            "things look grimthe situation seems grim",
                            "Mọi thứ trở nên tồi tệ",
                            "▪ Things look pretty grim for farmers at the moment.",
                            "Mọi thứ trở nên tồi tệ với những người nông dân bây giờ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be no laughing matter",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "[spoken]",
                        "region": "",
                        "definition": "use this to say that something is serious and not something you should joke about: không phải chuyện đùa",
                        "examples": [
                            "▪ Getting up for work at 5am every day is no laughing matter, especially in winter.",
                            "Dậy sớm để đi làm lúc 5 giờ sáng thật không phải chuyện đùa, đặc biệt là vào mùa đông.",
                            "▪ English teachers often joked that they could not pass the exam, but for the students it was no laughing matter.",
                            "Giáo viên tiếng Anh thường đùa rằng họ có thể không qua nổi kỳ thi nhưng với sinh viên thì đó không phải chuyện đùa."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be a matter of life and death",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/be a matter of life or death  if a situation is a matter of life and death, it is very serious, and what you do will affect whether the situation ends well or not - use this especially when it is possible that someone will die: vấn đề sống còn, quan trọng",
                        "examples": [
                            "▪ People grow their own food, and the success of their harvest is literally a matter of life or death.",
                            "Mọi người đều sống nhờ thực phẩm họ làm ra nên vụ mùa có bội thu hay không thật sự là vấn đề sống còn của họ.",
                            "▪ In this town football isn’t just a game - it’s a matter of life and death.",
                            "Ở thị trấn này, bóng đá không chỉ là 1 trò chơi mà còn là 1 điều vô cùng quan trọng."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be no joke",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "[informal]",
                        "region": "",
                        "definition": "if you say that a situation or event is no joke, it is difficult or unpleasant: không phải đùa",
                        "examples": [
                            "▪ It’s no joke if you have an accident in the mountains -- it’s fifty miles to the nearest hospital.",
                            "Không phải đùa khi bạn gặp tai nạn trên núi vì nó cách xa bệnh viện ít nhất 50 dặm.",
                            "▪ Crossing the road was no joke with all the early morning traffic.",
                            "Băng qua đường không phải đùa với giao thông lúc sáng sớm."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "a bad situation that might get worse",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "crisis",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a very bad situation in which there is a risk that serious problems will become suddenly worse - use this about political or economic affairs or personal or emotional problems:",
                        "examples": [
                            "khủng hoảng",
                            "▪ Their marriage was going through a crisis which almost ended in divorce.",
                            "Hôn nhân của họ đã trải qua sự khủng hoảng gần như phải ly dị",
                            "▪ The Cuban missile crisis in 1960 was probably the closest we have been to nuclear war.",
                            "Khủng hoảng tên lửa Cuba năm 1960 có lẽ là cuộc chiến tranh hạt nhân gần đây nhất.",
                            "▪ In recent years, the country has suffered a profound political and economic crisis, and deprivation is acute.",
                            "Trong vài năm gần đây, đất nước phải hứng chịu những khủng hoảng kinh tế và chính trị sâu sắc, những mất mát là rất sâu sắc.",
                            "in crisis",
                            "trong tình trạng khủng hoảng",
                            "▪ The Health Service is in crisis.",
                            "Dịch vụ y tế đang trong tình trạng khủng hoảng.",
                            "▪ a charity set up to help families in crisis",
                            "1 hội từ thiện đã được thành lập để cứu những gia đình gặp khủng hoảng.",
                            "in a crisis",
                            "trong 1 cuộc khủng hoảng",
                            "▪ We need someone who can stay calm in a crisis.",
                            "Chúng ta cần ai đó có thể giữ bình tĩnh trong cơn khủng hoảng.",
                            "spark a crisiscause a crisis to start",
                            "nổ ra cuộc khủng hoảng",
                            "▪ The President announced his resignation, sparking a crisis in the government.",
                            "Tổng thống tuyên bố từ chức làm nổ ra cuộc khủng hoảng trong chính phủ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "emergency",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a very serious situation, such as an accident, that happens suddenly and needs to be dealt with immediately: tình trạng khẩn cấp, nguy cấp",
                        "examples": [
                            "▪ Staff are trained to deal with any emergency.",
                            "Nhân viên được đào tạo để quyết những trường hợp khẩn cấp.",
                            "▪ A fire started in the cargo area, and the pilot was forced to make an emergency landing.",
                            "Lửa bắt đầu nổi lên ở khu vực hàng hóa và phi công buộc phải hạ cánh khẩn cấp.",
                            "▪ The victim was rushed to hospital for emergency surgery.",
                            "Nạn nhân được đưa gấp tới bệnh viện để phẫu thuật khẩn cấp.",
                            "in an emergencyif there is an emergency",
                            "trong trường hợp khẩn cấp",
                            "▪ In an emergency, dial 911 for police, the fire department or an ambulance.",
                            "Trong trường hợp khẩn cấp, gọi 911 khi cần cảnh sát, phòng cháy chữa cháy hay cấp cứu.",
                            "the emergency servicesBritish the organizations that come to help you if there is an emergency",
                            "Dịch vụ khẩn cấp",
                            "▪ The emergency services in this area simply couldn’t cope if there were a major accident or terrorist attack.",
                            "Các dịch vụ khẩn cấp trong lĩnh vực này không thể giải quyết những tai nạn nghiêm trọng hay tấn công khủng bố."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]