[
    {
        "id": "",
        "name": "certainly",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "when sth is definitely true",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "certainly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[adv]",
                        "usage": "",
                        "region": "",
                        "definition": "/definitelyB1  use this to emphasize that something is definitely true. Definitely is more common in spoken English than certainly:",
                        "examples": [
                            "▪ Incredible as they seem, these events certainly took place",
                            ".▪ We don’t know exactly when the house was built, but it’s certainly over 200 years old.",
                            ".▪ I definitely posted the cheque last week, so it should have arrived by now.",
                            ".▪ ‘I think it would be a great opportunity.’ ‘Yeah, definitely.",
                            "’definitely/certainly not chắc chắn không",
                            "▪ ‘She’s not thinking of going back out with Simon again?’ ‘No, definitely not.’\"Cô ấy sẽ không quay lại với Simon đúng không?\" \"Không, chắc chắn không\""
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "undoubtedly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/unquestionably/without doubt/without a doubt/ʌnˈdaʊtɪdli, ʌnˈdaʊtədli, ʌnˈkwestʃənəbli, wɪðˌaʊt ˈdaʊt, wɪðˌaʊt ə ˈdaʊt/  use this to say that, in your opinion, something is definitely true about someone or something:không nghi ngờ gì",
                        "examples": [
                            "▪ The years my parents spent in Kenya were undoubtedly the happiest of their lives."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪ Japan has unquestionably one of the most successful economies in the world.Nhật",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Without a doubt, taxation is going to be the key issue in the President’s campaign."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "there’s no doubt",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "usage": "",
                        "region": "",
                        "definition": "/there’s no question/ðeəʳz ˌnəʊ ˈdaʊt, ðeəʳz ˌnəʊ ˈkwestʃən/ use this to say that, in your opinion, something definitely is true about someone or something: there’s no doubt/there’s no question that:không nghi ngờ gì nữa, hiển nhiên là",
                        "examples": [
                            "▪ There’s no doubt that he completely dominates her.Hiển nhiên là anh ta hoàn toàn áp đảo",
                            "▪ There is no question that Maridan had known all about the deal.Hiển nhiên là Maridan biết tất cả về cuộc thỏa thuận",
                            "▪ There was no doubt that, without the peacekeeping force, the civil war would have continued.Không nghi ngờ gì nữa khi không còn những nỗ lực giữ hòa bình, cuộc nội chiến sẽ tiếp tục",
                            "there’s no doubt/there’s no question about it/about that: không nghi ngờ gì nữa",
                            "▪ You can see they’re short of staff -- there’s no doubt about it.Bạn có thể thấy chúng tôi đang thiếu nhân viên - đó là điều hiển nhiên",
                            "▪ ‘We made some mistakes. No question about that,’ Glavine said.\"Chúng tôi đã gây ra những sai lầm .hiển nhiên là như vậy\""
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "beyond a shadow of a doubt",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/bɪˌjɒnd ə ˌʃædəʊ əv ə ˈdaʊtǁbɪˌjɑːnd-/  use this to say that, in your opinion, there is definitely no doubt at all that something is true:không còn nghi ngờ gì nữa, hiển nhiên là",
                        "examples": [
                            "▪ The evidence proves, beyond a shadow of a doubt, that this man was in the victim’s apartment on the day of the murder.Bằng chứng đã chứng minh, mà không nghi ngờ gì nữa, người đàn ông đó là nạn nhân trong vụ mưu sát ở căn hộ ngày hôm đó"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "surely",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈʃʊəʳli/  spoken say this when you want to emphasize that something must be true and you want the person you are talking to to agree with you:chắc chắn là",
                        "examples": [
                            "▪ Surely he must have realized that the money was stolen.Chắc chắn là anh ta đã nhận ra tiền đã bị ăn cắp",
                            "▪ ‘I’m not sure how the heating system works.’ ‘Surely it can’t be that complicated.’\"Tôi không chắc là hệ thống sưởi có hoạt động hay không\" \"Chắc chắn là nó sẽ không khó như vậy\"",
                            "▪ Your car must be worth more than $500, surely!chắc chắn xe của cậu hẳn phải mất hơn 500 đô",
                            "surelyadverb",
                            "used to express that you are certain or almost certain about something",
                            "_The fault surely lies in the design of the equipment.",
                            "_US\"May I sit here?\" \"Surely (= Yes, certainly) .\"",
                            "_Without more food and medical supplies, these people will surely not survive."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "beyond dispute",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "be /biː bɪˌjɒnd dɪˈspjuːtǁ-ˌjɑːnd-/  if something is beyond dispute it certainly happened or exists and no one thinks differently:chắc chắn, không nghi ngờ giờ",
                        "examples": [
                            "▪ Her professionalism is beyond dispute.sự chuyên nghiệp của cô ấy là một điều chắc chắn",
                            "▪ That the reports were stolen is beyond dispute. What we need to know is who took them.Bản báo cáo bị mất cắp là một điều không nghi ngờ gì nữa, chúng ta cần biết được là ai đã lấy nó đi"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "when sth will definitely happen",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "certainly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/definitely B1 use this to say that you are completely sure that something will happen or that someone will do something. Definitely is more common in spoken English than certainly: chắc chắn rồi/ đương nhiên rổi",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪ I’ll certainly be glad when this course is over",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "A2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    ".▪ Roger and Andy are definitely coming, but I’m not sure about Nancy.",
                                    "▪ Owen is injured and will definitely miss the game on Saturday."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "for sure",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/fəʳ ˈʃʊəʳ/  informal if you say that something will happen for sure, you mean it will certainly happen:Chắc chắn",
                        "examples": [
                            "▪ Yeah, you’ll see him. He’ll be there for sure.Cậu sẽ thấy anh ta. Anh ta chắc chắn sẽ ở đây",
                            "▪ Milan are going to win the cup for sure. They’re just such a strong team.that’s for sureMilan chắc chắn sẽ chiến thắng cúp lần này, họ là một đội mạnh",
                            "▪ She’ll come home when she runs out of money, that’s for sure.Cô ta sẽ trở về nhà , điều đó là chắc chắn"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "bound",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "be  to/be sure to/be certain to/biː ˈbaʊnd tuː, biː ˈʃʊəʳ tuː, biː ˈsɜːʳtn tuː/  if something is bound to happen it is certain to happen, especially because that is what always happens:sẽ có thể",
                        "examples": [
                            "▪ The kids are bound to be hungry when they get home -- they always are.Những đứa trẻ sẽ có thể bị đói khi chúng về nhà - họ sẽ luôn như vậy",
                            "▪ My car broke down today. It was bound to happen sooner or later.Xe của tôi bị hỏng ngày hôm qua, nó sẽ xảy ra sớm hay muộn thôi",
                            "▪ Have you asked Ted? He’s sure to know.Cậu đã hỏi Ted chưa? Chắc anh ta sẽ biết",
                            "▪ The drop in prices and lack of demand are certain to affect the manufacturing industry.Việc giá bị giảm và thiếu nhu cầu chắc chắn sẽ ảnh hưởng nền công nghiệp sản xuất"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "matter of time",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "it’s only/just a /biː ˌəʊnli, ˌdʒʌst ə ˌmætər əv ˈtaɪm/  use this to say that something is certain to happen but no one knows exactly when:chỉ còn là vấn đề thời gian, chắc chắn sẽ",
                        "examples": [
                            "▪ You’ll learn how to do it eventually -- it’s only a matter of time.Bạn chắc chắn phải học cách làm điều đó- nó chỉ là vấn đề về thời gian.",
                            "▪ Your father is dying and there’s nothing we can do. I’m afraid it’s just a matter of time.Cha của bạn đang bị ốm nặng và chúng tôi không thể làm gì. Tôi sợ rằng nó chỉ là vấn đề về thời gian.",
                            "it’s only/just a matter of time before. Nó chỉ/ chỉ là vấn đề về thời gian trước khi",
                            "▪ It was only a matter of time before Lynn found out Phil’s secret.Chỉ là vấn đề thời gian trước khi Lynn phát hiện ra bí mật của Phil"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "cut and dried",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌkʌt ən ˈdraɪd◂/  if something is cut and dried, it is certain to happen in a particular way because it has already been planned or decided, and nothing can be done to change it:sẽ xảy ra vì đã được lên kế hoạch",
                        "examples": [
                            "▪ My future was cut and dried. I would join my father’s firm, and take it over when he retired.Tương lai của tôi đã được định sẵn tôi sẽ làm việc trong công ty của bố và sẽ tiếp quản nó nếu như bố tôi nghỉ hưu",
                            "▪ We made the arrangements weeks ago. It’s all cut and dried.Chúng tôi đã có một thỏa thuận vào tuần trước, nó đã được bàn bạc rất kĩ"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be a certainty",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "if something is a certainty, it is certain to happen, especially because the situation has changed and made it certain : là một điều hiển nhiên",
                        "examples": [
                            "Johnson was the fastest man on earth, and a gold medal seemed a certainty.",
                            "Being left alone in her old age, the fate she had always feared, now became a certainty."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "foregone conclusion",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "be a /biː ə ˌfɔːʳgɒn kənˈkluːʒənǁ-gɔːn-/  if something, especially a result, is a foregone conclusion, it is certain to happen even though it has not yet been officially decided:Một điều sẽ xảy ra",
                        "examples": [
                            "▪ Ian’s bound to get the job -- it’s a foregone conclusion.Ian sẽ có được nhiều công việc - đó là một điều chắc chắn sẽ xảy ra."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪ The outcome of the battle was a foregone conclusion.kết quả của cuộc chiến là điều sẽ xảy ra",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "D",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "uncategorized",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "sure",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "usage": "",
                        "region": "",
                        "definition": "adverbinformal",
                        "examples": [
                            "certainly",
                            "_\"Do you want to come swimming with us?\" \"Sure.\"",
                            "_mainlyUS\"Will you help me with this?\" \"Sure I will.\"",
                            "_USI sure am hungry."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "indeed",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "usage": "",
                        "region": "",
                        "definition": "adverb",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "really or certainly, often used to emphasize something",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_Indeed, it could be the worst environmental disaster inWestern Europethis century.",
                                    "_Evidence suggests that errors may indeed be occurring.",
                                    "_We live in strange times indeed.",
                                    "_mainly UKMany people areverypoor indeed."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "firm",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "usage": "",
                        "region": "",
                        "definition": "adjectiveCERTAIN",
                        "examples": [
                            "certain and not likely to change; definite",
                            "_He is a firm believer in traditional family values.",
                            "_Some people still claim that there is no firm evidence linking smoking with lung cancer.",
                            "firmlyadverbCERTAINLY",
                            "in a way that is certain or definite",
                            "_We are firmly committed to reducing unemployment."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "easily",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "usage": "",
                        "region": "",
                        "definition": "adverbCERTAINLY",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "without doubt",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_For me,Veniceis easily the most beautiful city inEurope."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]