[
    {
        "id": "",
        "name": "simple plain",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "not having a lot of decoration or things added",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "plain",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "plain food, clothes, or designs do not have anything added or any decoration, and may be a little boring: giản dị, trơn, đơn sơ",
                        "examples": [
                            "▪ He put the letter in a plain brown envelope.",
                            "Ông đặt lá thư trong một phong bì màu nâu giản dị.",
                            "▪ Do you have any plain white shirts?",
                            "Bạn có áo sơ mi trắng trơn nào không?",
                            "▪ The chapel was a small, plain, white-washed building.",
                            "Nhà nguyện là một tòa nhà trắng nhỏ và đơn sơ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "austere",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "a room or building that is austere is not decorated, has very little and very plain furniture, and is usually uncomfortable: mộc mạc",
                        "examples": [
                            "▪ Students ate in an austere hall built by New England Puritans.",
                            "Học sinh ăn trong một phòng ăn mộc mạc được xây bởi người đạo Thanh giáo ở New England.",
                            "▪ The crematorium chapel was cold and austere.",
                            "Nhà nguyện hỏa táng lạnh và mộc mạc."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "spartan",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "spartan conditions or ways of living are simple and without any comfort: khắc khổ",
                        "examples": [
                            "▪ The accommodation is pretty spartan, so take extra blankets and bedding.",
                            "Chỗ ở khá khắc khổ, do đó lấy thêm chăn và giường ngủ.",
                            "▪ It was a spartan existence, with no running water or electricity.",
                            "Đó là một lối sống khắc khổ, không có nước máy hoặc điện."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "basic",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "basic food, rooms, or designs only have the necessary features, and do not include things that make them more comfortable, more attractive etc: cơ bản",
                        "examples": [
                            "▪ Some of the hotels in the mountains are pretty basic.",
                            "Một số khách sạn ở vùng núi khá cơ bản.",
                            "▪ The basic model costs £30,000, which includes insurance and car tax.",
                            "Mô hình cơ bản chi phí 30.000 bảng Anh, bao gồm bảo hiểm và thuế xe hơi.",
                            "▪ basic cooking utensils",
                            "dụng cụ nấu ăn cơ bản"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "stark",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "something, especially a room, that has a stark appearance has no decorations and looks uncomfortable: cứng, thô kệch",
                        "examples": [
                            "▪ The waiting room was stark, with hard, stiff chairs and lit by a single lightbulb.",
                            "Phòng đợi thật thô kệch, với những chiếc ghế thô cứng và được thắp bằng một bóng đèn đơn",
                            ".▪ stark chrome furniture",
                            "Đồ nội thất bằng gỗ crom cứng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "simplicity",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "the attractive quality of being simple, and not having a lot of decoration or things added: sự đơn giản",
                        "examples": [
                            "▪ The jacket follows the lines of the body with graceful simplicity.",
                            "Áo khoác may theo các đường nét của cơ thể với sự đơn giản đầy duyên dáng.",
                            "▪ Van Gogh was attracted to the beauty and simplicity of a common table or kitchen chair.",
                            "Van Gogh bị thu hút bởi vẻ đẹp và sự đơn giản của một chiếc bàn hay bếp ăn thông thường."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "simple",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "simple food, clothes, or designs do not have a lot of decoration or unnecessary things added, but they are usually attractive or enjoyable: đơn giản",
                        "examples": [
                            "▪ She wore a simple black dress.",
                            "Cô mặc một chiếc váy đen đơn giản.",
                            "▪ The meal was simple, but delicious.",
                            "Bữa ăn đơn giản, nhưng ngon."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "nothing fancy",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective phrase]",
                        "usage": "[informal]",
                        "region": "",
                        "definition": "plain or simple with nothing special or unnecessary added: không gì đặc biệt, lạ",
                        "examples": [
                            "▪ The Lodge is nothing fancy -- just a row of cottages huddled on the side of a hill overlooking the sea.",
                            "Lodge là không có gì đặc biệt cả - chỉ là một hàng các ngôi nhà lộn xộn trên một ngọn đồi nhìn ra biển.",
                            "▪ This was his favourite meal. Nothing fancy, just steak and salad.",
                            "Đây là bữa ăn ưa thích của ông. Không có gì lạ, chỉ cần lát thịt và ít rau trộn giấm."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "no-frills",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a no-frills shop, restaurant, or service provides only the things that you really need and nothing else: không cầu kỳ, kiểu cách",
                        "examples": [
                            "▪ The meeting was held at a no-frills hotel 30 minutes from corporate headquarters.",
                            "Cuộc họp được tổ chức tại một khách sạn không cầu kỳ cách 30 phút từ trụ sở chính của công ty.",
                            "▪ Try the smaller, no-frills airlines for cheap late flights.",
                            "Thử các hãng hàng không nhỏ hơn, không kiểu cách và rẻ tiền đối với các chuyến bay muộn."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]