[
    {
        "id": "",
        "name": "strange suspicious and unnatural things and people",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "strange situations, experiences, smells, tastes etc",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "strange",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/streɪndʒ/  very different from what you expect or from what usually happens, in a way that makes you feel a little frightened or surprised:kỳ lạ, lạ lùng",
                        "examples": [
                            "▪ A strange noise woke her up.",
                            "Một tiếng động kỳ lạ đánh thức cô dậy.",
                            "▪ I had a strange feeling that I’d been there before.",
                            "Tôi đã có một cảm giác kỳ lạ là tôi đã từng ở đó.",
                            "▪ Amanda’s eyes glowed in a strange way, like a cat’s.",
                            "Đôi mắt Amanda phát sáng một cách kỳ lạ, giống như con mèo.",
                            "▪ He seemed to know lots of things about me, but the strange thing is I didn’t even tell him my name.",
                            "Anh ta có vẻ biết rất nhiều điều về tôi, nhưng điều lạ lùng là tôi thậm chí còn không nói với anh ấy tên của tôi.",
                            "it is strange that",
                            "Thật lạ là",
                            "▪ It’s strange that you’ve never met him - he lives in your street.",
                            "Thật lạ là bạn chưa bao giờ gặp anh ta - anh ta sống cùng phố với bạn.",
                            "strangely[adverb] 1 cách kỳ lạ",
                            "▪ The downtown streets were strangely empty and peaceful.",
                            "Đường phố trung tâm thành phố rỗng tuếch và yên bình 1 cách kỳ lạ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "funny",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "alsooddespecially British /ˈfʌni ɒdǁɑːd/  somethingfunnyoroddis a little strange and it makes you feel slightly worried or surprised because you cannot explain it or you do not know what it is:kỳ quặc, kỳ lạ",
                        "examples": [
                            "▪ There’s a funny smell coming from the fridge.",
                            "Có mùi kỳ quặc từ tủ lạnh.",
                            "▪ Thumps and laughter and odd noises were coming out of the living room.",
                            "Những tiếng động và tiếng cười và những tiếng ồn kỳ lạ xuất hiện trong phòng khách.",
                            "it is funny/odd that",
                            "Thật buồn cười / kỳ quặc là",
                            "▪ It seems odd that no one noticed him coming in.",
                            "Có vẻ kỳ quặc khi không ai để ý anh ta vào.",
                            "▪ It’s funny that he managed to hit the ball because he never hits it in practice.",
                            "Thật buồn cười là anh ấy đã đánh trúng quả bóng bởi vì thực tế anh ấy không bao giờ chạm vào nó.",
                            "that’s funny/that’s odd spoken",
                            "Thật buồn cười",
                            "▪ ‘Your keys aren’t here.’ ‘That’s funny - I’m sure I left them on the table.’",
                            "'Chìa khóa của bạn không có ở đây.' Thật là buồn cười - Tôi chắc chắn là tôi đã bỏ chúng trên bàn'.",
                            "oddly[adverb]",
                            "1 cách kỳ quặc",
                            "▪ The eggplant was limp and oddly pale.",
                            "Cà tím bị mềm và tái đi 1 cách kỳ quặc.",
                            "Oddly enough",
                            "Kỳ lạ là",
                            "Oddly enough I didn’t feel at all nervous about visiting the prison.",
                            "Kỳ lạ là tôi không hề cảm thấy lo lắng khi đến thăm nhà tù."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "peculiar",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/pɪˈkjuːliəʳ/  strange and slightly unpleasant:kỳ dị, khác thường",
                        "examples": [
                            "▪ This meat tastes peculiar.",
                            "Thịt này có vị khác thường.",
                            "▪ I’ve been having very peculiar dreams the past few weeks.",
                            "Tôi đã có những giấc mơ rất kỳ dị trong vài tuần qua.",
                            "▪ I heard a peculiar warbling from the living room.",
                            "Tôi nghe thấy một tiếng hát líu lo khác thường từ phòng khách."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "mysterious",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/mɪˈstɪəriəs/  use this about something that people know very little about and that is difficult to explain or understand:bí ẩn",
                        "examples": [
                            "▪ No one could offer an explanation for his mysterious disappearance",
                            "Không ai có thể đưa ra lời giải thích cho sự biến mất bí ẩn của anh ấy.",
                            ".▪ I kept getting mysterious phone calls where the caller would hang up as soon as I answered.",
                            "Tôi tiếp tục nhận được các cuộc gọi điện thoại bí ẩn, họ tắt máy ngay khi tôi trả lời.",
                            "under mysterious circumstances",
                            "một cách bí ẩn",
                            "▪ Two weeks later, the shop burned to the ground under mysterious circumstances.",
                            "Hai tuần sau, cửa hàng bị đốt cháy dưới đất 1 cách bí ẩn.",
                            "mysteriously[adverb]",
                            "Một cách huyền bí",
                            "▪ Mysteriously, no one had noticed anyone leave or enter the room.",
                            "Một cách huyền bí, không ai để ý thấy ai ra khỏi phòng."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "weird",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/wɪəʳd/  aweirdexperience, feeling, sight, or sound is strange and very different from what you are used to:kỳ quái, kỳ lạ",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪ She only had lipstick on her bottom lip which looked pretty weird",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "Cô ấy chỉ son ở môi dưới khiến cô trông khá kỳ quái.",
                                    ".▪ It’s a weird feeling to go back to a place that you lived in a long time ago.",
                                    "Thật là một cảm giác kỳ lạ khi trở lại một nơi mà bạn đã sống trong một thời gian dài trước đây."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "bizarre",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/bɪˈzɑːʳ, bəˈzɑːʳ/  extremely strange, and very different from what is generally considered to be normal, especially in a frightening or slightly worrying way:kỳ quái",
                        "examples": [
                            "▪ Woods disappeared in very bizarre circumstances, and no trace of him has ever been found.",
                            "Woods biến mất một cách kỳ quái, và không có dấu vết nào của anh ta từng được tìm thấy.",
                            "▪ It was bizarre - if we took longer than five minutes in the bathroom, we had to explain why to our manager.",
                            "Thật kỳ quái - nếu chúng tôi mất hơn 5 phút trong phòng tắm, chúng tôi phải giải thích lý do với người quản lý của mình."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "eerie",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈɪəri/  strange and frightening:kỳ lạ, kỳ quái",
                        "examples": [
                            "eerily[adverb]1 cách kỳ quái",
                            "▪ The forest around them remained eerily silent.",
                            "Rừng xung quanh chúng vẫn im lặng một cách ký quái."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪ An eerie howl filled the cave",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "Một tiếng hú kỳ quái vang khắp hang động .",
                                    ".▪ I had the eerie feeling that somebody was watching me.",
                                    "Tôi có cảm giác kỳ lạ rằng ai đó đang theo dõi tôi.",
                                    "▪ The pumps were shut off now. It was eerie, being in the factory without their sound.",
                                    "Bây giờ máy bơm đã tắt. Thật kỳ lạ khi đang ở trong nhà máy mà không nghe tiếng đó."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "surreal",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/səˈrɪəl/  extremely strange, because nothing seems connected with real life or normal experiences, and things happen or appear together that do not belong together:kỳ quái, kỳ dị",
                        "examples": [
                            "▪ Living on the commune turned out to be a surreal experience.",
                            "Sống ở xã hóa ra là một trải nghiệm kỳ dị.",
                            "▪ The whole trial and the media circus surrounding it was surreal.",
                            "Toàn bộ cuộc thử nghiệm và giới truyền thông xiếc quanh đó thật là kỳ quái."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "curious",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective usually before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈkjʊəriəs/  strange and surprising but interesting, so that you want to know more about it:Kỳ lạ, kỳ dị, lạ lùng",
                        "examples": [
                            "▪ Life in the village was a curious combination of the old and the very new.",
                            "Cuộc sống trong làng là sự kết hợp kỳ lạ giữa cái cũ và cái mới.",
                            "▪ He had come to some curious arrangement with his landlady.",
                            "Anh ta đã có một sự sắp xếp kỳ lạ với chủ nhà của mình.",
                            "curiously[adverb]",
                            "một cách lạ lùng",
                            "▪ It was a curiously organized office.",
                            "Là văn phòng có tổ chức một cách lạ lùng."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "ironic",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/aɪˈrɒnɪkǁaɪˈrɑː-/  anironicsituation seems strange and amusing, because something happens that you would not expect at all:mỉa mai, châm biếm",
                        "examples": [
                            "▪ Her car was stolen from outside the police station, which is pretty ironic",
                            "Xe của cô đã bị đánh cắp ngoài đồn cảnh sát, điều này khá làmỉa mai",
                            ".▪ One of the study’s ironic discoveries is that TV trials educate the public about the justice system better than actual trials.",
                            "Một trong những khám phá châm biếm của nghiên cứu là các thử nghiệm truyền hình giáo dục công chúng về hệ thống pháp lý tốt hơn so với các thử nghiệm thực tế.",
                            "it is ironic that",
                            "Thật là châm biếm, mỉa mai khi",
                            "▪ It’s ironic that professional athletes are often such unhealthy people.",
                            "Thật mỉa mai khi các vận động viên chuyên nghiệp thường là những người không khỏe mạnh như vậy.",
                            "ironically[adverb]",
                            "Trớ trêu thay",
                            "▪ Ironically, it was his very success which led to the media attention and his eventual downfall.",
                            "Trớ trêu thay, thành công của anh dẫn đến sự chú ý của giới truyền thông nhưng cuối cùng chính nó lại khiến anh sa sút."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "a strange person",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "weirdo",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈwɪəʳdəʊ/  informal someone who is very strange in an unpleasant and sometimes threatening way:người kỳ quặc, kỳ lạ",
                        "examples": [
                            "▪ There’s a weirdo who stands in front of the store and talks to himself.",
                            "Có một người kỳ quặc đang đứng trước cửa hàng và nói chuyện với chính mình.",
                            "▪ When I travel by underground I always seem to end up sitting next to some weirdo.",
                            "Khi tôi đi xe điện ngầm, tôi dường như luôn luôn ngồi cạnh một số kẻ kỳ lạ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "oddball",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈɒdbɔːlǁˈɑːd-/  informal a strange person:người kỳ quặc",
                        "examples": [
                            "▪ Most of my family’s OK, but my brother’s a bit of an oddball.",
                            "Hầu hết gia đình tôi đều ổn, nhưng anh trai tôi hơi kỳ quặc.",
                            "▪ Growing up, most of the other kids considered me an oddball.",
                            "Lớn lên, phần lớn những đứa trẻ khác coi tôi là một đứa kỳ quặc."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "freak",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/friːk/  informal a very strange person, especially one who behaves oddly and has strange ideas:kẻ kỳ quặc",
                        "examples": [
                            "▪ The guy is probably just some freak who saw her on TV and decided he loves her.",
                            "Người đàn ông đó là một kẻ kỳ quặc khi anh ta chỉ nhìn thấy cô ấy trên TV mà đã quyết định yêu cô."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "control/neat/fast food etc freak",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "Người thích kiểm soát/ cuồng sạch/ cuồng thức ăn nhanh ...",
                                    "▪ Her husband’s a control freak - he won’t let her leave the house without him.",
                                    "Chồng cô là một người thích kiểm soát - anh ta sẽ không để cô ấy rời khỏi nhà mà không có anh ta."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "crank",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/kræŋk/  British someone who other people think is strange, especially because they have beliefs, aims, or habits that are thought to be very unusual or too extreme:người lập dị",
                        "examples": [
                            "▪ Vegetarians were once regarded as cranks.",
                            "Những người ăn chay đã từng bị coi là những người lập dị.",
                            "▪ Call me a crank, but I think the world was a lot better before mobile phones came along.",
                            "Coi tôi là kẻ lập dị cũng được nhưng tôi nghĩ thế giới đã tốt hơn rất nhiều trước khi điện thoại di động xuất hiện."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "strange people, behaviour, objects or ideas",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "strange",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/streɪndʒ/ lạ thường, lạ, lạ lùng",
                        "examples": [
                            "▪ Pearl was a strange girl who never played with the other children.",
                            "Pearl là một cô gái lạ thường không bao giờ chơi với những đứa trẻ khác.",
                            "▪ He’s very strange - you never really know what he’s thinking.",
                            "Anh ấy rất lạ - bạn không bao giờ thực sự biết anh ta đang nghĩ gì.",
                            "▪ Marla has some strange ideas about raising children.",
                            "Marla có một số ý tưởng lạ lùng về việc nuôi dạy con cái.",
                            "strangely[adverb]",
                            "Kỳ lạ",
                            "▪ Witnesses said the man was carrying a gun and behaving strangely.",
                            "Các nhân chứng cho biết người đàn ông mang khẩu súng và hành xử kỳ lạ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "eccentric",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪkˈsentrɪk/  an eccentric person has strange and slightly crazy habits or ideas, which people think are amusing:lập dị",
                        "examples": [
                            "▪ Our neighbour is an eccentric old lady who has about 25 cats.",
                            "Người hàng xóm của chúng tôi là một bà lão lập dị có khoảng 25 con mèo.",
                            "▪ Mr. Withers is a little eccentric, but he’s basically harmless.",
                            "Ông Withers có một chút lập dị, nhưng về cơ bản ông ta vô hại."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "weird",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/wɪəʳd/  strange and slightly frightening, and making you feel uncomfortable:kỳ quặc, kỳ lạ",
                        "examples": [
                            "▪ I don’t really want to spend the evening with Helen - she’s so weird.",
                            "Tôi không thực sự muốn dành buổi tối với Helen - cô ấy thật kì quặc.",
                            "▪ She’s dating a really weird guy who’s into witchcraft and black magic.",
                            "Cô ấy hẹn hò với một chàng trai kỳ lạ yêu thích các trò ma thuật và phù phép.",
                            "▪ The museum has a collection of the weirdest sculptures I’ve ever seen.",
                            "Bảo tàng có một bộ sưu tập các tác phẩm điêu khắc kỳ lạ nhất tôi từng thấy."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "bizarre",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/bɪˈzɑːʳ, bəˈzɑːʳ/  extremely strange, and very different from what is generally considered to be normal, especially in a frightening or slightly worrying way:kỳ quặc, kỳ quái",
                        "examples": [
                            "▪ They tell the most bizarre stories about him.",
                            "Họ kể những câu chuyện kỳ quặc nhất về anh ta.",
                            "▪ The marriage between the two stars was as bizarre as it was short-lived.",
                            "Cuộc hôn nhân giữa hai ngôi sao thật kỳ quặc khi nó chỉ tồn tại trong thời gian ngắn.",
                            "▪ Colin later took his own life in a bizarre suicide pact with his mother.",
                            "Colin sau đó đã ký một hiệp ước tự tử kỳ quái với mẹ mình.",
                            "bizarrely[adverb]",
                            "Kỳ quặc",
                            "▪ Roland was dressed rather bizarrely in the robes of a priest.",
                            "Roland trông khá kỳ quặc trong bộ y phục của một linh mục."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "outlandish",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/aʊtˈlændɪʃ/  something that is outlandish is very strange, and not at all like anything you are used to:lạ lùng",
                        "examples": [
                            "▪ Parts of Lisa’s story sounded outlandish, and no one would believe her.",
                            "Vài phần câu chuyện của Lisa có vẻ lạ lùng, và không ai tin cô ấy.",
                            "▪ She came to the party wearing an outlandish costume and blond wig.",
                            "Cô mặc bộ trang phục lạ lùng và đội tóc giả màu vàng đến bữa tiệc."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "funny/odd",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈfʌni, ɒdǁɑːd/  especially British slightly strange and difficult to understand:kỳ quái, kỳ quặc",
                        "examples": [
                            "▪ Did Anna warn you that her aunt is rather... well, rather odd?",
                            "Anna đã cảnh báo bạn rằng dì của cô ấy khá ... tốt, không kỳ quặc sao?",
                            "▪ He’s a bit funny - sometimes he’s very friendly, other times he just ignores you.",
                            "Anh ấy hơi kỳ quái - đôi khi anh ấy rất thân thiện, đôi khi anh ấy làm lơ bạn."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "peculiar",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/pɪˈkjuːliəʳ/  slightly strange, and different from what you would normally expect, especially in a way that is either amusing or a little worrying:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "kỳ dị, khác thường",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ She’s actually very friendly in her own peculiar way.",
                                    "Cô ấy thực sự thân thiện theo một cách khá kỳ dị.",
                                    "▪ Glenn started acting peculiar after his wife’s funeral.",
                                    "Glenn bắt đầu hành động khác thường sau đám tang của người vợ."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "kinky",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈkɪŋki/  someone who iskinky,or who doeskinkythings, has strange ways of getting sexual excitement:lập dị, kỳ quái",
                        "examples": [
                            "▪ kinky sex",
                            "1 kiểu làm tình kỳ quái",
                            "▪ I think he’s a bit kinky - but I like him.",
                            "Tôi nghĩ anh ta hơi lập dị- nhưng tôi thích anh ta."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "warped",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/wɔːʳpt/  informal someone who is warped has ideas or thoughts that most people think are unpleasant and strange:thiên lệnh, lệch lạc",
                        "examples": [
                            "▪ Some of my professors at college were pretty warped.",
                            "Một số giáo sư của tôi ở trường đại học đã bị thiên lệch.",
                            "▪ In his statement the chief of police said, ‘We are dealing with a warped mind, and we have to take all precautions.’",
                            "Trong tuyên bố của mình, cảnh sát trưởng nói, \"Chúng tôi đang đối phó với một người tâm trí lệch lạc, và chúng tôi phải thực hiện tất cả các biện pháp phòng ngừa.\"",
                            "▪ Only someone with a warped sense of humor would think the accident is funny.",
                            "Chỉ có ai đó bị chạm dây thần kinh mới nghĩ rằng tai nạn đáng buồn cười."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]