[
    {
        "id": "",
        "name": "embarrassed",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "words meaning embarrassed",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "embarrassed",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "feelinguncomfortableorshyand worrying about what peoplethinkof you, for example because you have made a stupid mistake or because you have to talk about your feelings, about sex etc:",
                        "examples": [
                            "Bối rối, lúng túng, xấu hổ",
                            "▪ Tony spilled red wine all over their carpet. He was so embarrassed!",
                            "Tony làm đổ đầy rượu vang đỏ trên chiếc thảm của họ. Anh ấy đã rất bối rối!",
                            "▪ The teachers are supposed to teach us about ‘safe sex’, but most of them are too embarrassed.",
                            "Các giáo viên có nhiệm vụ dạy cho cho chúng tôi về \"quan hệ tình dục an toàn\", nhưng hầu hết bọn họ đều quá lúng túng, ngượng ngùng.",
                            "get/feel embarrassed",
                            "Cảm thấy ngượng ngùng, bối rối",
                            "▪ Kids get embarrassed if their Mums kiss them in front of their friends.",
                            "Trẻ cảm cảm thấy ngượng ngùng nếu được mẹ hôn trước mặt bạn bè.",
                            "embarrassed about",
                            "Xấu hổ về chuyện gì",
                            "▪ I got very drunk at the party, and I feel really embarrassed about it.",
                            "Tôi đã rất say trong bữa tiệc, và tôi cảm thấy rất xấu hổ về việc đó",
                            "embarrassed by/at",
                            "Xấu hồ về...",
                            "▪ Marlon was always embarrassed by his lack of education.",
                            "Marlon đã luôn cảm thấy xấu hổ vì ít được học hành",
                            "acutely embarrassedvery embarrassed",
                            "Rất/ cực kỳ bối rối/ ngượng ngùng",
                            "▪ ‘I’m not sure if I actually want to marry her,’ Harry said, feeling acutely embarrassed.",
                            "\"Tôi không chắc là tôi có thưc sự muốn cưới cô ấy hay không\" Harry nói với vẻ cực kỳ bối rối"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "self-conscious",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "shy and embarrassed about yourbody, or about the way youlookortalk:",
                        "examples": [
                            "e dè, ngượng ngùng, tự ti",
                            "feel self-conscious",
                            "Cảm thấy tự ti/ ngượng ngùng",
                            "▪ I always feel really self-conscious in a bikini.self-conscious about",
                            "Tôi luôn vảm thấy tư ti khi mặc bikini",
                            "▪ Teenagers are often very self-conscious about their appearance.",
                            "Thanh thiếu niên thường cảm thấy ngượng ngùng về vẻ bề ngoài của họ",
                            "self-consciously[adverb]",
                            "Một cách e dè, ngượng ngập",
                            "▪ He got up rather self-consciously and walked towards the stage.",
                            "Anh ta đứng dậy một cách e dè và tiến về phía sân khẩu"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "uncomfortable",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "feeling embarrassed because you cannot relax with the people around you:",
                        "examples": [
                            "Không thoải mái/ khó chịu",
                            "▪ All this talk about love and romance was making me uncomfortable.",
                            "Tất cả những bài nói chuyện về tình yêu và sự lãng mạn này khiến tôi cảm thấy khó chịu.",
                            "feel uncomfortable",
                            "Cảm thấy không khoải mái",
                            "▪ Jim always felt uncomfortable on such formal occasions.",
                            "Jim luôn cảm thấy không thoải mái trong những buổi lễ trang trọng như vậy.",
                            "▪ an uncomfortable silence",
                            "Một sự im lặng đến khó chịu",
                            "uncomfortably[adverb]",
                            "Một cách khó chịu",
                            "▪ Rhys shuffled his feet uncomfortably, trying to think of an excuse to leave.",
                            "Rhys lắc lặc đôi chân của mình một cách không thoải mái, cố nghĩ ra 1 cái cớ để rời đi."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "awkward",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "feeling so shy, nervous, and embarrassed that you cannot behave in anaturalway:",
                        "examples": [
                            "ngượng nghịu, lúng túng",
                            "feel awkward",
                            "Cảm thấy ngượng nghịu/ lúng túng",
                            "▪ I didn’t know anyone at the party, and I felt really awkward at first.",
                            "Tôi không biết bất kỳ ai ở bữa tiệc, và điều đó khiến tôi thực sự cảm thấy lúng túng vào lúc đầu",
                            "an awkward moment/silence etcwhen you or other people feel awkward",
                            "Một khoảnh khắc lúng túng, Một sự im lặng ngượng ngùng",
                            "▪ For one awkward moment I thought I had said something terribly wrong.",
                            "Trong 1 khoảnh khắc khó xử, tôi nghĩ tôi đã nói điều gì đó sai kinh khủng",
                            "▪ Carrie laughed out loud, and there was an awkward silence.",
                            "Carrie cười lớn, và rồi đã có 1 sự im lặng khó xử",
                            "awkwardly[adverb]",
                            "Một cách ngựng ngùng, lúng túng",
                            "▪ David felt too shy to say anything, and looked at them awkwardly.",
                            "David cảm thấy quá lúng túng để nói bất cứ điều gì, và nhìn họ với vẻ lúng túng.",
                            "awkwardness[uncountable noun]",
                            "Sự ngượng ngùng, lúng túng",
                            "▪ There was an awkwardness in her manner which made it difficult to talk to her.",
                            "Có một sự ngượng ngùng trong tính cách cuả cô ta, và điều này khiến cho việc nói chuyện với cô ta trở nên khó khắn"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "sheepish",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective usually before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "looking or feeling a little embarrassed because you feel guilty about something:",
                        "examples": [
                            "Bẽn lẽn, e thẹn, ngượng ngùng",
                            "▪ He gave her a sheepish look and said, ‘I’m very sorry, I forgot it was your birthday.’look sheepish",
                            "Anh nhìn cô với vẻ ngượng ngùng và nói: \"Anh rất xin lỗi, anh quên mất đó là ngày sinh nhật của em\"",
                            "▪ Debbie arrived late for work looking a bit sheepish.",
                            "Debbie đã đi làm trễ, trông anh ta hơi ngượng.",
                            "sheepishly[adverb]",
                            "Một cách ngượng ngùng, bẽn lẽn",
                            "▪ ‘I only have one or two cigarettes now and then,’ he said sheepishly.",
                            "\"Thỉnh thoảng tôi hút 1 hoặc 2 điếu xì gà\" ông ta nói một cách ngượng ngùng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "mortified",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective not before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "very shocked, embarrassed, or ashamed because you realize that you have done something wrong, or because of something unpleasant that happens to you: mortified by",
                        "examples": [
                            "(Cực kỳ) xấu hổ",
                            "▪ Deaver was mortified by his mistake and immediately admitted that he was wrong.",
                            "Deaver cảm thấy rất xấu hổ về sai lầm của mình và đã ngay lập tức thừa nhận rằng mình đã sai.",
                            "mortified at the thought of something",
                            "Xấu hổ khi nghĩ đến 1 cái gì đó",
                            "▪ Carla felt mortified at the thought of having to repeat another year at school.",
                            "Carla đã cảm thấy rất xấu hổ khi nghĩ đến việc phải ngồi lại lớp.",
                            "mortified to find/see etc something",
                            "Xấu hổ khi nhận ra/ nhìn thấy điều gì",
                            "▪ I was mortified to find that everyone else was wearing evening dress.",
                            "Tôi đã xấu hổ khi nhận ra rằng tất cả những người khác đều mặc trang phục dạ hội"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "squirm",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to feel extremely embarrassed and uncomfortable because of something stupid that you did or said, or because of something that someone else does:",
                        "examples": [
                            "(Rất) cảm thấy bối rối/ khó chịu/ xấu hổ",
                            "▪ Whenever I think back to what I said at the party it makes me want to squirm.squirm with embarrassment",
                            "Bất cứ khi nào nghĩ lại những điều mình đã nói tại bữa tiệc, nó lại khiến tôi cảm thấy cực kỳ xấu hổ",
                            "▪ The little boy squirmed with embarrassment when his mother told him off in front of his friends.",
                            "Cậu bé cảm thấy cực kỳ xấu hổ khi bị mẹ mắng trước mặt bạn bè"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "I could have died",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "",
                        "region": "",
                        "definition": "/I almost died spoken say this when you are telling someone about a time when you felt extremely embarrassed:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Tôi xấu hổ muốn chết đi đựơc",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ When I realized that Sally had heard every word I said about her, I could have died.",
                                    "Khi tôi nhận ra rằng Sally đa nghe hết tất cả những điều tôi nói về cô ta, tôi đã xấu hổ muốn chết đi được."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "egg on your face",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "",
                        "region": "",
                        "definition": "if someone, especially someone in authority has egg on their face, they have done something wrong or embarrassing in a way that makes them look stupid:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Có trứng trên mặt/ Làm điều gì đó xong mà bạn cảm thấy rất đáng xấu hổ",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Don’t underestimate this club or you’ll be left with egg on your face. I’ve got one of the best squads ever in the Premier League.",
                                    "Đừng đánh giá thấp câu lạc bộ này hoặc bạn sẽtự chuốc lấy xấu hổ. Tôi đã có 1 trong những đội xuất sắc nhất từ trước đến nay tại Premier League.",
                                    "▪ The government ended up with egg on its face when it was found to have withheld documents for political purposes."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Chính phủ đã kết thúc bằng những bê bối đáng xấu hổ khi các giấy tờ cho mục đích chính trị được tìm ra",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "to make sb feel embarrassed",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "embarrass",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to make someone feel embarrassed:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "làm ai xấu hổ/ lúng túng",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ I hope I didn’t embarrass you in front of your friends.",
                                    "Hi vọng tôi đã không làm bạn xấu hổ trức mặt bạn bè.",
                                    "▪ One woman was trying to embarrass me by asking me questions I couldn’t answer.",
                                    "Một phụ nữ đã cố làm tôi xấu hổ bằng cách hỏi tôi những câu hỏi tôi không thể trả lời được."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "embarrassing",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "somethingthat is embarrassing makes you feel embarrassed:",
                        "examples": [
                            "làm lúng túng/ xấu hổ/ khó xử",
                            "▪ It was so embarrassing - I couldn’t remember his name!",
                            "Thật xấu hổ- Tôi đã không nhớ ra tên anh ta.",
                            "▪ The doctor asked me a lot of embarrassing questions about my sex life.",
                            "Bác sĩ đã hỏi nhiều câu hỏi nhạy cảm về đời sống tình dục của tôi.",
                            "embarrassing to/for",
                            "Xấu hổ đối với ai",
                            "▪ The revelations about the President’s university life were to prove deeply embarrassing to him.",
                            "Những tiết lộ về cuộc sống thời đại học của tổng thống được chứng minh là thực sự đáng xấu hổ đối với ông ấy."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "cause embarrassment",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "if a situation or an action causes embarrassment to someone, it makes them feel embarrassed in front of a lot of people:",
                        "examples": [
                            "Gây ra sự xấu hổ",
                            "▪ If you want I’ll leave - I don’t want to cause any embarrassment.",
                            "Nếu bạn muốn tôi sẽ rời đi. tôi không muốn gây ra sự bối rối nào cho bạn.",
                            "cause somebody embarrassment",
                            "Khiến ai xấu hổ",
                            "▪ His wife’s frequent affairs with other men had caused him acute public embarrassment.",
                            "Những vu ngoại tình thường xuyên của vợ mình với những người đàn ông khác khiến ông ta rất xấu hổ trước mọi người.",
                            "cause embarrassment to somebody",
                            "Gây ra sự xấu hổ cho ai",
                            "▪ The article was intended to cause the greatest possible embarrassment to the government.",
                            "Bài báo này nhằm khiến cho chính phủ bị xấu mặt nhất có thể."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be an embarrassment",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "if someone or something is an embarrassment to someone, they make them feel embarrassed or ashamed to be connected with them:",
                        "examples": [
                            "Là một sự đáng xấu hổ",
                            "▪ Look at the way he’s dressed. It’s an embarrassment.",
                            "Nhìn cách anh ta ăn mặc kìa! Thật đáng xấu hổ.",
                            "be an embarrassment to",
                            "Là 1 sự đáng xấu hổ đối với",
                            "▪ His heavy drinking was an embarrassment to his friends and family.",
                            "Sự nghiện rượu của ông ta là 1 sự đáng xấu hổ đối với gia đình và bạn bè."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "excruciating",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "use this about something that makes you feel extremely embarrassed:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Cực kỳ xấu hổ/ bối rối",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The ambassador opened the gift in front of all his guests - and the box was empty! It was the most excruciating moment of my life.",
                                    "Vị đại sứ mở món quà ngay trước mặt tất cả khách mời của ông ta, và chiếc hộp trống không. Đó là khoảnh khắc xấu hổ nhất trong cuộc đời tôi.",
                                    "▪ There followed an excruciating silence that lasted for at least a minute."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Có 1 sự im lặng trong ngượng ngùng kéo dài ít nhất 1 phút",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "when your face goes red because you are embarrassed",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "blush/turn redalsogo redespecially British",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[transitive verb/verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "ifyoublush or turn red, your face becomes red because you are embarrassed:",
                        "examples": [
                            "đỏ mặt",
                            "▪ As soon as Mark came into the room, she blushed and looked away.",
                            "Ngay sau khi Mark bước vào phòng, cô ấy đỏ mặt rồi quay đi chỗ khác.",
                            "▪ David’s really shy - he always turns red when the teacher asks him a question.",
                            "David rất nhút nhát. Anh ta luôn luôn đỏ mặt mỗi khi được giáo viên hỏi.",
                            "go/turn as red as a beetrootBritish become very red:",
                            "Đỏ như củ cải đường/ đỏ như gấc",
                            "▪ I can’t wait to see his face when you tell him - he’ll go as red as a beetroot.",
                            "Tôi không thể đợi đến lúc thấy mặt anh ta khi nói chuyện với bạn. Mặt anh ta sẽ đỏ như gấc cho xem.",
                            "blushverb[ I ]đỏ mặtxấu hổ, ngượng ngùng",
                            "to become pink in the face, usually from embarrassment",
                            "_I always blush when I speak in public.",
                            "_I blushto thinkof what a fool I made of myself."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "go redblush/turn redalsoespecially British",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb/verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "ifyoublush or turn red, your face becomes red because you are embarrassed:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "đỏ mặt",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ As soon as Mark came into the room, she blushed and looked away.",
                                    "Ngay sau khi Mark bước vào phòng, cô ấy đỏ mặt rồi quay đi chỗ khác.",
                                    "▪ David’s really shy - he always turns red when the teacher asks him a question.",
                                    "David rất nhút nhát. Anh ta luôn luôn đỏ mặt mỗi khi được giáo viên hỏi.",
                                    "go/turn as red as a beetrootBritish become very red:"
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "đỏ như củ cải đường/ đỏ như gấc",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ I can’t wait to see his face when you tell him - he’ll go as red as a beetroot.",
                                    "Tôi không thể đợi đến lúc thấy mặt anh ta khi nói chuyện với bạn. Mặt anh ta sẽ đỏ như gấc cho xem."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "turn redblush/alsogo redespecially British",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb/verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "ifyoublush or turn red, your face becomes red because you are embarrassed:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "đỏ mặt",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ As soon as Mark came into the room, she blushed and looked away.",
                                    "Ngay sau khi Mark bước vào phòng, cô ấy đỏ mặt rồi quay đi chỗ khác.",
                                    "▪ David’s really shy - he always turns red when the teacher asks him a question.",
                                    "David rất nhút nhát. Anh ta luôn luôn đỏ mặt mỗi khi được giáo viên hỏi.",
                                    "go/turn as red as a beetrootBritish become very red:"
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "đỏ như củ cải đường",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ I can’t wait to see his face when you tell him - he’ll go as red as a beetroot.",
                                    "Tôi không thể đợi đến lúc thấy mặt anh ta khi nói chuyện với bạn. Mặt anh ta sẽ đỏ như gấc cho xem."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "the feeling you have when you are embarrassed",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "embarrassment",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "the feeling you have when you are embarrassed:",
                        "examples": [
                            "Sự xấu hổ/ ngượng ngùng/ bối rối",
                            "▪ He looked down at the floor in an attempt to hide his embarrassment",
                            "Anh ta nhìn xuống sàn nhà trong 1 nỗ lực để che giấu sự bối rối của mình",
                            "I almost/nearly died of embarrassmentspoken a humorous way of saying you felt very embarrassed about something",
                            "Tôi xấu hổ muốn chết đi được",
                            "▪ She read my poem out to the whole class - I almost died of embarrassment.",
                            "Cô ta đọc to bài thơ của tôi cho cả lớp nghe. Tôi xấu hổ muốn chết đi được"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]