[
    {
        "id": "",
        "name": "FED UP",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "feeling tired, bored, or annoyed",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "be fed up",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/biː ˌfed ˈʌp/  to feel tired, bored, and annoyed, especially because something annoying keeps happening or something has continued for too long:chán",
                        "examples": [
                            "be fed up with chán ngấy với",
                            "▪He tells me he’s fed up with school. Maybe that’s why his grades have been so bad.",
                            "Anh ta nói với tôi rằng anh ấy chán ngấy với việc học. Có lẽ đó là lý do tại sao điểm số của anh ta quá tệ.",
                            "be fed up with doing something chán ngấy với việc làm gì đó",
                            "▪I’m fed up with watching what I eat.",
                            "Tôi chán ngấy với việc xem những gì tôi ăn.",
                            "get fed up chán nản",
                            "▪He waited for two hours, then he got fed up and left.",
                            "Anh ta đợi hai tiếng, sau đó anh ta chán nản và bỏ đi.",
                            "▪ I’m getting fed up with this cold weather.",
                            "Tôi dần trở nên chán nản với thời tiết lạnh giá này."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "be tired of",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/biː ˈtaɪəʳd ɒv/  to be fed up because you have been doing something or have experienced something boring, annoying etc for too long:mệt mỏi với",
                        "examples": [
                            "▪He just seems to be tired of the whole thing.",
                            "Anh ta dường như mệt mỏi với toàn bộ chuyện này",
                            "be tired of doing something mệt mỏi làm việc gì đó",
                            "▪Gabrielle was tired of staying at home with the children.",
                            "Gabrielle đã mệt mỏi khi ở nhà cùng con.",
                            "get tired of something trở nên mệt mỏi vì",
                            "▪Well, if you get tired of life in the city, you can always come back home.",
                            "Vâng, nếu bạn mệt mỏi vì cuộc sống trong thành phố, bạn luôn có thể trở về nhà.",
                            "▪ I’m getting tired of chicken for dinner every night.",
                            "Tôi dần trở nên mệt mỏi vì ăn gà cho bữa ăn tối mỗi đêm."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "be sick of",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/biː ˈsɪk əv something/  to be very fed up and annoyed, especially with a situation or someone’s behaviour that has continued for much too long:phát ốm vì",
                        "examples": [
                            "▪After living here for ten years, we’re sick of Los Angeles.",
                            "Sau khi sống ở đây trong 10 năm, chúng tôi phát ốm với Los Angeles.",
                            "be sick of doing something phát ốm vì làm gì",
                            "▪I’m sick of living with my parents.",
                            "Tôi phát ôm khi sống với bố mẹ tôi.",
                            "be sick and tired of something/be sick to death of something phát ốm và mệt mỏi với việc gì/ phát ốm chết mất với việc gì",
                            "use this when something is extremely annoying or boring",
                            "▪You must be sick and tired of having to deal with other people’s problems all day.",
                            "Bạn hẳn phải phát ốm và phải mệt mỏi vì phải giải quyết mọi vấn đề của người khác.",
                            "▪ I’m sick to death of all these stupid questions about my private life.",
                            "Tôi phát ốm chết mất vì đám câu hỏi ngớ ngẩn này về cuộc sống riêng tư của tôi."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "have had enough",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/həv ˌhæd ɪˈnʌf/  if you have had enough of someone’s behaviour, the way someone is treating you etc, you are very fed up with it and will not accept it any longer:cảm thấy chịu đủ rồi",
                        "examples": [
                            "▪The work was boring and the office was depressing. By the end of the first week she had had enough.",
                            "Công việc thật tẻ nhạt và văn phòng thì đáng thất vọng. Đến cuối tuần đầu tiên cô đã cảm thấy chịu đủ rồi",
                            "have had enough of chịu đủ rồi về",
                            "▪Stop interrupting. I’ve had just about enough of you and your stupid remarks.",
                            "Đừng làm phiền Tôi đã chịu đủ về bạn và những nhận xét ngu ngốc của bạn rồi",
                            "▪ After thirty years, MacMillan had had enough of management.",
                            "Sau ba mươi năm, MacMillan đã chịu đủ với việc quản lý rồi."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "have had it",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/həv ˈhæd ɪt/  spoken say this when you are so fed up with someone’s behaviour or a situation that you cannot accept it any longer:chịu hết nổi",
                        "examples": [
                            "▪I’ve had it. I’m taking the kids and going to Mom’s.",
                            "Tôi chịu hết nổi rồi. Tôi sẽ dẫn theo bọn trẻ và đến nhà của mẹ.",
                            "have had it with chịu đựng đủ với",
                            "▪She’s looking for another job -- she’s just about had it with this place.",
                            "Cô ấy đang tìm kiếm một công việc khác - cô ấy gần như chịu hết nổi nơi này rồi",
                            "have had it up to here chịu hết nổi",
                            "▪I tell you, I’ve just about had it up to here -- what with all the staffing problems and now the computer breaking down. I feel like quitting.",
                            "Tôi nói với bạn, tôi sẽ chịu hết nổi rồi - chuyện gì xảy ra với tất cả các vấn đề biên chế và bây giờ máy tính phá vỡ. Tôi cảm thấy như muốn bỏ cuộc.",
                            "have had it up to here with somebody/something chịu hết nổi với ai, caí gì",
                            "▪Dave’s had it up to here with the kids. They’ve been complaining and arguing all day.",
                            "Dave đã chịu hết nổi ới những đứa trẻ. Chúng đã phàn nàn và cãi nhau suốt cả ngày."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "be pissed off",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/biː ˌpɪst ˈɒf/  informal to be very fed up - use this only in informal situations and to people you know well:tức giận, bực mình",
                        "examples": [
                            "▪I think you’d better try and cheer her up. She’s really pissed off.",
                            "Tôi nghĩ rằng bạn nên cố gắng và cổ vũ cô ấy lên. Cô ấy thực sự tức giận.",
                            "be pissed off with tức giận với",
                            "▪She’s pissed off with him for calling her all the time.",
                            "Cô ấy tức giận với anh ta vì đã gọi điện cho cô ấy mọi lúc."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "be at the end of your tether",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "British /be at the end of your rope American /biː ət ði ˌend əv jɔːʳ ˈteðəʳ, biː ət ðiː ˌend əv jɔːʳ ˈrəʊp/  to be so worried, tired, and unhappy that you feel you can no longer deal with a difficult, unpleasant, or upsetting situation:cùng đường",
                        "examples": [
                            "▪I had no money, my husband was sick, and I couldn’t get a job. I was at the end of my tether.",
                            "Tôi không có tiền, chồng tôi bị ốm, và tôi không có việc làm. Tôi đã cùng đường rồi",
                            "▪ She didn’t know what to do to stop the baby crying -- she was at the end of her rope.",
                            "Cô không biết phải làm gì để làm em bé ngừng khóc - cô đã cùng đường"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "jaded",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈdʒeɪdɪd, ˈdʒeɪdəd/  fed up with an activity or job because you have been doing it for a very long time and you no longer find it interesting or exciting:kiệt sức",
                        "examples": [
                            "▪After two years of the same routine I was feeling jaded.",
                            "Sau hai năm với cùng một thói quen sinh hoạt, tôi cảm thấy kiệt sức",
                            "▪ The beauty of St. Petersburg will impress even the most jaded tourist.",
                            "Vẻ đẹp của St. Petersburg sẽ gây ấn tượng ngay cả những khách du lịch kiệt sức nhất.",
                            "▪ Mick Jagger arrived at the airport looking jaded after almost a year of touring.",
                            "Mick Jagger đến sân bay trông kiệt sức sau gần một năm lưu diễn."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]