[
    {
        "id": "",
        "name": "doing things without fear or proper thought",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "not thinking carefully enough before doing sth",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "rash",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ræʃ/  if you do something rash, you do not think carefully about the effect it will have, and you wish later you had not done it:",
                        "examples": [
                            "hấp tấp vội vàng",
                            "▪ Stay where you are and don’t do anything rash -- I’ll be over in five minutes.Ở lại đó và đừng làm gì hấp tấp - Anh sẽ kết thúc nó trong 5 phút.",
                            "▪ Don’t make any rash promises that you may regret later.Đừng hứa vội vàng nếu không bạn sẽ hối tiếc",
                            "rashly[adverb]một cách hấp tấp, vội vàng",
                            "▪ I rashly offered to lend her the money.Tội vội vàng đề nghị cho cô ta mượn tiền",
                            "rashadjective",
                            "careless or unwise, without thought for what might happen or result",
                            "_That was a rashdecision- you didn't think about the costs involved.",
                            "_[ + to infinitive ]I thinkitwas a bit rashofthemtoget married when they'd only known each other for a few weeks.",
                            "rashlyadverb",
                            "",
                            "rashnessnoun[ U ]",
                            "_In a moment ofrashness, I agreed to do a parachute jump for charity."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "impulsive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪmˈpʌlsɪv/  doing things as soon as you think of them, without considering the possible dangers or problems:bốc đồng",
                        "examples": [
                            "▪ She’s so impulsive -- she saw the house for the first time and said she’d buy it straight away.Cô ấy rất bốc đồng - cô ấy mua ngay ngôi nhà khi chỉ mới thấy nó lần đầu tiên",
                            "▪ Although she comes across as impulsive, Harper is actually very cautious and indecisive.Mặc dù cô ấy trông như rất bốc đồng, Harper thật sự là một người rất thận trọng và thiếu quyết đoán",
                            "impulsively[adverb]một cách bốc đồng",
                            "▪ He kissed her impulsively.Anh ta hôn cô ấy một cách bốc đồng",
                            "impulsiveness [uncountable noun] sự bốc đồng",
                            "▪ His impulsiveness surprised her. He was normally so careful.Sự bốc đồng của anh ta làm cô ấy ngạc nhiên, bình thường anh rất thẩn trọng",
                            "impulsiveadjective",
                            "showing behaviour in which you do things suddenly without any planning and without considering the effects they may have",
                            "_Don't be so impulsive - think before you act.",
                            "_an impulsive man/decision/gesture"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "hasty",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈheɪsti/  too quick to do or say something, without taking time to think about it first:hấp tấp vội vàng",
                        "examples": [
                            "▪ I think I may have been a little hasty about firing him.Tôi có thể đã hơi vội vã đuổi việc anh ta",
                            "▪ Go home and think about whether you really want to have the operation -- I don’t want you to make any hasty decisions.Hãy về nhà đi và suy nghĩ xem bạn có thật sự muốn phẫu thuật hay không - tôi không muốn bạn đưa ra bất kì quyết định hấp tấp nào.",
                            "hastyadjectivehấp tấp; khinh suất; thiếu suy nghĩ",
                            "describes something that is done in a hurry,sometimes without the necessary care or thought",
                            "_He warned against making hasty decisions.",
                            "_Now let's not leap to any hasty conclusions.",
                            "_We saw the rain and made a hasty retreat into the bar.",
                            "_I think perhaps we were a little hastyinjudginghim.",
                            "",
                            "hastilyadverb",
                            "_\"He's looks good for his age. Not that 55 is old, \" she hastily added.",
                            "",
                            "hastinessnoun[ U ]"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "impetuous",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪmˈpetʃuəs/  doing something without thinking carefully first, especially because you have an emotional character and easily get angry, excited etc:",
                        "examples": [
                            "bốc đồng, bất cẩn",
                            "▪ If you weren’t so impetuous you wouldn’t have lost your job.Nếu anh đã không quá bất cẩn như vậy thì anh đã không bị mất việc",
                            "▪ He says she’s impetuous and emotional.Anh ấy nói rằng cô ta rất bốc đồng và đa cảm",
                            "impetuousadjective",
                            "likely to act on a sudden idea or wish, without considering the results of your actions",
                            "_He's so impetuous - why can't he think things over before he rushes into them?",
                            "",
                            "impetuousadjective",
                            "An impetuous word or action is said or done suddenly, without considering the likely results",
                            "_The Prime Minister may now be regretting her impetuous promise to reduce unemployment by half.",
                            "",
                            "impetuouslyadverb",
                            "",
                            "impetuousnessnoun[ U ] (formal alsoimpetuosity)"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]