[
    {
        "id": "",
        "name": "continue after stopping",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "to continue doing sth after stopping",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "continue",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive/transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if you continue doing something, or it continues, it starts again after stopping: tiếp tục",
                        "examples": [
                            "▪After a while the rain stopped, allowing the game to continue.",
                            "Sau một lúc mưa dừng lại, cho phép trận đấu được tiếp tục.",
                            "▪ He has decided to go back to Cambridge to continue his medical studies.",
                            "Anh đã quyết định trở lại Cambridge để tiếp tục các nghiên cứu y khoa của anh ấy.",
                            "▪ The tour continued after a rest day in Bordeaux.",
                            "Chuyến đi tiếp tục sau một ngày nghỉ tại Bordeaux."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "continue doing something tiếp tục làm gì đó",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪Have a rest before you continue driving.",
                                    "Hãy nghỉ một chút trước khi tiếp tục lái xe.",
                                    "▪ He’s not sure whether he’ll be able to continue skiing competitively after the operation.",
                                    "Anh ta không chắc liệu anh ta có thể tiếp tục trượt tuyết một cách cạnh tranh sau khi phẫu thuật không."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "go on/ carry on",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "go onalsocarry onBritish   to continue doing something after stopping for ashorttime: tiếp tục (sau thời gian ngắn dừng lại)",
                        "examples": [
                            "▪Occasionally he would stop writing, read through what he had written, and then go on.",
                            "Đôi khi anh ta sẽ ngừng viết, đọc qua những gì anh ta đã viết, và rồi tiếp tục.",
                            "▪ It’s one o'clock now. Shall we carry on after lunch?",
                            "Bây giờ là một giờ. Chúng ta sẽ tiếp tục sau bữa trưa được không?"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "go on/carry on doing something tiếp tục làm việc gì đó",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ After a short break for coffee, they went on working until 3 o'clock.",
                                    "Sau một khoảng nghỉ giải lao ngắn để uống cà phê, họ tiếp tục làm việc đến 3 giờ.",
                                    "▪ She decided to carry on working after having the baby.",
                                    "Cô quyết định tiếp tục làm việc sau khi sinh con.."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "go on with tiếp tục với",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪Let’s stop now. We’ll go on with this tomorrow.",
                                    "Hãy dừng lúc này. Chúng ta sẽ tiếp tục với nó vào ngày mai này."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "go back/ return to st",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb not in passive]",
                        "usage": "",
                        "region": "",
                        "definition": "go back to/return to  to start doing a particularjobagain after a period when you were doing something else.Return to ismoreformalthan go back to: trở lại với",
                        "examples": [
                            "▪Melanie made herself a cup of tea and then went back to her reading.",
                            "Melanie tự làm một tách trà và sau đó trở lại với việc đọc sách.",
                            "▪ Some mothers return to full-time work only a few weeks after their baby is born.",
                            "Một số bà mẹ trở lại làm việc toàn thời gian chỉ vài tuần sau khi sinh em bé."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "go back to/return to doing something trở lại để làm gì đó",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪If he can’t get work as an actor, he can always go back to being an electrician.",
                                    "Nếu anh không thể làm việc như một diễn viên, anh luôn có thể trở lại làm thợ điện."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "start again",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to start again, continuing the same thing that you were doing before you stopped, or continuing to happen in the same way as before: bắt đầu lại",
                        "examples": [
                            "▪ He stopped exercising after the injury, but recently he’s started again.",
                            "Anh ngừng luyện tập sau khi chấn thương, nhưng gần đây anh lại bắt đầu lại.",
                            "start something again Bắt đầu lại một lần nữa",
                            "▪I’ve had a good vacation and I’m not exactly looking forward to starting work again.",
                            "Tôi đã có một kỳ nghỉ vui vẻ và tôi không thực sự mong muốn bắt đầu làm việc một lần nữa.",
                            "start doing something again Bắt đầu làm cái gì đó một lần nữa",
                            "▪After a two-week rest I was ready to start running again.",
                            "Sau hai tuần nghỉ ngơi tôi đã sẵn sàng để bắt đầu chạy lại.",
                            "▪ Billy was afraid to say anything in case she started crying again.",
                            "Billy sợ nói bất cứ điều gì lỡ đâu cô ấy lại khóc lần nữa",
                            "start to do something again Bắt đầu làm lại cái gì một lần nữa",
                            "▪ Marian stared through the window. It was starting to snow again.",
                            "Marian nhìn chằm chằm qua cửa sổ. Tuyết bắt đầu rơi một lần nữa."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "resume",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive/transitive verb]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "if you resume something or it resumes, it continues after a pause or interruption: tiếp tục",
                        "examples": [
                            "▪Collins was so seriously injured that he was unable to resume his career.",
                            "Collins đã bị thương nghiêm trọng đến mức ông không thể tiếp tục sự nghiệp của mình.",
                            "▪ The jurors are anxious to resume their normal lives again.",
                            "Các bồi thẩm đoàn đang rất lo lắng để tiếp tục cuộc sống bình thường của họ một lần nữa.",
                            "resume doing something",
                            "tiếp tục làm gì đó",
                            "▪He said no more, and resumed reading his newspaper.",
                            "Anh không nói nữa, và tiếp tục việc đọc báo của mình"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "take st up again",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "pick up",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/take up where you left off   to start something again at exactly the same point where you stopped: tiếp tục",
                        "examples": [
                            "▪ After a long absence I went back to college, hoping to pick up where I’d left off.",
                            "Sau một thời gian dài vắng mặt, tôi trở lại trường đại học, hy vọng tiếp tục ngay chỗ mà tôi đã dừng lại.",
                            "▪ The team has picked up where they left off last spring.",
                            "Nhóm nghiên cứu đã tiếp tục chỗ mà họ đã dừng lại vào mùa xuân năm ngoái.",
                            "▪ Negotiators will meet again after the holidays and take up where they left off.",
                            "Các nhà đàm phán sẽ gặp lại sau những ngày lễ và tiếp tục chỗ mà họ đã dừng lại."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "reopen",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive/transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if someone reopens a formal discussion, trial etc, or it reopens, it starts again after stopping, especially because new information has been found: mở lại",
                        "examples": [
                            "▪ The two sides are prepared to reopen peace talks.",
                            "Hai bên đang chuẩn bị mở lại các cuộc đàm phán hòa bình.",
                            "▪ The action is likely to reopen debates about affirmative action.",
                            "Hành động có thể sẽ mở lại cuộc tranh luận về hành động khẳng định.",
                            "▪ Police have decided to reopen the investigation in the light of important new evidence.",
                            "Cảnh sát đã quyết định mở lại cuộc điều tra bằng những bằng chứng mới quan trọng."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "renew",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to start to do something again - use this especially about activities done by governments and military organizations: nối lại, thực hiện lại",
                        "examples": [
                            "▪The rebels waited until nightfall to renew their attack on the city.",
                            "Các phiến quân chờ đợi cho tới khi màn đêm buông xuống để nối lại cuộc tấn công vào thành phố.",
                            "▪ Iceland has no immediate plans to renew commercial whaling.",
                            "Iceland không có kế hoạch ngay lập tức để tái săn cá voi thương mại."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "to continue talking about sth after stopping",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "continue",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive/transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to continue talking about something after stopping or after talking about something else: tiếp tục",
                        "examples": [
                            "▪Continuing in a quieter voice, she asked how long he’d been married.",
                            "Tiếp tục bằng một giọng êm dịu hơn, cô ấy hỏi anh ấy đã cưới được bao lâu.",
                            "▪ Nate didn’t answer, so Murphy continued, ‘All of this happened before I was hired.’",
                            "Nate đã không trả lời, vì vậy Murphy tiếp tục, \"Tất cả những điều này xảy ra trước khi tôi được thuê.\"",
                            "▪ Before they could continue their conversation, Frank Gordon came over to speak to Oliver.",
                            "Trước khi họ có thể tiếp tục cuộc trò chuyện, Frank Gordon đến nói chuyện với Oliver."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "go on",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to continue talking after stopping, especially when you need to say more about something: tiếp tục",
                        "examples": [
                            "▪He went on in a soft voice, ‘I love you, Jane.’",
                            "Anh ấy tiếp tục bằng một giọng nhẹ nhàng: ‘Anh yêu em, Jane.’",
                            "▪ She started crying and couldn’t go on.",
                            "Cô ấy bắt đầu khóc và không thể tiếp tục.",
                            "go on with tiếp tục với",
                            "▪Once everyone was quiet, Michael went on with his story.",
                            "Một khi mọi người yên lặng, Michael tiếp tục với câu chuyện của mình",
                            "go on to say something tiếp tục nói điều gì đó",
                            "▪ He went on to say that there would be times when she would be expected to attend evening or weekend meetings.",
                            "Anh ấy tiếp tục nói rằng sẽ có những lúc bà ấy dự kiến tham gia các cuộc họp diễn ra vào buổi tối hoặc cuối tuần."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "go/get back to",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "also return to  to start talking about a subject that you have already talked about earlier: trở lại với",
                        "examples": [
                            "▪ Finally, I’d like to go back to the point I made at the beginning of the lecture.",
                            "Cuối cùng, tôi muốn trở lại với điểm mà tôi đã nói lúc bắt đầu bài giảng.",
                            "▪ Getting back to what we were talking about earlier, do you think it’s a realistic goal?",
                            "Trở lại với những gì chúng ta đang nói trước đó, bạn có nghĩ rằng đó là một mục tiêu thực tế không?"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "return to",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb not in passive]",
                        "usage": "",
                        "region": "",
                        "definition": "to start talking about a subject again having already talked about it earlier: quay trở lại",
                        "examples": [
                            "▪During the interview, they kept returning to the question of why he had left his previous job.",
                            "Trong cuộc phỏng vấn, họ tiếp tục quay trở lại câu hỏi tại sao ông lại bỏ việc trước đây."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "return to what somebody said/talked about etc quay trở lại với những gì mà ai đó đã nói đến",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Returning to what you said earlier, do you really think there is a chance of a complete ceasefire?",
                                    "Trở lại những gì bạn đã nói trước đó, bạn có thực sự nghĩ rằng có cơ hội ngừng bắn hoàn toàn?"
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "to start doing sth again",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "start again",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to start doing something again, especially something bad that you had decided not to do: bắt đầu lại một lần nữa",
                        "examples": [
                            "▪She’s quit smoking four or five times, but she always starts again.",
                            "Cô ấy đã bỏ thuốc lá bốn năm lần, nhưng cô ấy luôn bắt đầu lại.hút lại một lần nữa",
                            "start doing something again",
                            "Bắt đầu làm một cái gì đó một lần nữa",
                            "▪He started drinking again when he lost his job.",
                            "Anh ta bắt đầu uống rượu lần nữa khi anh ta bị mất việc.",
                            "start to do something again",
                            "Bắt đầu làm lại một lần nữa",
                            "▪She attended school regularly for a while, then started to miss classes again.",
                            "Cô đã đi học thường xuyên trong một thời gian, sau đó bắt đầu bỏ lỡ một lần nữa.",
                            "start that again lại như thế",
                            "▪‘I didn’t do it!’ ‘Oh, don’t start that again. I saw you.’",
                            "'Tôi đã không làm điều đó!' 'Oh, đừng lại như thế chứ. Tôi đã nhìn thấy bạn. '"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "go back to/revert to",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to start behaving in a particular way again, after you had decided not to or when you are not supposed to; revert is more formal than go back to: trở về, trở lại với",
                        "examples": [
                            "▪I went to a school where we had to speak French all the time, but outside school hours I reverted to English.",
                            "Tôi đã đến trường nơi chúng tôi phải nói tiếng Pháp mọi lúc, nhưng ngoài giờ học, tôi trở về với tiếng Anh.",
                            "▪ He’s been in the hospital a couple of times, but he keeps going back to drinking.",
                            "Anh ấy đã ở bệnh viện một vài lần, nhưng anh ấy vẫn trở lại uống rượu.",
                            "starts drinking alcohol again bắt đầu uống rượu trở lại",
                            "go back to/revert to doing something làm việc gì đó trở lại",
                            "▪ Do you think she’ll go back to using drugs?",
                            "Bạn có nghĩ rằng cô ấy sẽ dụng ma túy trở lại không?",
                            "▪ We go home for Christmas and revert to being children again.",
                            "Chúng tôi về nhà vào dịp Giáng Sinh và trở lại làm những đứa con một lần nữa."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "slip back into",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase not in passive]",
                        "usage": "",
                        "region": "",
                        "definition": "to gradually start doing something bad again after you had stopped, because you are not determined enough to prevent yourself from doing it: trở lại thành",
                        "examples": [
                            "▪ Children will often slip back into babyish ways to get what they want.",
                            "Trẻ em thường sẽ trở lại thành theo tính trẻ con để có được thứ mình muốn.",
                            "slip back into doing something trở lại thành việc làm gì đó",
                            "▪ to slip back into having a few drinks after work",
                            "trở lại thành việc uống vài ly sau buổi làm việc"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "uncategorized",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "restart",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[I or T]",
                        "usage": "",
                        "region": "",
                        "definition": "verb",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "to start something again",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_Our car stalled and wouldn't restart.",
                                    "_Please restart your computer to complete installation."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "pick up the pieces",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "usage": "",
                        "region": "",
                        "definition": "to try to return to a satisfactory situation",
                        "examples": [
                            "_The fire was a blow, but we were determined to pick up the pieces and get the business back on its feet."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]