[
    {
        "id": "",
        "name": "each other",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "ways of saying that two or more people do st to each other",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "each other",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[pronoun]",
                        "usage": "",
                        "region": "",
                        "definition": "/one another/iːtʃ ˈʌðəʳ, wʌn əˈnʌðəʳ/  use this to say that each of two or more people do the same thing to the other person or people, or have the same feelings towards them:người còn lại",
                        "examples": [
                            "▪The twins looked at one another and giggled.",
                            "Cặp sinh đôi nhìn nhau và cười khúc khích.",
                            "▪ You can tell that George and Hannah like each other, can’t you?",
                            "Bạn có thể thấy rằng George và Hannah thích người còn lại, đúng không?",
                            "▪ By the end of the holiday we were all beginning to annoy each other.",
                            "Đến cuối kỳ nghỉ, tất cả chúng tôi bắt đầu làm phiền người còn lại."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "each ... the other mỗi người ... người kia",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "A2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ When Kerry and Sam met again two years later, each was equally pleased to see the other.",
                                    "Khi Kerry và Sam gặp nhau hai năm sau, mỗi người đều hài lòng khi nhìn thấy người kia.",
                                    "▪ The brothers started to quarrel, each accusing the other of being responsible for the mistake.",
                                    "Các anh em bắt đầu cãi nhau, mỗi người buộc tội người kia phải chịu trách nhiệm về lỗi lầm."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "exchange",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪksˈtʃeɪndʒ/ trao đổi",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "exchange looks/glances/insults etclook at each other, insult each other etc:trao đổi ánh nhìn, cái liếc mắt, ánh nhìn miệt thị",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪Danny and his lawyer exchanged uneasy looks.",
                                    "Danny và luật sư của anh ấy trao đổi ánh nhìn khó chịu.",
                                    "▪ As Sally approached wearing her new dress, the others exchanged glances and tried not to laugh.",
                                    "Khi Sally tiếp cận trang phục mới của mình, những người khác trao đổi những cái liếc mắt và cố gắng không cười.",
                                    "▪ The two men were exchanging insults and accusing each other of mismanagement.",
                                    "Hai người đàn ông đã trao đổi ánh nhìn miệt thị và buộc tội nhau về cách quản lý kém."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "mutual",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈmjuːtʃuəl/ lẫn nhau",
                        "examples": [
                            "mutual respect/hatred/support etc tôn trọng lẫn nhau, ghét lẫn nhau, ủng hộ lẫn nhau",
                            "respecting, hating etc each other equally:",
                            "▪A good marriage should be based on mutual love and respect.",
                            "Một cuộc hôn nhân tốt nên dựa trên tình yêu và sự tôn trọng lẫn nhau.",
                            "▪ The meeting broke up in an atmosphere of mutual irritation.",
                            "Cuộc họp đã kết thúc trong một bầu không khí kích thích lẫn nhau.",
                            "the feeling is mutual cảm xúc tương đồng",
                            "both people feel the same",
                            "▪He was very much in love with Hilda and the feeling appeared to be mutual.",
                            "Anh ấy rất yêu Hilda và dường như đó là cảm giác tương đồng.",
                            "mutually[adverb]chung",
                            "▪After weeks of discussion the two sides have reached a mutually acceptable agreement one that both sides can accept.",
                            "Sau nhiều tuần thảo luận, hai bên đã đạt được một thoả thuận chung mà cả hai bên đều có thể chấp nhận."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "reciprocal",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/rɪˈsɪprəkəl/  formalreciprocal agreement/arrangement/ visit etcan agreement etc in which one person or country does or gives the same thing to another, as they have officially agreed to do:ngược lại, song phương",
                        "examples": [
                            "▪The French students come to our school in November, and we then make a reciprocal visit to theirs",
                            "Các sinh viên Pháp đến trường của chúng tôi vào tháng mười một, và chúng tôi sau đó thực hiện một chuyến thăm ngược lại dành cho trường của họ.",
                            "▪ In countries which do not have reciprocal health agreements with your own, you will need to take out health insurance.",
                            "Ở những quốc gia không có hiệp định song phương về sức khoẻ với bạn, bạn sẽ cần phải mua bảo hiểm y tế.",
                            "on a reciprocal basis cơ sở song phương",
                            "with the understanding that both people, countries etc will do the same",
                            "▪Senior officials from both countries make regular visits on a reciprocal basis.",
                            "Các quan chức cấp cao của cả hai nước thường xuyên thăm viếng trên cơ sở song phương.."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "two-way",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈtuː weɪ/ song song",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "two-way communication/exchange/contact etc cuộc nói chuyện song song, trao đổi song song, liên lạc song song v.v",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "D",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "when two people or groups have an equal chance to express their opinions and are listening to or helping each other:",
                                    "▪It was impossible to have a two-way conversation with Derek, because he never stopped talking.",
                                    "Không thể có một cuộc nói chuyện song song với Derek, bởi vì anh ấy không bao giờ ngừng nói chuyện.",
                                    "▪ Managers who want two-way communication with their staff must be prepared to listen to what they have to say.",
                                    "Người quản lý muốn liên lạc song song với nhân viên của họ phải chuẩn bị để lắng nghe những gì họ nói."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "trade",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "/treɪd/ trao đổi",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "trade insults/threats/blows etc trao đổi ánh mắt, hăm doạ, bí mật v.v",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "to insult, threaten etc each other in an argument or fight, especially in public:",
                                    "▪The prime minister and his chancellor exchanged insults on the front pages of the national newspapers last week.",
                                    "Thủ tướng và đại pháp quan của ông đã trao nhau những lời phỉ báng trên các trang nhất của tờ báo quốc gia vào tuần trước.",
                                    "▪ The debating chamber is often simply used as a platform for trading verbal abuse.",
                                    "Buồng tranh luận thường chỉ đơn giản được sử dụng làm nền tảng cho việc trao đổi những sự hành hạ bằng lời nói."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]