[
    {
        "id": "",
        "name": "to use a person for your own advantage",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "to use sb for your own advantage",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "use",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "dùng",
                        "examples": [
                            "▪ Can’t you see they’re just using you?",
                            "Bạn không thấy họ đang lợi dụng bạn sao?",
                            "▪ She lets herself be used and then dropped by almost every man she meets.",
                            "Cô ấy để bản thân mình bị lợi dụng và sau đó bị bỏ rơi bởi hầu hết mọi người cô ấy gặp.",
                            "use somebody to do something",
                            "dùng ai đó để làm gì đó",
                            "▪ The drug smugglers used innocent travellers to carry the drugs through customs.",
                            "Những kẻ buôn lậu ma túy đã dùng những người vô tội để mang thuốc qua hải quan.",
                            "use somebody for your own endsfor your own advantage",
                            "dùng ai đó cho mục đích riêng",
                            "▪ In his political life, he was not above using his family for his own ends.",
                            "Trong cuộc sống chính trị, ông không dùng gia đình mình cho những mục đích riêng."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "take advantage of",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to use someone for your own advantage, especially someone who is very generous or is easily persuaded or deceived: lợi dụng",
                        "examples": [
                            "▪ Don’t let them take advantage of you. Stand up for yourself.",
                            "Đừng để họ lợi dụng bạn. Hãy đấu tranh cho bản thân.",
                            "▪ Older brothers and sisters often take advantage of the younger children in a family.",
                            "Anh chị em lớn tuổi hơn thường lợi dụng những đứa em nhỏ hơn trong gia đình.",
                            "take advantage of somebody’s good nature",
                            "lợi dụng ai đó",
                            "▪ She’s always willing to babysit, but I don’t want to take advantage of her good nature.",
                            "Cô ấy luôn sẵn sàng trông nom trẻ, nhưng tôi không muốn lợi dụng lòng tốt của cô ấy."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "exploit",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to use someone in order to get what you want, especially to make money from their work: bóc lột, lợi dụng",
                        "examples": [
                            "▪ Many employers are only too ready to exploit and underpay female part-time workers.",
                            "Nhiều nhà tuyển dụng sẵn sàng bóc lột và trả lương thấp cho những người lao động bán thời gian.",
                            "▪ Peasants in remote areas of the country were being shamelessly exploited by wealthy land owners.",
                            "Các nông dân ở vùng sâu vùng xa của đất nước đang bị các chủ đất giàu có bóc lột triệt để.",
                            "exploitation/ˌeksplɔɪˈteɪʃən/ [uncountable noun]",
                            "sựbóc lột, lợi dụng",
                            "▪ protests against the exploitation of children in the clothing industry",
                            "phản đối việc bóc lột sức lao động trẻ em trong ngành may mặc"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "manipulate",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to make someone do exactly what you want them to do by influencing them in a clever and dishonest way: thao túng",
                        "examples": [
                            "▪ He’s so crazy about her he doesn’t realize he’s being manipulated.",
                            "Anh ta điên cuồng cô ta, anh ta không nhận ra anh ta đang bị dụ dỗ.",
                            "manipulate somebody into (doing) something",
                            "dụ dỗ ai đó vào cái gì đó",
                            "▪ He managed to manipulate her into lending his company £500,000.",
                            "Ông ta cố dụ dỗ cô ta để cho công ty ông mượn 500.000 bảng Anh.",
                            "▪ He’s such a nice man, I could imagine him getting manipulated into a situation like that.",
                            "Anh ấy là một người đàn ông tốt nên tôi có thể hiểu vì sao anh ta bị dụ vào một tình huống như thế.",
                            "manipulation/məˌnɪpjɑˈleɪʃən/ [uncountable noun]",
                            "sự lôi kéo",
                            "▪ the manipulation of public opinion by the media",
                            "sự lôi kéo dư luận bởi các phương tiện truyền thông",
                            "manipulative/məˈnɪpjɑlətɪvǁ-leɪtɪv/ [adjective] good at manipulating people:giỏi lôi kéo",
                            "▪ Small children can be quite manipulative.",
                            "TTrẻ nhỏ có thể khá giỏi lôi kéo."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "can wrap",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/wind somebody around your little finger  informal to be able to persuade someone to do anything you want, especially someone who likes or loves you: làm ai đó phải theo ý",
                        "examples": [
                            "▪ Young girls quickly learn how to wind Daddy around their little finger.",
                            "Các cô gái trẻ nhanh chóng học cách làm nũng với cha để có mọi thứ mình muốn.",
                            "have somebody wound/wrapped around your little finger",
                            "làm ai đó phải chiều ý",
                            "▪ It was obvious she had her mother wrapped around her little finger.",
                            "Rõ ràng mẹ cô luôn chiều ý cô."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "sb who is used by sb else",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "pawn",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is used by a more powerful person or group as part of their plans for getting power, especially when the person being used does not realize this: tốt đen",
                        "examples": [
                            "▪ The soldiers were nothing more than pawns, regarded as dispensable by their officers.",
                            "Những người lính không gì khác hơn là những con tốt, được xem như những vũ khí của họ.",
                            "use somebody as a pawn",
                            "dùng ai đó như con tốt",
                            "▪ The ambassador was being used as a pawn in the struggle between the two superpowers.",
                            "Đại sứ được sử dụng như một con tốt trong cuộc đấu tranh giữa hai siêu cường."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "puppet",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a ruler or government that seems to be independent but is really controlled by the government of another more powerful country: con rối",
                        "examples": [
                            "a puppet ruler/regime/government",
                            "quy định/chế độ/chính phủ bù nhìn",
                            "▪ In 1290, Edward I set up a puppet government in the Scottish lowlands.",
                            "Năm 1290, Edward đệ nhất thành lập một chính phủ bù nhìn ở vùng đất trũng Scotland.",
                            "puppet of",
                            "con rối",
                            "▪ During the 70s many Eastern European leaders were merely puppets of the Kremlin.",
                            "Trong những năm 70 nhiều nhà lãnh đạo Đông Âu chỉ là những con rối của Kremlin."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "tool",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is controlled and used unfairly by another person or group, especially to do something bad: công cụ",
                        "examples": [
                            "tool of",
                            "công cụ của",
                            "▪ The king was merely a tool of the military regime.",
                            "Nhà vua chỉ là một công cụ của chế độ quân sự."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "stooge",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who always does what another person or group wants: bù nhìn",
                        "examples": [
                            "▪ Community leaders in the area are widely regarded as police stooges.",
                            "Các nhà lãnh đạo cộng đồng trong khu vực được coi là cảnh sát bù nhìn.",
                            "stooge of",
                            "bù nhìn của",
                            "▪ He accused her of being a stooge of the Tory Party.",
                            "Ông ấy đã cáo buộc bà ta là bù nhìn của Đảng Tory."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "instrument",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is used and controlled by someone or something more powerful: dụng cụ",
                        "examples": [
                            "instrument of",
                            "dụng cụ của",
                            "▪ Even small children were used as instruments of the regime, encouraged to spy on and report their parents.",
                            "Ngay cả trẻ nhỏ cũng được dùng làm công cụ của chế độ, được khuyến khích theo dõi và báo cáo về cha mẹ chúng.",
                            "▪ The Committee on Ethics in Public Life was regarded by many as being a mere instrument of the government.",
                            "Ủy ban về Đạo đức trong Cuộc sống Công cộng được nhiều người coi chỉ là công cụ của chính phủ."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]