[
    {
        "id": "",
        "name": "assigning and appointing",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "to choose sb for a job or team",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "choose",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A1",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to decide who is thebestperson for a job, team, prize etc:",
                        "examples": [
                            "chọn",
                            "▪ Companies are now using computers to help them choose new workers.",
                            "Các doanh nghiệp đang sử dụng máy tính để giúp họ trong việc chọn nhân viên mới.",
                            "choose somebody as something",
                            "chọn ai đó cho cái gì",
                            "▪ The board has unanimously chosen Cole as Gray’s temporary replacement.",
                            "Ban giám đốc đã nhất trí chọn Cole cho vị trí thay thế tạm thời của Gray.",
                            "choose somebody to do something",
                            "chọn ai để làm gì đó",
                            "▪ Eventually, Jane was chosen to deliver the message.",
                            "Thế là cuối cùng, Jane được chọn để đi truyền tin."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "appoint",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to choose someone for a job, especially an important job:",
                        "examples": [
                            "▪ The French president has appointed a new Minister for Culture.",
                            "▪ The committee was appointed to make recommendations on housing development in the area.",
                            "appoint somebody as director/manager etc",
                            "▪ When he was governor, Brown appointed Rose Bird as chief justice of the California Supreme Court.",
                            "appoint somebody director/manager etc",
                            "▪ Schreiber was appointed director of human resources.",
                            "appoint somebody to a job/post/ position etc",
                            "▪ This is the first time that a woman has been appointed to the post.",
                            "appointment[countable noun]",
                            "▪ His appointment to the position of Senior Surgeon was unexpected.",
                            "appoint/əˈpɔɪnt/ [transitive verb] toofficiallychoose someone to do animportantjob:",
                            "cử , bổ nhiệm",
                            "▪ The company has appointed a new sales director.",
                            "Công ty đã bổ nhiêm một giám đốc kinh doanh mới.",
                            "appoint somebody to something",
                            "bổ nhiêm ai làm việc gì",
                            "▪ Simpson has been appointed to the Memphis Branch board for a three-year term.",
                            "Simpson đã được bổ nhiệm vào ban giám đốc chi nhánh Memphis nhiệm kỳ ba năm.",
                            "appoint somebody as something",
                            "bổ nhiệm ai là gì",
                            "▪ They have appointed Jane Staller as their new East Coast manager.",
                            "Họ đã bổ nhiệm Jane Staller như là quản lý East Coast của mình.",
                            "appoint somebody to do something",
                            "bổ nhiệm ai làm việc gì đó",
                            "▪ A committee was appointed to consider changes to the Prison Service.",
                            "Một ủy ban đã được bổ nhiêm để xem xét những thay đổi dịch vụ trong tù.",
                            "appointverbCHOOSE cử; bổ nhiệm",
                            "[ T ] to choose someone officially for a job or responsibility",
                            "_We've appointed three new teachers this year.",
                            "_He's just been appointed(as)director of the publishing division.",
                            "_[ + to infinitive ]A commission has just been appointedtoinvestigate fraud claims."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "select",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "to choose someone for a particular job, team, place at school etc, after considering a lot of different people who might be suitable:",
                        "examples": [
                            "chọn lựa",
                            "▪ The college selects only twelve students a year from the thousands who apply.",
                            "Trường chỉ lựa ra mười hai sinh viên mỗi năm từ hàng nghìn thí sinh đăng ký.",
                            "select somebody for something",
                            "lựa chọn ai chocái gì",
                            "▪ We selected four applicants for interview.",
                            "Chúng tôi lựa chọn bốn ứng viên cho vòng phỏng vấn.",
                            "select somebody to do something",
                            "lựa chọn ai để làm gì đó",
                            "▪ Ernst had been selected to play in the game against Belgium.",
                            "Ernst đã được chọn để chơi trong trận đấu với Bỉ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "commission",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "toappointsomeone to do a piece of work for you, for example to write a report or to produce some artistic or scientific work:",
                        "examples": [
                            "▪ The Philadelphia Medical Society commissioned a report on alcoholism.",
                            "be commissioned for/by/from etc:",
                            "▪ His ‘Landscapes’ Symphony was commissioned for the inaugural concert of the Shepherd School.",
                            "▪ Seventy-five percent of Americans think that women are more sensual than men, according to a survey commissioned by Revlon.",
                            "▪ The Left-Hand Piano Concerto was the first of several works commissioned from distinguished composers.",
                            "commission somebody to do something : ủy nhiệm ai làm gì",
                            "▪ In 1506, Bramante was commissioned by Pope Julius II to rebuild St Peter’s church.",
                            "▪ The gallery is housed in the new wing, which he commissioned Adams to build 18 years ago.",
                            "commissionverbWORK chính thức bổ nhiệm; phong tước",
                            "[ T ] to formally choose someone to do a special piece of work",
                            "_The newspaper commissioned a series of articles on the worst excesses of the fashion industry."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "assign sb to sth",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[often passive]",
                        "usage": "",
                        "region": "",
                        "definition": "assignsbtosthphrasal verb bổ nhiệm",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "to choose someone to do a particular job",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_Which police officer has been assigned to this case?"
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "pick",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to choose someone for asportsteamor animportantjob:",
                        "examples": [
                            "chọn, lựa",
                            "▪ The class was divided into four teams, and each group was asked to pick a leader.",
                            "Lớp học được chia thành bốn nhóm, và mỗi nhóm được yêu cầu chọn một nhóm trưởng.",
                            "pick somebody to do something",
                            "chọn ai để làm gì đó",
                            "▪ Joe picked Steve and Terry to be on his team.",
                            "Joe đã chọn Steve và Terry về đội của mình.",
                            "pick somebody for something",
                            "chọn ai cho việc gì đó",
                            "▪ Do you think he might pick another woman for the Supreme Court?",
                            "Bạn có nghĩ là ông ấy sẽ chọn một phụ nữ khác vào Bồi thẩm đoàn không?"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "name",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "topubliclysay who has been chosen for animportantjob in an organization:",
                        "examples": [
                            "chỉ định, bổ nhiệm",
                            "▪ The editor of ‘The Times’ has resigned amid a political storm. His successor has not yet been named.",
                            "Chủ biên của tờ 'The Times\" đã xin từ chức giữa lùm xùm chính trị. Người kế nhiệm vẫn chưa được chỉ định.",
                            "name somebody to something",
                            "chỉ định ai làm gì",
                            "▪ McCarthy was recently named to the Small Business Committee.",
                            "McCarthy gần đây được chỉ định vào Hiệp hội các doanh nghiệp nhỏ.",
                            "name somebody as something",
                            "chỉ định ai là",
                            "▪ The magazine has named Bonnie Fuller as deputy editor.",
                            "Tạp chí đã chỉ định Bonnie Fuller là phó biên.",
                            "name somebody something",
                            "chỉ định ai cái gì",
                            "▪ We are naming Dr Bob McClure head of the IRC in China.",
                            "Chúng tôi đang bổ nhiệm tiến sĩ Bob McClure là người đứng đầu IRC ở Trung Quốc."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "nominate",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if someone, especially a group of people, nominates someone, they officially choose that person to be considered for a particular job:",
                        "examples": [
                            "đề cử, tiến cử",
                            "nominate somebody to something",
                            "đề cử ai cho cái gì",
                            "▪ Mills is expected to be formally nominated to the board next month.",
                            "Mills được mong sẽ chính thức được tiến cử vào ban giám đốc trong tháng sau.",
                            "nominate somebody to do something",
                            "tiến cử ai làm gì đó",
                            "▪ Lee was the first Chinese American nominated to head the Civil Rights Division.",
                            "Lee là người Mỹ gốc Hoa đầu tiên được đề cử đứng đầu Bộ phận nhân quyền.",
                            "nominate somebody as something",
                            "tiến cử ai cho vị trí nào đó",
                            "▪ They nominated her as the British spokesperson at the International Arms Conference.",
                            "Họ đã tiến cử cô cho vị trí người phát ngôn của Anh tại Hội nghị quốc tế về vũ khí.",
                            "nominateverb[ T ]CHOOSE chỉ định; bổ nhiệm",
                            "to officially choose someone for a job or to do something",
                            "_She was nominatedasthe delegation's official interpreter.",
                            "_[ + to infinitive ]President Yeltsin nominated acting prime minister Sergei Kiriyenko to head the government.",
                            "nominationnoun[ C or U ]CHOICEchỉ định; bổ nhiệm",
                            "when someone is officially chosen for a job or position",
                            "_The nominationofJudge Watkins as head of the inquiry was a surprise.",
                            "nomineenoun[ C ]CHOICE người được chỉ định; người được bổ nhiệm",
                            "a person who is officially chosen for a position or job"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be shortlisted",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "[UK]",
                        "definition": "/be on the short list/biː ɒn ðə ˈʃɔːʳt lɪst/  if you are shortlisted or on the short list for a job or a position, you are one of a small group of people who have been chosen from other people who want the job, and from that small group one person will be chosen:",
                        "examples": [
                            "được đưa vào danh sách sơ tuyển",
                            "▪ Three applicants have been shortlisted and will be invited for interview next week.",
                            "Ba ứng viên được tuyển chọn và được mời đến buổi phỏng vấn tuần sau.",
                            "be shortlisted for",
                            "được tuyển chọn cho",
                            "▪ He’s been on the President’s short list for the job twice.",
                            "Anh ấy đã nằm trong danh sách ứng cử của chủ tịch hai lần rồi."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "tap",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "[US]",
                        "definition": "toofficiallychoose someone for animportantjob:",
                        "examples": [
                            "chính thức bổ nhiệm",
                            "tap somebody for something",
                            "chính thức bổ nhiêm ai cho việc gì",
                            "▪ Reinhardt was tapped for the federal bench in 1980 by former President Carter.",
                            "Reinhardt chính thức được bổ nhiệm vào một ghế ngồi trong liên bang vào năm 1980 bởi cựu tổng thống Carter."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "to give sb work to do",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "give",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A1",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if you give someone a job, some work etc, you offer them the job, work etc, or ask them to do it for you:",
                        "examples": [
                            "giao cho ai ( một công việc, nhiệm vụ ... )",
                            "give somebody something",
                            "▪ I asked Joel’s teacher if we should give him some Level 4 work.",
                            "▪ We were given some grammar assignments for homework.",
                            "give something to somebody",
                            "▪ Angie did a really good interview, but they gave the job to someone with more experience.",
                            "give somebody something to do/give something to somebody to do",
                            "▪ What can I give Helen to do? She’s finished the filing.",
                            "▪ OK, you open the parcels. That’ll give you something to do.",
                            "▪ ‘Have you peeled the carrots?’ ‘No, I gave them to Dad to do.’"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "assign",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[transitive verb usually in passive]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "to give a particular job to a particular person:",
                        "examples": [
                            "phân công",
                            "be assigned something",
                            "▪ You have been assigned the task of keeping the records up to date.",
                            "▪ After her promotion took effect, she was assigned a research job.",
                            "be assigned to somebody",
                            "▪ The job of producing a development program was assigned to the junior minister.",
                            "▪ He was asked to assign two of his employees to the inventory control department.",
                            "assignverb[ T ]CHOOSEphân công",
                            "[ often passive ] to give a particular job or piece of work to someone",
                            "_[ + two objects ]UN troops were assigned the task of rebuilding the hospital.",
                            "_The case has been assignedtoour most senior officer."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "set/set/  especiallyBritish",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if a teacher or employersetsyou a piece of work, they give it to you to do, and you must finish it by aparticulartimeordate:",
                        "examples": [
                            "giao ( bài tập , việc phải hoàn thành đúng hạn )",
                            "set homework/a task/work etc : giao bài tập về nhà/ một nhiệm vụ/ công việc ..",
                            "▪ Mr Harris always sets a lot of homework.",
                            "▪ Is that all -- or has she set some other task for you as well?",
                            "▪ Anneka was set the huge task by Christian Aid on behalf of a family who fled from war-torn Mozambique.",
                            "set somebody something : giao cho ai cái gì",
                            "▪ She set us some work to do in groups.",
                            "▪ At the end of the session, they were set a homework task.",
                            "setverbsetting,set,setGIVE WORK",
                            "[ T ]mainly UK(US usuallyassign) to give or provide a piece of work or task for someone to do",
                            "_My science teacher always sets a lot of homework.",
                            "_What books have been set for this term?",
                            "_[ + two objects ]We set the kids the task of clearing the snow from the front path."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "saddle sb withsaddle somebody withalsolumber somebody withBritish",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[transitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "informal   to give someone anunpleasantordifficultjob to do:",
                        "examples": [
                            "be/get saddled with something",
                            "▪ Campaign adviser Ken Polaski has been saddled with the job of explaining the recent presidential gaffes.",
                            "▪ ‘I’m sorry you’ve been lumbered with running me back home,’ said Ashley stiffly",
                            "saddle something with something",
                            "▪ The Hong Kong Rugby Union has saddled Simpkin with the post of national coach to the ailing team."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "to give the responsibility for doing sth to another person",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "make sb responsible for",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "make somebody responsible for  làm cho ai đó trách nhiệm",
                        "examples": [
                            "▪ The law makes the government responsible for clean up of the waste at these sites.",
                            "Luật làm chính phủ có trách nhiệm trong việc làm sạch rác tại những điểm này",
                            "▪ Our department has been made responsible for all areas of training.",
                            "Bộ phận của chúng tôi chịu trách nhiệm về tất cả các lĩnh vực trong công tác đào tạo",
                            "▪ The best way of ensuring that the chores are done is by making each child responsible for a different one",
                            "Cách tốt nhất để đảm bảo rằng các công việc nhà sẽ được giao khác nhau cho mỗi đứa trẻ"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "put sb in charge",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "put somebody in charge  to give someone the responsibility of doing something or of making sure that it is done: cho ai đó phụ trách",
                        "examples": [
                            "▪ The boss is going to be out of the office next week, and he’s putting me in charge.",
                            "Người chủ sắp không ở trong văn phòng tuần tới và anh ta đã giao lại cho tôi phụ trách",
                            "put sb in charge of: giao cho ai đó phụ trách",
                            "▪ Who have they put in charge of the investigation?",
                            "Ai là người phụ trách việc điều tra?",
                            "▪ He had done rather well in the job and had been put in charge of a whole chain of stores.",
                            "Anh ta đã làm quá tốt công việc, anh ta đã được giao phụ trách một chuỗi cửa hàng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "delegate",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[intransitive/transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to make someone you work with, especially someone in alowerpositionthan you, responsible for a job or duty, so that you do not have to do it yourself:",
                        "examples": [
                            "ủy thác, ủy nhiệm ( công việc cho cấp dưới )",
                            "▪ New managers often find it difficult to delegate.",
                            "Người quản lí thường xuyên cảm thấy khó khăn trong việc ủy thác",
                            "▪ If you’re so busy, why don’t you delegate some of your work?",
                            "Nếu bạn bạn quá, tại sao không ủy thác một số công việc của bạn",
                            "delegateverbGIVE uỷ quyền; uỷ thác; giao phó",
                            "[ I or T ] to give a particular job, duty, right, etc. to someone else so that they do it foryou",
                            "_As a boss you have to delegate (responsibilitiestoyour staff).",
                            "_Authority to make financial decisions has been delegatedtoa special committee."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "pass the buck",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to try not to accept responsibility for a problem or a mistake that you have made, by saying that it was someone else’s fault:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "đổ trách nhiệm",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ It’s easy to pass the buck and blame someone else for your failure."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Thật dễ để đổ trách nhiệm và lỗi lầm cho người khác về những thất bại",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Diplomats say NATO is clearly at fault, and that officials there are trying to pass the buck."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Các nhà ngoại giao nói rằng rõ ràng là lỗi của NATO song các quan chức lạ cố gắng đổ trách nhiệm",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "leave sth withleave something with British",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to make someone responsible for something that you cannot do or do not have time to do:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "để lại công việc của mình cho người khác làm",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ I didn’t have time to do the accounts so I left them with Sophie."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Tôi không có thời gian để tính toán vì thế tôi đã để lại cho Sophie",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Can we leave all this with you? It’s just too complicated for us to understand."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Chúng tôi có thể để lại tất cả những việc cho bạn không? nó quá phức tạp đối với chúng tôi để hiểu nó",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "leave it to sb",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "leave it to  to make someone responsible for doing something, especially something that has already been started: để công việc cho ai đó",
                        "examples": [
                            "▪ Leave it to me. I’ll find you a place to stay.",
                            "hãy để tôi lo, tôi sẽ tìm cho bạn một chỗ mới để ở",
                            "lleave it to somebody to do something: để ai đó làm gì đó",
                            "▪ Can I leave it to you to sort out the details of the conference?",
                            "Tôi có thể để bạn phân loai các chi tiết của hội nghị được không?",
                            "▪ The proposal leaves it to local communities to enforce the law.",
                            "Đề suất để hội đồng địa phương thực thi pháp luật"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "entrust",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "to give someone the responsibility of doing somethingimportant, especially because you believe they will do it well and honestly:",
                        "examples": [
                            "ủy thác, giao nhiệm vụ",
                            "entrust somebody/something to somebody: ủy thác ai đó",
                            "▪ I foolishly entrusted the task of collecting the money to Ron.",
                            "Tôi đã ngu ngốc ủy thác công việc thu tiền cho Ron",
                            "entrust somebody with something : ủy thác về điều gì đó",
                            "▪ Managers show respect for employees by entrusting them with important decisions.",
                            "Nhiều quản lí cho thấy sự tông trọng nhân viên bằng cách ủy thác cho họ những quyết định quan trọng",
                            "entrust somebody/something to the care of somebody : ủy thác ai đó chăm sóc ai đó",
                            "▪ As a child Bertrand was entrusted to the care of nuns at a local convent",
                            "Khi là một đứa trẻ , Bertrand được giao nhiệm vụ chăm sóc cho các nữ tu tại tu viện địa phương"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "accepting jobs or not",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "take sth on",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[M]",
                        "usage": "",
                        "region": "",
                        "definition": "takesthonphrasal verb đảm nhiệm, nhận làm, gánh vác",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "to accept a particular job or responsibility",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_She took too much on and made herself ill."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "offer the job to sb",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "give sb a job",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "give somebody a job",
                        "examples": [
                            "▪ If I give you the job, how soon can you begin?"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪ After law school, he was given a job in the city’s legal department.give sb a job as",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Goldman gave her a job as his assistant."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "set sb to work",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "usage": "",
                        "region": "",
                        "definition": "setsbto work cho ai một công việc gì",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "to give someone work to do",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "D",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_I was set to work tidying the bookshelves."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "offer st to sb",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "",
                        "region": "",
                        "definition": "_ Finally , weofferthe jobtothe right people.",
                        "examples": [],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "uncategoried",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "serve",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "usage": "",
                        "region": "",
                        "definition": "verbWORK phục vụ, phụng sự, làm nhiệm vụ",
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "appointment",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "usage": "",
                        "region": "",
                        "definition": "nounJOB (sự)bổ nhiệm",
                        "examples": [
                            "[ C or U ] when someone is officially chosen for a job, or the job itself",
                            "_his appointmentassenior lecturer",
                            "_We would like to announcetheappointmentofJulia Lewisashead of sales.",
                            "_Our department expects tomakefive new appointments (= appoint five new people) this year alone."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "assign",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[T]",
                        "usage": "",
                        "region": "",
                        "definition": "verbSEND",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "to send someone somewhere to do a job",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_She was assignedtothe newspaper's Berlin office."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "somebody who is chosen for a job",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "appointee",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "noun người được chọn (để làm việc gì); người được bổ nhiệm",
                        "examples": [
                            "someone who has been chosen officially for a job or responsibility",
                            "_a government appointee",
                            "_The new appointee will be working closely with both departments."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]