[
    {
        "id": "",
        "name": "representing",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "to represent a person or group",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "represent",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if yourepresenta person or group at a meeting or in a law court or parliament, you give their opinions and make decisions for them; if yourepresenta country, school etc in a competition, you have been chosen to compete for that country or school: Đại diện",
                        "examples": [
                            "▪ Each class will elect two students to represent them on the School Council",
                            "Mỗi lớp được chọn hai hoc sinh để đại diện cho lớp ở hội đồng nhà trường",
                            ".▪ Trade Unions representing ambulance workers yesterday agreed to accept a 5% pay increase.",
                            "Các hiệp hội công đoàn đại diện cho nhũng nhân viên cứu thương ngày hôm qua đồng ý chấp nhận tăng 5%",
                            "▪ The new law has been criticized by groups representing disabled people.",
                            "Luật mới bị chỉ trích bởi các nhóm đại diện cho người khuyết tật",
                            "▪ The athletes will represent China in this year’s Olympic Games.",
                            "Các vận động viên sẽ đai diện cho Trung Quốc ở thế vận hội năm nay",
                            "▪ Wilson was represented in court by a top criminal lawyer.",
                            "Wilson được đại diện tại tòa án bởi một luật sư hình sự nổi tiếng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "speak for",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to represent a group of people by expressing their feelings, thoughts, or beliefs:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "thay mặt cho",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ David Blunkett, speaking for the Labour Party, said more money should be spent on higher education."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "David Blunket, thay mặt cho Đảng nói rằng nên sử dụng nhiều tiền cho việc giáo dục",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ I can only speak for my own family, not for the other families involved in this case."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Tôi chỉ thay mặt cho gia đình của tôi chứ không phải cho gia đình nào khác trong trường hợp này",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "on behalf of somebody",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[preposition]",
                        "usage": "",
                        "region": "",
                        "definition": "/on somebody’s behalf  if you speak to peopleon behalf ofsomeone, you express their ideas, opinions, or feelings for them: Đại diện cho",
                        "examples": [
                            "▪ On behalf of everyone here, I’d like to wish Ted a long and happy retirement.",
                            "Đại diện cho tất cả mọi người, tôi muốn chúc Ted có một thời gian về hưu vui vẻ và lâu dài",
                            "▪ I would like to thank you all on my mother’s behalf for all your cards and good wishes.",
                            "Tôi muốn thay mặt cho mẹ tôi cảm ơn tất cả mọi người vị những tấm thiệp và những lời chúc tốt đẹp",
                            "act on behalf of somebody đại diện cho ai",
                            "▪ The lawyer acting on behalf of Mrs Anderson said he would continue the fight to clear her name.",
                            "Luật sư thay mặt cho Bà Anderson nói rằng ông ấy sẽ tiếp tục cuộc chiến là trong sạch danh tiếng của bà ấy"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "act for",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb not in passive]",
                        "usage": "",
                        "region": "",
                        "definition": "to represent someone by making decisions for them, especially legal or financial decisions: thay mặt để quyết dịnh , đại diện",
                        "examples": [
                            "▪ It’s a good idea to have an estate agent to act for you when you are selling a house."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Thật là ý kiến hay khi nhờ một đại lí bất động sản đại diện cho bạn khi bạn bán nhà",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Lawyers acting for the defendant asked for her case to be adjourned while they examined new evidence."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Những người luật sư đại diện cho bị cáo yêu cầu trường hợp của cô ấy được hoãn lai trog khi họ đang tìm chứng cớ mới",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "play/run/swim etc for",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb not in passive]",
                        "usage": "",
                        "region": "",
                        "definition": "if youplay, run, swim etc fora school, club, or country, you represent it in a sports competition against other schools, clubs, or countries: chơi/chay/bơi cho",
                        "examples": [
                            "▪ Playing rugby for England had always been one of his dreams."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Chơi bóng bầu dục cho nước Anh luôn luôn là một trong những ước mơ của anh",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ I used to swim for my school."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Anh ấy đã từng đại diện bơi cho trường",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Simon Short, running for Scotland, is in the lead as they come round the final bend."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Simon Shrt đại diện chạy cho Scotland đang dẫn đầu khi họ đang ở chỗ rẽ cuối cùng",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "sb who represents a person or a group",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "representative",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who has been chosen to represent an organization or country: người đại diện",
                        "examples": [
                            "▪ Japan has refused to send a representative to the talks in Geneva.",
                            "Nhật Bản từ chối làm người đại diện cho những cuộc trò chuyện ở hiệp hội Gneva",
                            "▪ John Kohorn is the company’s representative in Prague.",
                            "John Kohm là người đại diện cho công ty ở Prague",
                            "representative from: Người đại diện từ",
                            "▪ the representative from Belgium",
                            "Người đại diện đến từ Belgium",
                            "representative of: Người đại diện của",
                            "▪ We discussed these issues with a senior representative of the company.",
                            "Chúng tôi thảo luận những vấn đề liên quan đền người đại diện cấp cao của công ty"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "spokesman/spokeswoman",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a person who officially gives the opinions of an organization, company, government etc: Nam/ nữphát ngôn",
                        "examples": [
                            "spokesman/spokeswoman for: Người phát ngôn cho",
                            "▪ A spokesman for the company denied reports that the new drug could cause heart attacks.",
                            "Nam phát ngôn cho công ty phủ nhận những thông tin cho rắng thuốc mới này gây ra co thắt tim",
                            "government/ministry/party etc spokesman/spokeswoman: Người phát ngôn của chính phủ/bộ/Đảng",
                            "▪ A government spokeswoman said the new laws would protect vulnerable children.",
                            "Nam phát ngôn của chính phủ nói rằng luật mới sẽ bảo vệ những trẻ em bị tổn thương",
                            "▪ Mr Simon Hughes, a company spokesman, spoke to reporters after the meeting.",
                            "Ông Mr Simon Huges, nam phát ngôn của công ty nói chuyện những phóng viên sau cuộc họp"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "spokesperson",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a word meaningspokesmanorspokeswoman,used especially when you do not want to say whether the person is a man or a woman: Người phát ngôn",
                        "examples": [
                            "spokesperson for: người phát ngôn cho",
                            "▪ A spokesperson for the company read to waiting reporters from a prepared statement",
                            "Người phát ngôn cho công ty đợi các phóng viên để thông báo lời tuyên bố đã được chuẩn bị",
                            "spokesperson on: Người phát ngôn về cái gì",
                            "▪ the Labour Party spokesperson on education",
                            "Người phát ngôn giáo dục của Đảng lãnh đạo",
                            "government/party/union etc spokesperson:Người phát ngôn của chính phủ/ Đảng/ liên minh",
                            "▪ A government spokesperson has denied the allegation of corruption.",
                            "Nguời đại diện của chính phủ phủ nhận việc tham nhũng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "agent",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a person or company which represents another person or company in business, financial, or legal matters: đại lí, người đại diện",
                        "examples": [
                            "▪ The firm has an agent in Sydney who deals with the Australian side of the business",
                            "Công ty có người đại diện đại lí ở Sydney người mà sẽ thỏa thuận với doanh nghiệp của Úc",
                            ".▪ The licence application must be signed by the applicant or his agent.",
                            "Đơn xin cấp giấy phép cần phải được kí bởi người nộp đơn hoặc người đại diện cho đại lí của anh ấy",
                            "agent for : đại lí cho",
                            "▪ The company is the UK agent for a top Danish furniture maker.",
                            "Công ty này là công ty đại lí cho Hoa kì về thị trường sản xuất",
                            "đồ mộc hàng đầu của người Đan Mạch"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "envoy",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a person who is sent to another country as an official representative, especially by a government to discuss important matters such as war with another government: Đai diện ngoại giao",
                        "examples": [
                            "▪ The President met yesterday with an envoy from Pakistan.",
                            "Tổng thống gặp mặt đại diện ngoại giao đến từ Pakistan ngày hôm qua",
                            "send an envoy: đưa một người đại diện ..",
                            "▪ Iran agreed to send an envoy to the United Nations for talks on ending the war",
                            "I Raq đồng ý đưa một ngừơi đại diện ngoại giao đến Liên Hợp Quốc để thảo luận việc chấm dứt chiến tanh",
                            "▪ A special envoy was sent to Manila to try and secure the release of the hostages.",
                            "Một người đại diện ngoại giao đặc biệt đã được đưa sang Manila để thương lượng việc thả con tin"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "delegate",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is sent to an important meeting by a country or organization in order to represent them by speaking for them and voting for them: Người đại biểu",
                        "examples": [
                            "▪ I sat next to the Canadian delegate.",
                            "Tôi ngồi kế người đại biểu người Cannada",
                            "delegate to: đại diện cho",
                            "▪ The US delegate to the committee announced a grant of $75 million to help third world countries.",
                            "Mỹ đại diện cho ủy ban thông báo viện trợ 7 triệu đô để giúp đỡ cho các nước thứ ba",
                            "send a delegate: phái người đại diện/đại biểu",
                            "▪ Some local branches have refused to send delegates to the national conference.",
                            "Một số chi nhánh địa phương đã từ chối việc phái người đại biểu sang hội nghị quốc gia"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "mouthpiece",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun usually singular]",
                        "usage": "",
                        "region": "",
                        "definition": "a person, organization, or newspaper which only gives the opinions of one person or organization and which does not have anything original to say: người phát ngôn, đại diện",
                        "examples": [
                            "▪ In 1917 Stalin became editor of Pravda, the official mouthpiece of the Communist Party."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Vào năm 1970 Stalin trở thành nhà biên tập của Pravda và nhà phát ngôn chính thức của Đảng Cộng sản",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The Chemical Manufacturers Association is the mouthpiece of the American chemicals industry."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Hiệp hội các nhà sản xuât hóa chất là nhà đại diện của ngành công nghiêp hóa chất Mỹ",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "a group of people who go sw to represent a country or organization",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "delegation",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[countable noun with singular or plural verb in British English]",
                        "usage": "",
                        "region": "",
                        "definition": "a team of people who have been sent by an organization or a country to represent them at an important meeting: :đoàn đại biểu của",
                        "examples": [
                            "delegation of: đoàn đai biêu của",
                            "▪ The health ministers agreed to meet a delegation of heart patients.",
                            "Các bộ trưởng ý tế đã đồng ý gặp đoàn đại biếu của những bện nhân bị bênh tim",
                            "delegation from: Đoàn đại biểu từ",
                            "▪ A delegation from Nigeria has arrived to have talks with the British foreign minister",
                            "Đoàn đại biểu từ Nigeria đã đến thảo luận với bộ trưởng nước ngoại Anh",
                            "send a delegation phái đoàn đại biểu",
                            "▪ Headteachers have sent a delegation to London to ask the government to put more money into education.",
                            "Những hiệu trưởng đã phái đoàn đại biểu sang Luân Đôn để yêu cầu cung cấp nhiều tiền hơn trong giáo dục",
                            "lead a delegation: Dẫn đoàn đại biểu",
                            "▪ The Dutch Prime Minister led a 12 member economic delegation to Indonesia to discuss future investments in the country.",
                            "Thủ tướng Hà Lan đã dẫn đoàn đại biểu gồm 12 thành viên đến Indonesia để thỏa luận những đầu tư tương lai ở quốc gia này",
                            "delegationnounCHOSEN PEOPLE",
                            "[ C + singular or plural verb ]a group of delegates",
                            "_A delegation fromSpainhas/have arrived for a month."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "deputation",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun with singular or plural verb in British English]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "a group of people representing a larger group who are sent to talk to a person in authority in order to make a complaint or a request: phái đoàn",
                        "examples": [
                            "deputation of: phái đoàn của",
                            "▪ A deputation of church leaders has met with the government to discuss the teaching of religion in schools.",
                            "Một phái đoàn nhưng người lãnh đạo trong nhà thờ gặp gỡ chính phủ để thảo luận việc giảng dạy tôn giáo tại trường học",
                            "meet/receive a deputation: Gặp phái đoàn",
                            "▪ In the morning the minister received a deputation from the National Union of Farmers protesting about the government’s plans to cut agricultural subsidies.",
                            "Vào buổi sáng bộ trưởng nhận được lời đề nghị của phái đoàn hội Nông Dân Liên Hợp Quốc để phản đói kế hoặc cắt giảm trợ cấp nông nghiệp"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "mission",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun with singular or plural verb in British English]",
                        "usage": "",
                        "region": "",
                        "definition": "a group of people who are sent by their government to another country in order to discuss something: phái đoàn",
                        "examples": [
                            "▪ The French President has sent a mission to the region to try to find a peace formula.",
                            "Tổng thống Pháp đã cử một phái đoàn sang khu vực này để cố gắng tìm ra biện pháp hòa bình",
                            "trade missiona mission to discuss trade: đoàn thương mại",
                            "▪ A British trade mission has arrived in Moscow.",
                            "Một đoàn đại biểu thương mại đã đến Moscow"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]