[
    {
        "id": "",
        "name": "grants and allowances",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "university",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "bursary",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[ C ]",
                        "usage": "",
                        "region": "",
                        "definition": "nounUK học bổng",
                        "examples": [
                            "a sum of money given to a person by an organization, such as a university, to pay for them to study"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "fellowship",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "",
                        "region": "",
                        "definition": "nounEDUCATION học bổng caohọc",
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "by company",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "redundancy payment",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[ C ]",
                        "usage": "",
                        "region": "",
                        "definition": "redundancypaymentnoun trợ cấp thôi việc",
                        "examples": [
                            "money that acompanypays to workers who havelost their jobs because they arenolonger needed"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "money that you receive regularly",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "allowance",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/əˈlaʊəns/  money that someone receivesregularlyfor aspecialreason, and that they do not earn by working:",
                        "examples": [
                            "trợ cấp",
                            "▪ Some students have an allowance from their parents.",
                            "clothing allowancemoney for buying clothes",
                            "▪ Does your mom give you a clothing allowance?",
                            "monthly/weekly/yearly allowance",
                            "▪ In exchange for looking after the children, Annie has all her meals paid for and receives a small monthly allowance.",
                            "▪ I think my yearly allowance is about three hundred, you know, so I’m rapidly running out.",
                            "allowancenounAMOUNT GIVEN tiền trợ cấp",
                            "[ C ] money that you are given regularly, especially to pay for a particular thing",
                            "_The perks of the job include a company pension scheme and a generoustravelallowance.",
                            "_I couldn't have managed at college if I hadn't had an allowance from my parents."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "pension",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "alsoretirement planAmerican /ˈpenʃən, riˈtaɪəʳmənt plæn/  an amount of money that old people receiveregularlyfrom thegovernment, their former employer, or from an insurance company, because they have paid in money to the government etc over many years:",
                        "examples": [
                            "trợ cấp , lương hưu",
                            "▪ I don’t know how you manage on your pension, Lil, I really don’t.",
                            "▪ He gets a pretty good pension from his old firm.",
                            "▪ The company has a very generous retirement plan.",
                            "state pension : lương hưu nhà nước",
                            "a pension from the government",
                            "▪ If a man retires at 58, he’s actually got seven years to go before he draws his state pension.",
                            "old-age pension: trợ cấp cho người già, trợ cấp dưỡng lão",
                            "British a pension that people receive from the government when they reach a particular age",
                            "▪ The government is considering linking the old-age pension to earnings.",
                            "disability/invalidity pension",
                            "trợ cấp khuyết tật/thương tật",
                            "British a pension given to someone who cannot work because they are ill or injured",
                            "▪ He retired from the force with a disability pension.",
                            "▪ Martin still hasn’t got his invalidity pension sorted out.",
                            "pension planalsopension scheme : kế hoạch lương hưu",
                            "British an arrangement to pay people a pension",
                            "▪ Is there a pension scheme where you work?",
                            "draw a pension : nhận, rút tiền trợ cấp",
                            "receive a pension, especially one from the government",
                            "▪ How long have you been drawing a pension?",
                            "live on a pension",
                            "sống nhờ trợ cấp",
                            "when your pension is the only money you receive",
                            "▪ Living on a pension isn’t easy you know. You really have to scrimp and save.",
                            "pensionnoun[ C ] tiền trợ cấp",
                            "a sum of money paid regularly by the government or a private company to a person whodoes not work any more because they aretoo old or they have become ill",
                            "_They find it hard to live on their state pension.",
                            "_He won't be able todraw(= receive) his pension until he's 65."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "Social Security",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌsəʊʃəl sɪˈkjʊərti/  in the UK, money that the government gives to people who are ill, old, or unemployed. In the US, money from a government programme that workers pay into, which provides them with money when they are old or unable to work, or the programme itself:",
                        "examples": [
                            "trợ cấp an ninh xã hội",
                            "▪ Once I’ve paid for my rent and food, most of my Social Security is used up.",
                            "▪ an increase in spending on Social Security and Medicare",
                            "Social Security benefits/payments :",
                            "trợ cấp an ninh xã hội",
                            "▪ The government faces strong opposition to its proposals to cut Social Security payments.",
                            "be/live on Social Security",
                            "sống nhờ vàotrợ cấp an ninh xã hội",
                            "▪ How’d you find it, living on Social Security?",
                            "Social Security number : số an ninh xã hội",
                            "▪ Can you write your Social Security number in the box please?",
                            "Social Security trợ cấp an sinh xã hội",
                            "USa system of payments made by the government to old people, people whose husbandsor wives have died and people who are unable to work because they are ill",
                            "social securitynoun[ U ]trợ cấp an sinh xã hội",
                            "UKa system of payments made by the government to people who are ill, poor or who have no job",
                            "_He'sonsocial security."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "benefit",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable/uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "usuallybenefitsAmerican /ˈbenɪfɪt(s), ˈbenəfɪt(s)/  money that people receive from thegovernmentif they have no job, do not earn a lot, or are sick:",
                        "examples": [
                            "trợ cấp ( từ chính phủ )",
                            "▪ There are several benefits you can claim if you are unemployed.",
                            "▪ You should find out about any benefits you’re entitled to.",
                            "housing benefit",
                            "phúc lợi nhà ở",
                            "regular payments towards your rent",
                            "▪ Surely she’ll be eligible for housing benefit?",
                            "unemployment benefit",
                            "trợ cấp thất nghiệp",
                            "regular payments to people who do not have a job",
                            "▪ If you were fired from your previous job, you may not be able to claim unemployment benefit.",
                            "child benefit : trợ cấp nuôi con",
                            "British regular payments made to mothers of children under 16",
                            "▪ Child benefit has been frozen for the last three or four years.",
                            "be/live on benefit",
                            "sống nhờ trợ cấp",
                            "British",
                            "▪ Two-thirds of lone parents are on benefit.",
                            "benefitnoun[ C or U ]tiền trợ cấp",
                            "the money given by the government to people who need financial help, for example because they cannot find a job",
                            "_mainlyUKunemploymentbenefit",
                            "_I'monbenefit at the moment.",
                            "child benefitnoun[ U ]UKtrợ cấp nuôi con",
                            "money received regularly by families from the government to help pay for the costs of looking after children",
                            "sickness benefitnoun[ U ]UK trợ cấp ốm đau",
                            "money paid by the government to someone who cannot work because of illness",
                            "unemployment benefitnoun[ U ]trợ cấp thất nghiệp, lương thất nghiệp",
                            "(USunemployment benefits)old-fashioned for",
                            "Jobseeker's Allowance"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "welfare",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈwelfeəʳ/  American the money that is paid by the government to people without jobs:",
                        "examples": [
                            "trợ cấp thất nghiệp",
                            "▪ The amount of money that the government spends on welfare has halved in the past decade.",
                            "▪ Getting people off welfare and into paying jobs is a major national priority.",
                            "welfare benefits/payments",
                            "trợ cấp thất nghiệp",
                            "▪ Annabelle stopped getting welfare benefits when her husband landed a minimum-wage job.",
                            "be/live on welfare",
                            "sống nhờtrợ cấp thất nghiệp",
                            "to be receiving money from the government",
                            "▪ Raising the minimum wage might make it more difficult for people on welfare to get a job",
                            "welfarenoun[ U ]HELP",
                            "help given, especially by the state or an organization, to people who need it, especially because they do not have enough money",
                            "_This national fund pays for welfarebenefitssuch as unemployment and sickness pay.",
                            "_UKAfter her month's sick leave, she was summoned to see the company's welfareofficer."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "pocket money",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "British /allowanceAmerican /ˈpɒkɪt ˌmʌni, ˈpɒkət ˌmʌniǁˈpɑː-, əˈlaʊəns/  a small amount of money thatchildren receive from their parents every week:",
                        "examples": [
                            "tiền trợ cấp ( từ bố mẹ )",
                            "▪ What do you spend your allowance on, Jimmy?",
                            "▪ You’ll pay for that vase out of your pocket money.",
                            "pocket moneynoun[ U ]CHILD'S MONEYsố tiền mà cha mẹ cho con hàng tháng; tiền trợ cấp",
                            "mainlyUK(USallowance)an amount of money which parents regularly give to their child to spend as they choose",
                            "_My mum gives me £5 a week pocket money."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "general",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "subsidy",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈsʌbsɪdi, ˈsʌbsədi/  money that thegovernmentprovides to help abusinessorindustrywhich might not be able to operate without this additional money:",
                        "examples": [
                            "tiền trợ cấp ( cho doanh nghiệp, công nghiệp )",
                            "▪ The taskforce has recommended some kind of subsidy to help businesses get their Internet start-ups off the ground.",
                            "▪ Lacking the generous subsidies that European orchestras receive, modern American groups are under increasing pressure to play popular pieces.",
                            "state/federal/government/public subsidy",
                            "tiền trợ cấp nhà nước/liên bang/chính phủ/công",
                            "▪ Without state subsidies, the railways couldn’t survive.",
                            "▪ Federal subsidies would be available to help employers pay the insurance premiums.",
                            "▪ They built and financed a whole new suburb, and they did it without a public subsidy.",
                            "agricultural/farm subsidy",
                            "tiền trợ cấp nông nghiệp",
                            "▪ US farmers are having trouble coping with the reductions in agricultural subsidies.",
                            "▪ Farm subsidies totaled $53 billion last year.",
                            "subsidynoun[ C ]tiền trợ cấp( để thúc đẩy ngành nào đó )",
                            "money given as part of the cost of something, to help or encourage it to happen",
                            "_The company received a substantial government subsidy.",
                            "_The government is planning to abolish subsidiestofarmers."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "grant",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "an amount of money that a government or other organization gives to someone to help pay for something good or useful, such as their education:trợ cấp",
                        "examples": [
                            "These grants will help communities address the problems faced by young people.",
                            "The university gets a government grant."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "a research grant",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "He received a research grant to study the effect of pollution on the environment."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "a block grantAmerican English",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "money given by the central government to state governments in order to pay for services such as the police, roads etc",
                                "examples": [
                                    "Congress approved block grants for education, health, and social services."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "apply for a grant",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "We could apply for a grant and start a serious research programme."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "be eligible for a grant",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "be allowed to receive a grant",
                                "examples": [
                                    "This booklet explains who is eligible to receive a grant."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "get/obtain a grant",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "You may be able to get a grant to learn a trade."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "receive a grant",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "It is likely that you will receive a grant to cover your tuition."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "give/award somebody a grant",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "If you have been awarded a grant, you must send the details to the university."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "be funded by a grant",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "The expansion of the computer department was funded by a government grant."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "grant of £5,000, $8,000 etc",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "The library received a grant of $20,000 to improve its computer facilities."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "grant from",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "These studios are funded by a grant from the Kress Foundation."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "development grantmoney that a government gives to a country or a city to help pay for economic development in a particular area",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "The building was converted into flats with the aid of an urban development grant.",
                                    "Most regions in Spain and Portugal qualify for sizeable development grants from the EU."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "government/state/federal grant",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "Researchers at the University of San Francisco will receive a $6.7 million federal grant for research on ovarian cancer."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "block grantmoney that the central government gives to local government to help pay for roads, police, schools etctrợ cấp trọn gói",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "Our role is to decide how the block grant should be allocated."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "grant proposala special form that you fill in when you ask for a grant",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "Jen was up all night writing her grant proposal."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "uncategoried",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "claim",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "usage": "",
                        "region": "",
                        "definition": "verbDEMAND đòi;",
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]