[
    {
        "id": "",
        "name": "lack of sexual activity",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "when sb does not have sex",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "virgin",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈvɜːʳdʒɪn, ˈvɜːʳdʒən/  someone who has never had sex:",
                        "examples": [
                            "Người còn trinh",
                            "▪ Some men will not marry a woman who is no longer a virgin.",
                            "Một số đàn ông sẽ không cưới một người phụ nữ không còn là một trinh nữ.",
                            "▪ At 27 he was still a virgin and very shy about it.",
                            "Ở tuổi 27, anh ta vẫn còn trinh và rất nhút nhát.",
                            "virginity/vɜːʳˈdʒɪnɪti, vɜːʳˈdʒɪnəti/ [uncountable noun]sự trinh bạch",
                            "▪ Women in some countries are expected to keep their virginity until marriage - the same rule doesn’t apply to men.",
                            "Phụ nữ ở một số nước được mong đợi giữ trinh tiết cho đến khi kết hôn - quy tắc tương tự lại không áp dụng đối với nam giới.",
                            "virginnoun[ C ]gái trinh;trinh nữ",
                            "someone who has never had sex",
                            "_She remained a virgin till she was over thirty.",
                            "_D'you think he's still a virgin?",
                            "virginitynoun[ U ]sự trong trắng, sự trinh bạch; trạng thái còn trinh tiết",
                            "_Shelosther virginity at the age of sixteentothe boy next door."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "celibate",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈselɪbət, ˈseləbət/  someone who iscelibatehas chosen not to have sex at all, especially forreligiousreasons:",
                        "examples": [
                            "độc thân",
                            "▪ He had remained celibate for three years before he met Hannah.",
                            "Ông vẫn sống độc thân trong ba năm trước khi gặp Hannah.",
                            "▪ She was not prepared for a celibate life in the Church.",
                            "Cô ấy không được chuẩn bị cho một cuộc sống độc thân trong Giáo Hội.",
                            "celibacy[uncountable noun]sự độc thân",
                            "▪ He had taken a vow of celibacy promised to remain celibate at eighteen, when he became a priest.",
                            "Ông đã tuyên thệ độc thân hứa sẽ sống độc thân lúc mười tám tuổi, khi ông trở thành linh mục.",
                            "celibateadjective không có quanhệ tình dụclý do (tôn giáo)",
                            "not having sexual activity, especially because of making a religious promise to do this",
                            "celibatenoun[ C ]formalkhông có quan hệ tình dục",
                            "a person who does not have sex"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "platonic",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/pləˈtɒnɪkǁ-ˈtɑː-/  aplatonicrelationship is one between people who do not have sex with each other, but are just friends - use this especially whenotherpeoplethinkthey are having a sexual relationship :",
                        "examples": [
                            "thuần khiết ( nói về một mối quan hệ )",
                            "▪ Their relationship was strictly platonic, even though she was living in his apartment",
                            "Mối quan hệ của họ rất thuần khiết, dù cô ấy sống trong căn hộ của mình.",
                            "▪ In the novel, Edward and Susannah present a perfect model of platonic love.",
                            "Trong cuốn tiểu thuyết, Edward và Susannah thể hiện một kiểu mẫu tình yêu thuần khiết hoàn hảo."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be just (good) friends U",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "be just (good) friends/biː ˌdʒʌst (gʊd) ˈfrendz/  use this to say that two people are not having a sexual relationship:",
                        "examples": [
                            "chỉ là bạn (tốt)",
                            "▪ ‘Are you going out with Liam?’ ‘No, we’re just good friends.’",
                            "'Bạn có đi chơi với Liam không?' 'Không, chúng tôi chỉ là những người bạn tốt.'",
                            "▪ I keep telling my mother that Peter and I are just friends but she doesn’t seem to believe me.",
                            "Tôi luôn nói với mẹ tôi rằng Peter và tôi chỉ là những người bạn nhưng dường như bà ấy không tin tôi."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]