[
    {
        "id": "",
        "name": "failing",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "to have the opposite effect",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "backfire",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[intransitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if a plan or action backfires, it is intended to do one thing but instead does the opposite:",
                        "examples": [
                            "đem lại kết quả ngược mong đợi",
                            "▪ His plan to get attention backfired, and instead of being promoted he lost his job.",
                            "Kế hoạch thu hút sự chú ý cho kết quả ngược lại, nên thay vì được thăng chức, ông ta mất việc.",
                            "backfire on",
                            "đem lại kết quả ngược mong đợi trong việc",
                            "▪ Trying to make your partner jealous by flirting with other people can easily backfire on you",
                            "Cố gắng làm cho vợ hoặc chồng của bạn ghen bằng cách tán tỉnh người khác có thể có tác dụng ngược lại."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "self-defeating",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "an action or plan that is self-defeating is not well planned or is badly done, so that it produces the opposite effect from the one intended: thất sách",
                        "examples": [
                            "▪ Taxing poor people to pay for hospitals is always self- defeating.",
                            "▪ Attempts to stir up nationalistic feeling at such times are bound to be self-defeating."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "counterproductive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[usually non-attri]",
                        "usage": "",
                        "region": "",
                        "definition": "intended to make something better, but actually making it worse: phản tác dụng",
                        "examples": [
                            "▪ Putting very young offenders in prison can be counterproductive.",
                            "▪ Constant correction by a teacher is often counterproductive, as the student may become afraid to speak at all."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "when sb fails",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "fail",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[intransitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "▪ We tried to make her change her mind, but we failed.",
                            "fail to do something",
                            "▪ I failed to convince him that I was right.",
                            "▪ Having failed to find her friend, she decided to return home.",
                            "fail completely",
                            "▪ If they were trying to put us out of business, they have failed completely.",
                            "fail miserablyfail completely, in a way that is embarrassing",
                            "▪ Millions of people have tried to quit smoking and failed miserably"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "not make it",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[]",
                        "usage": "[informal]",
                        "region": "",
                        "definition": "to fail in your job, especially because you do not earn a lot of money or do not become well known and respected: không đạt được, thất bại",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "not make it as",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ No one was surprised when he didn’t make it as a rock star."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "not make it in",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ She soon realized she’d never make it in the cut-throat world of journalism."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "for nothing",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "if all your work, preparation etc is for nothing, you have tried to achieve something and spent a lot of time on it, but failed:",
                        "examples": [
                            "▪ If we don’t get the contract all our hard work will have been for nothing.",
                            "▪ I don’t want to struggle all my life for nothing."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "draw a blank",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "British/come up empty-handedAmerican  informal fail to find or discover information or a person or thing you are looking for: không được gì, trắng tay",
                        "examples": [
                            "▪ Once again police investigators have drawn a blank.",
                            "▪ The private detective she hired to look for him had come up empty-handed."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "certain to fail",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "pointless",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "something that is pointless is unlikely to have a very useful or successful result, so it would be better not to do it or try it:",
                        "examples": [
                            "vô nghĩa",
                            "▪ The argument was completely pointless.",
                            "Lập luận hoàn toàn vô nghĩa.",
                            "▪ Most people think the project is a pointless waste of money.",
                            "Hầu hết mọi người nghĩ rằng dự án là một sự lãng phí tiền vô nghĩa.",
                            "pointless exercise",
                            "bài tập vô nghĩa",
                            "▪ Speculating like that was always a pointless exercise, but he did it nevertheless.",
                            "Cách suy nghĩ như thế luôn là một bài tập vô nghĩa, dù vậy anh ta vẫn làm.",
                            "it is pointless to do something",
                            "làm cái gì là vô nghĩa",
                            "▪ It’s pointless to take notes and then never look at them again.",
                            "Ghi chép rồi không bao giờ xem lại thì thật là vô nghĩa.",
                            "it is pointless doing something",
                            "làm cái gì là vô nghĩa",
                            "▪ She decided it was pointless trying to work while her mind was on other things.",
                            "Cô nghĩ rằng cố gắng làm việc trong khi tâm trí để đâu đâu là vô nghĩa."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be a waste of time",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "especiallyspokensomething that is a waste of time is unlikely to achieve any useful result, so you would be wasting your time if you tried to do it:",
                        "examples": [
                            "tốn thời gian",
                            "▪ Many people think that complaining about bad service is a waste of time.",
                            "Nhiều người nghĩ rằng phàn nàn về dịch vụ kém là một sự lãng phí thời gian.",
                            "a complete/total waste of time",
                            "hoàn toàn lãng phí thời gian",
                            "▪ These meetings are a complete waste of time. Nothing ever gets decided.",
                            "Những cuộc họp như này hoàn toàn là một sự lãng phí thời gian. Không bao giờ quyết định được gì.",
                            "it is a waste of time doing something",
                            "nó là tốn thời gian làm chuyện gì",
                            "▪ It’s a waste of time going to the doctor - he’ll just tell you to get plenty of rest.",
                            "Đi gặp bác sĩ rất tốn thời gian - ông ta sẽ chỉ bảo bạn nghỉ ngơi thật nhiều."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "there’s no point",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "",
                        "region": "",
                        "definition": "/what’s the pointspokensay this when you think that it is useless to do something because you will not achieve anything useful by doing it:",
                        "examples": [
                            "chẳng có nghĩa lýgì, chẳng có tác dụng gì",
                            "▪ ‘Why don’t you try to explain things to him?’ ‘There’s no point, he never listens.’",
                            "'Sao anh không cố giải thích?' 'Chẳng có nghĩa lý gì, anh ta có thèm nghe đâu.\"",
                            "▪ I was going to buy a new car, but what’s the point when my old one’s perfectly all right?",
                            "Tôi định mua một chiếc xe mới, nhưng có ích gì khi xe cũ vẫn chạy tốt?",
                            "there’s no point (in) doing something",
                            "không có ích gì trong việc",
                            "▪ There’s no point getting a new carpet until the decorating’s done.",
                            "Không có ích gì khi nhận được tấm thảm mới khi mọi trang trí đã hoàn tất.",
                            "what’s the point in/of doing something?",
                            "Làm việc gì thì có ích gì?",
                            "▪ What’s the point of giving a signal when there are no other cars around to see it?",
                            "Phát tín hiệu khi không có xe nào xung quanh thì có ích gì?"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "doomed",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "not having any chance at all of succeeding:",
                        "examples": [
                            "thất bại",
                            "▪ Attempts to clean up the environment are doomed unless businesses take a leading role.",
                            "Những nỗ lực làm sạch môi trường sẽ thất bại trừ khi các doanh nghiệp giữ vai trò dẫn đầu.",
                            "▪ Within a few months she realized that her marriage was doomed.",
                            "Chỉ trong vài tháng cô ấy đã nhận ra cuộc hôn nhân của mình đã thất bại.",
                            "doomed to failure",
                            "thất bại",
                            "▪ If you refuse to provide any information to the user, then your computer program is doomed to failure.",
                            "Nếu bạn không cung cấp được bất kỳ thông tin nào cho người dùng thì phần mềm của bạn đã thất bại.",
                            "doomed from the start",
                            "thất bại từ lúc bắt đầu",
                            "▪ Their business venture was doomed from the start, as they did not have the necessary capital.",
                            "Dự an kinh doanh của họ đã thất bại ngay từ đầu vì không có vốn cần thiết."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "lost cause",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "something that you try to make successful, although it seems very clear to other people that it cannot succeed:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "cố gắng vô ích",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ At first it seemed the attempt to save the species was a lost cause.",
                                    "Những nỗ lực ban đầu để giải cứu giống loài dường như là những cố gắng vô ích.",
                                    "▪ The miners’ strike of 1984 turned out to be a lost cause.",
                                    "Cuộc đình công của những thợ mỏ năm 1984 hóa ra là những cố gắng vô ích."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "non-starter",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "British an idea or plan that will definitely not be successful:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "chuyện viễn vông",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Everybody would prefer a lower rate of tax, but that that is a non-starter economically.",
                                    "Mọi người đều muốn một mức thuế thấp hơn, nhưng đó chỉ là chuyện viễn vông về mặt kinh tế."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "▪ The project would have been a non-starter without the help of Judith Glyn",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "Dự án này sẽ là chuyện viễn vông nếu không có sự trợ giúp của Judith Glyn."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "when a plan or attempt fails",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "not succeed",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to fail:",
                        "examples": [
                            "thất bại, không thành công",
                            "▪ Hoover’s attempts to boost the economy did not succeed.",
                            "Những nỗ lực của Hoover để thúc đẩy nền kinh tế đã không thành công.",
                            "▪ I argued that neither strategy could succeed.",
                            "Tôi cho rằng không chiến lược nào không thành công.",
                            "not succeed in doing something",
                            "không thành công trong việc làm gì",
                            "▪ The campaign might not succeed in eliminating the disease, but it would make people think about health and hygiene.",
                            "Chiến dịch có thể không thành công trong việc loại bỏ căn bệnh, nhưng nó sẽ làm cho mọi người nghĩ về sức khoẻ và vệ sinh."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "fail",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[intransitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if a plan or attempt fails, it does not achieve what you want it to achieve:",
                        "examples": [
                            "thất bại",
                            "▪ They said the latest space mission was bound to fail.",
                            "Họ nói rằng nhiệm vụ không gian mới chắc chắn sẽ thất bại.",
                            "▪ Try changing the spark plugs, but if that fails take the car to a mechanic.",
                            "Hãy thử thay bugi, nếu không được thì đưa xe đến thợ máy.",
                            "fail to do something",
                            "thất bại để làm gì",
                            "▪ The investigation failed to establish the cause of the accident",
                            "Cuộc điều tra đã thất bại trong việc xác định nguyên nhân gây ra tai nạn..",
                            "something never fails",
                            "chưa bao giờ thất bại",
                            "▪ The only way I can make her help me is to pretend I don’t want her help. It never fails.",
                            "Cách duy nhất để làm cô ấy giúp tôi là tôi giả vờ không muốn giúp đỡ. Nó chưa bao giờ thất bại."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be a failure",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to be unsuccessful - use this especially about something that fails even though it was verycarefullyplanned:",
                        "examples": [
                            "là một thất bại",
                            "▪ The government’s expensive election campaign had been a failure",
                            "Chiến dịch bầu cử tốn kém của chính phủ đã thất bại..",
                            "be a complete/total failure",
                            "thất bại hoàn toàn",
                            "▪ There was a 5-year plan to modernize the economy, but it was a complete failure.",
                            "Đã có một kế hoạch 5 năm để hiện đại hóa nền kinh tế, nhưng đó là một sự thất bại hoàn toàn."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "go wrong",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "if a plannedattemptto do something goes wrong, it failsafter it has started well:",
                        "examples": [
                            "mắc sai lầm, thất bại",
                            "▪ The experiment went wrong when the chemicals combined to form a poisonous gas.",
                            "Thí nghiệm đã thất bại khi các hóa chất kết hợp tạo thành khí độc.",
                            "go badly wrongBritish fail completely",
                            "thất bại hoàn toàn",
                            "▪ The rescue attempt went badly wrong when the building collapsed",
                            "Nỗ lực giải cứu đã thất bại hoàn toàn khi tòa nhà sụp đổ.."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "not work",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "if amethodorattemptdoes not work, it fails because it is notsuitableor not right for the situation you are in:",
                        "examples": [
                            "không có hiệu quả",
                            "▪I tried to fix it with glue, but that didn’t work.",
                            "Tôi đã cố gắng sửa nó bằng keo, nhưng không hiệu quả.",
                            "not work with",
                            "không có hiệu quả với",
                            "▪ Teaching methods that work with adults do not always work with children",
                            "Phương pháp giảng dạy có hiệu quả với người lớn không phải lúc nào cũng hiệu quả với trẻ em."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "do no good",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "if something you do to try to help or deal with a problem does no good, it does not have any useful effect:",
                        "examples": [
                            "chẳng ích gì",
                            "▪ Calm down Robyn. Getting hysterical will do no good.",
                            "Bình tĩnh đi Robyn. Kích động chẳng được gì.",
                            "▪ You can try and persuade her to change her mind, but I don’t think it’ll do any good.",
                            "Bạn có thể thử và thuyết phục cô ấy đổi ý, nhưng tôi nghĩ nó chẳng để làm gì.",
                            "do no good whatsoeverhave no useful effect at all",
                            "chẳng có lợi gì",
                            "▪ Judges expect a certain level of competence, so staging a little-girl-lost act in court will do no good whatsoever.",
                            "Các thẩm phán mong đợi một mức độ thẩm quyền nhất định, vậy nên việc đưa ra một đạo luật về các bé gái mất tích sẽ chẳng được lợi gì."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "fall through",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[intransitive phrasal verb not in progressive]",
                        "usage": "",
                        "region": "",
                        "definition": "if a plan, arrangement, or deal falls through, something stops it from happening, with the result that people are disappointed:",
                        "examples": [
                            "thất bại, không đi đến kết quả nào",
                            "▪ The deal fell through because they couldn’t get enough money from the bank",
                            "Thỏa thuận đã thất bại vì họ không có đủ tiền từ ngân hàng..",
                            "▪ It was unbelievable -- it took two years to set the whole thing up and it fell through at the last minute!",
                            "Không thể tin được - mất hai năm để hoàn thành công việc mà nó lại thất bại vào phút chót!"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "when a relationship or marriage fails",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "fail",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[intransitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "thất bại",
                            "▪ If your marriage fails it can be difficult to make a new start in life.",
                            "Nếu hôn nhân của bạn thất bại thì rất khó để bắt đầu một cuộc sống mới.",
                            "▪ She was trapped in a failing relationship.",
                            "Cô đã bị mắc kẹt trong một mối quan hệ thất bại.",
                            "failed[adjective only before noun]",
                            "thất bại",
                            "▪ He was 50, in bad health and with two failed marriages behind him.",
                            "Ông 50 tuổi, với bệnh tật và hai cuộc hôn nhân thất bại."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "go wrong",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "British if a marriage or other relationship goes wrong, or something about it goes wrong, something happens or changes to make it fail after it had started well:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "gặp rắc rối, mắc sai lầm",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ It was soon after the birth of their first child that their relationship started to go wrong.",
                                    "Ngay sau khi đứa trẻ chào đời, mối quan hệ của họ bắt đầu gặp rắc rối.",
                                    "▪ Only the two of you know what went wrong.",
                                    "Chỉ có hai người biết những gì đã xảy ra."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "be on the rocks",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[]",
                        "usage": "[informal]",
                        "region": "",
                        "definition": "if a marriage is on the rocks, it is in difficulties and likely to fail:",
                        "examples": [
                            "▪ There had been signs that their marriage was on the rocks for years."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "uncategoried",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "fall apart c2",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "",
                        "region": "",
                        "definition": "fall apartphrasal verbSTOP WORKING",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "If an organization, system or agreement falls apart, it fails or stops working effectively",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_The deal fell apart because of a lack of financing.",
                                    "_Their marriage fell apart when she found out about her husband's affair."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "so much for",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "usage": "",
                        "region": "",
                        "definition": "sth",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "used to express disappointment and anger at the fact that a situation is not as you thought it was",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_The car's broken down again. So much for our trip to the seaside."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "take a turn for",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "usage": "",
                        "region": "",
                        "definition": "the better/worse",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "to suddenly become better or worse",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_Their relationship took a turn for the worse when he lost his job."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "fall short",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "usage": "",
                        "region": "",
                        "definition": "to fail to reach an amount or standard that was expected or hoped for, causing disappointment",
                        "examples": [
                            "_August car sales fell shortofthe industry's expectations."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "fall flat",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "usage": "",
                        "region": "",
                        "definition": "If a joke, idea or suggestion falls flat, it does not have the intended effect",
                        "examples": [
                            "_He made several jokes and each of them fell flat."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "uncategorized",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "not getting anywhere",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[VP]",
                        "usage": "",
                        "region": "",
                        "definition": "not getting /going anywhere informal if you are not getting/ going anywhere, you are not improving or advancing a particular situation: chẳng đi đến đâu cả",
                        "examples": [
                            "I've been sorting out my study all day, but it's such a mess I don't feel I'm getting anywhere.",
                            "He’s a nice enough lad, but he’s not going anywhere."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]