[
    {
        "id": "",
        "name": "using the eyes in general",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "sth that you see",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "sight",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[countable/uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "something that you see, or when you see something:",
                        "examples": [
                            "tầm nhìn",
                            "▪ Sunrise over the Himalayas is a magnificent sight.",
                            "▪ It was a sight so awe-inspiring we could have stayed for hours.",
                            "the sight of something : nhìn thấy cái gì",
                            "when you see something",
                            "▪ I can’t stand the sight of blood.",
                            "at the sight of something: cái gì trong tầm nhìn",
                            "▪ Even Charles cheered up at the sight of the food.",
                            "(at) first sight: cái nhìn đầu tiên",
                            "the first time you see someone or something",
                            "▪ When I met my husband, it was love at first sight.",
                            "▪ It was our first sight of land after 15 months at sea.",
                            "on sight : ngay khi thấy ai",
                            "as soon as you see someone or something",
                            "▪ The superintendent issued orders to shoot looters and arsonists on sight.",
                            "a familiar/common sight : tầm nhìn quen thuộc",
                            "something that you often see",
                            "▪ Homeless kids are now a familiar sight on London’s streets.",
                            "a sorry sightsomeone or something that makes you feel sad or sympathetic: cái nhìn thương hại",
                            "▪ Gavin looked a sorry sight -- his jaw was broken, and he had a black eye.",
                            "quite a sight : khá là đẹp/ấn tượng",
                            "used to emphasize how impressive, beautiful, funny etc something looks",
                            "▪ We looked at the huge crowd gathering below us. ‘It’s quite a sight, isn’t it?’",
                            "sightnounVIEW",
                            "[ C or S or U ] something that is in someone's view",
                            "_The flowers at the annual flower show were a beautiful sight.",
                            "_You should alwayskeepsightofyour bags (= have them where you can see them) while you're at the airport.",
                            "_informalYou can't go out in those clothes - you looka realsight (= look untidy or silly) !",
                            "_The child laughedat thesightof(= when she saw) the clockwork toy.",
                            "_formalThe lawyer requested sightof(= to see) the papers.",
                            "_I dare not let the childrenout ofmy sight (= go where I cannot see them) in this park.",
                            "_The police officer was hiddenout ofsight (= where he could not be seen) behind a tree.",
                            "_The castle cameintosight (= started to be able to be seen) as we went round a bend in the road.",
                            "_We're looking for a house which iswithinsightof",
                            "(= from which it is possible to see) the mountains.",
                            "_figurativeAfter three years of campaigning, the end is finallyinsight (= will happen soon) for Jon.",
                            "_Icaughtsightof(= saw for a moment) my former teacher while I was out shopping today, but she turned a corner and Ilostsight of (= could no longer see) her.",
                            "_\"Do you know David Wilson?\" \"I haven't met him, but I know himbysight (= I recognize him, but do not know him) .\"",
                            "_informalShe hated/loathedthesightof(= hated) her former husband.",
                            "_informalThey used to be very good friends, but now theycan't bear/stand thesightof(= hate) each other.",
                            "_The question seemed easyat firstsight (= when they first saw it) , but when the students tried to answer it, they discovered how difficult it was."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "spectacle",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun usually singular]",
                        "usage": "",
                        "region": "",
                        "definition": "something that you see that is very surprising, strange, or shocking:",
                        "examples": [
                            "cảnh tượng",
                            "the spectacle of: cảnh tượng của",
                            "▪ Visitors to London are often shocked by the spectacle of people begging in the streets.",
                            "a strange/bizarre/tragic etc spectacle: cảnh tượng kì lạ /kì quặc/kinh hoàng",
                            "▪ The sight of European tourists dancing in grass skirts made a bizarre spectacle.",
                            "make a spectacle of yourself : làm gì đó ngớ ngẩn trước nhiều người",
                            "to do something silly, surprising, or shocking when a lot of people can see you",
                            "▪ She knew she was making a spectacle of herself with her childish outburst, but she couldn’t seem to help herself."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "visual",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adjective usually before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "designed to be seen or having a particular effect when seen: thị giác",
                        "examples": [
                            "▪ The movie is greatly enhanced by its stunning visual effects.",
                            "▪ Teachers have been using visual aids in the classroom for decades.",
                            "▪ Children learn to read by interpreting visual symbols."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "unable to see",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "can’t see",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[VP]",
                        "usage": "",
                        "region": "",
                        "definition": "if you can’t see, you are unable to see things, either because there is sth wrong with your sight, or because sth is preventing you seeing clearly: không thể nhìn thấy",
                        "examples": [
                            "He makes fun of me because I can’t see that well.",
                            "It was pitch black and I couldn’t see.",
                            "You can’t see from here, but they’re out there.",
                            "That was the morning I got up, and I couldn’t see."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]