[
    {
        "id": "",
        "name": "economics and the state of the economy",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "a time when an economy is not successful",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "recession",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[countable/uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/rɪˈseʃən/  a period when a country’s economic growth stops and there is less trade, so that many companies have to reduce the number of workers they employ:",
                        "examples": [
                            "suy thoái",
                            "▪ The car industry, like most other industries, is feeling the effects of the recession.",
                            "Ngành công nghiệp ô tô, giống như hầu hết các ngành công nghiệp khác, đang cảm nhận được tác động của cuộc suy thoái kinh tế.",
                            "severe recessionvery bad recession",
                            "suy thoái nghiêm trọng",
                            "▪ In times of severe recession companies are often forced to make massive job cuts in order to survive.",
                            "Trong thời kỳ suy thoái nghiêm trọng các công ty thường bị buộc phải cắt giảm nhiều việc làm để sinh tồn.",
                            "in recessionsuffering from a recession",
                            "trong suy thoái",
                            "▪ The economy is in recession and will remain so for at least another year.",
                            "Nền kinh tế đang trong giai đoạn suy thoái và sẽ vẫn như vậy trong ít nhất một năm nữa.",
                            "recessionnoun[ C or U ]tình trạng suy thoái",
                            "a period when the economy of a country is not successful and conditions for business are bad",
                            "_The country is sliding into the depths of (a) recession."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "slump",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/slʌmp/  a period when there is a big reduction in trade so that many companies fail and a lot of people lose their jobs:",
                        "examples": [
                            "sự đình trệ",
                            "▪ The post-war slump sent the unemployment figures to twice the expected level.",
                            "Sự đình trệ sau chiến tranh khiến số người thất nghiệp tăng gấp đôi so với mức kỳ vọng.",
                            "slump in",
                            "sự sụt giảm trong",
                            "▪ The slump in the property market is making it difficult for people to sell their homes.",
                            "Sự sụt giảm trong thị trường bất động sản đang làm cho người dân khó bán được nhà."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "depression",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/dɪˈpreʃən/  a period of time continuing for several years when greatly reduced business activity severely affects a country’s economic growth, and a lot of people lose their jobs - use this especially when this affects many countries across the world:",
                        "examples": [
                            "cuộc khủng hoảng",
                            "▪ In Germany the depression in the late 1920s helped Hitler’s rise to power",
                            "Ở Đức cuộc khủng hoảng vào cuối những năm 1920 đã giúp cho Hitler lên nắm quyền.",
                            "▪ Hartnell blamed his financial difficulties on the worldwide depression.",
                            "Hartnell đổ lỗi cho những khó khăn tài chính của ông là do cuộc khủng hoảng trên toàn thế giới.",
                            "depressionnounNO ACTIVITY tình trạng trì trệ; tình trạng đình trệ",
                            "[ C ] a period in which there is very little business activity and not many jobs",
                            "_The stock market crash marked the start of a severe depression."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "crash",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/kræʃ/  a sudden and unexpected fall in the value of shares in companies, with the result that many companies have to close and a lot of people lose their jobs:",
                        "examples": [
                            "sự sụp đổ",
                            "▪ Luckily, I sold my shares just before the crash.",
                            "May mắn thay, tôi đã bán đi cổ phiếu ngay trước khi phá sản.",
                            "▪ The Wall Street Crash was disastrous for many American businessmen.",
                            "Cuộ khủng hoảng phố Wall là thảm họa đối với nhiều doanh nhân Mỹ.",
                            "stock market crashcrash in the organizations that buy and sell shares in companies",
                            "sự sụp đổ thị trường chứng khoán",
                            "▪ The stock market crash made me suspicious of those types of insurance schemes.",
                            "Sự sụp đổ thị trường chứng khoán làm tôi nghi ngờ về những chính sách bảo hiểm.",
                            "crashnoun[ C ]FAILURE sự phá sản, sự sụp đổ",
                            "when the value of a country's businesses suddenly falls by a large amount",
                            "_They lost a lot of money in the Stock Market crash."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "connected with the way that money is use",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "financial",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/fɪˈnænʃəl, fəˈnænʃəl, faɪ-/  connected with money - use this aboutthe waythat people and organizations use and control their money:",
                        "examples": [
                            "tài chính",
                            "▪ Wall Street is the financial center of the US.",
                            "▪ There is a possibility of a full-scale financial crisis, like the great crash of 1929",
                            "▪ Many libraries have found that their financial resources are stretched to the limit.",
                            "▪ The accounts show that the school’s financial position is very healthy.",
                            "financial support/backing/assistance etc: nguồn tài chính",
                            "▪ He failed to get financial support from his employers.",
                            "▪ The amount of financial aid offered has become more central to students’ decisions about which school to attend.",
                            "financial dealings/transactions : vấn đề/ giao dịch tài chính",
                            "▪ Revelations about his financial dealings could change his election prospects dramatically.",
                            "▪ He developed computer software to handle complicated financial transactions.",
                            "financial difficulties/problems; vấn đề tài chính",
                            "▪ Joan has a lot of financial problems at the moment.",
                            "▪ Mexico’s financial difficulties increased rather than diminished.",
                            "financial yearBritish the 12-month period used by companies to calculate their accounts : năm tài chính",
                            "▪ Norton have announced profits of £3.5 million for the financial year 2000-01.",
                            "financially[adverb]tài chính",
                            "▪ She wanted to go out to work and be financially independent",
                            "▪ Who would benefit financially from Bobby’s death?",
                            "▪ His parents support him financially.",
                            "financialadjective thuộc về tài chính",
                            "relating to money or how money is managed",
                            "_financial difficulties/success",
                            "_a financial adviser",
                            "_financial affairs"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "economic",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌekəˈnɒmɪk◂, ˌiː-ǁ-ˈnɑː-/  connected with the way money is earned, spent, and controlled within acountryorsociety:",
                        "examples": [
                            "kinh tế",
                            "▪ The tax breaks will stimulate economic activity.",
                            "▪ Florida will benefit from a number of economic trends that play to its strengths.",
                            "economic climategeneral state of the economy :tình hình kinh tế",
                            "▪ In this kind of economic climate, employees prefer a lower salary in a job that is secure.",
                            "economic crisis; khủng hoảng kinh tế",
                            "▪ Cuba is emerging from five years of economic crisis.",
                            "▪ Investors took their money elsewhere, prompting a far-reaching economic crisis.",
                            "economic growth/development etc : sự tăng trưởng kinh tế",
                            "▪ Slow economic growth and low consumer spending affected sales last year.",
                            "▪ a wide variety of economic development strategies",
                            "economic recovery; sự phục hồi kinh tế",
                            "▪ Investors are holding out from Mexican stocks until they see clear signs of an economic recovery.",
                            "economic sanctionsofficial laws that stop trade with another country, for political reasons :trừng phạt kinh tế",
                            "▪ The US has maintained tough economic sanctions on Cuba.",
                            "economic summitan important meeting for the leaders of countries to discuss the world’s economy : hội nghị kinh tế cấp cao",
                            "▪ World leaders gathered in the Miyako Hotel to map out the agenda for next month’s economic summit.",
                            "economicadjectiveCOUNTRY'S ECONOMY",
                            "liên quan đến thương mại và công nghiệptài chính",
                            "[ before noun ]relating to trade, industry and money",
                            "_The country has been in a very poor economic stateever since the decline of its two major industries.",
                            "_The government's economicpolicieshave led us into the worst recession for years."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "economics",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌekəˈnɒmɪks, ˌiː-ǁ-ˈnɑː-/  the study of how money is earned, spent, and controlled within a country or society :",
                        "examples": [
                            "ngành kinh tế, kinh tế học",
                            "▪ He studied economics at Harvard University.",
                            "▪ He knows very little about economics or international finance.",
                            "▪ Keynes’s theories have had an important influence on modern economics.",
                            "economicsnoun[ U ] ngànhkinh tế",
                            "the way in which trade, industry or money is organized, or the study of this",
                            "_Their ideas sound fine in principle but they haven't worked out the economics behind the policies.",
                            "_She's in her third year of economics atYorkUniversity."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "finance",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈfaɪnæns, fˈnænsǁfˈnæns, ˈfaɪnæns/  all the activities that are related to how a company or country uses or organizes its money:tài chính",
                        "examples": [
                            "▪ He was an expert in finance and advised people where to invest their money.",
                            "▪ The use of IT in areas such as accounting and finance has grown at an astonishing rate.",
                            "▪ She works as a director of finance for an oil company.",
                            "finance minister/officer etc",
                            "thủ tướng/nhân viên... tài chính",
                            "▪ Kubo is slated to become Japan’s next finance minister.",
                            "high finance",
                            "tài chính cao cấp",
                            "financial activities involving countries or big companies -- used especially to show that you do not know very much about those activities",
                            "▪ The other guys in the office were ten to fifteen years my senior, and old hands in high finance.",
                            "financenoun tài chính",
                            "[ U ] the management of a supply of money",
                            "_corporate/personal/public finance",
                            "_the minister of finance/the finance minister",
                            "_You need to speak to someone in the financedepartment.",
                            "_The financecommitteecontrols the school's budget."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "monetary",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈmʌnɪtəri, ˈmʌnətəriǁˈmɑːnteri/  relating to or involving money, especially the money that is available to the government of a country, and how it decides to spend it:tiền tệ",
                        "examples": [
                            "▪ There’s only one conclusion to make about this data on monetary growth.",
                            "monetary policy/control etc",
                            "chính sách/kiểm soát... tiền tệ",
                            "▪ The IMF should not dictate how Mexico should run its monetary policies.",
                            "▪ a plan to introduce monetary reform",
                            "▪ Some economists question the effectiveness of monetary control as a means of regulating the economy.",
                            "▪ European monetary union",
                            "monetaryadjective(thuộc) tiền tệ",
                            "relating to the money in a country",
                            "_monetarypolicy",
                            "_monetarycontrol",
                            "_The monetary unit of theUKis the pound."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "fiscal",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈfɪskəl/  formal connected with money, taxes, debts, etc that are owned and managed by the government:tài chính",
                        "examples": [
                            "▪ Perez stated that the current fiscal crisis was the result of the collapse of the oil industry.",
                            "▪ It was thought that skillful monetary and fiscal intervention could rescue the economy.",
                            "fiscal policy",
                            "chính sáchtài chính",
                            "▪ The Council of Finances determined fiscal policy within the region.",
                            "fiscal deficit",
                            "hao hụttài chính",
                            "▪ Columbia’s fiscal deficit could soar to 1.6 percent of GDP.",
                            "fiscal year",
                            "nămtài chính",
                            "especially American the 12-month period used by companies to calculate their accounts",
                            "▪ Over the past fiscal year, the school has received $250 million in federal dollars for 1,600 projects.",
                            "fiscally[adverb]tài chính",
                            "▪ countries with fiscally sound well-managed economies",
                            "▪ The President is pro-business and fiscally conservative."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "uncategroried",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "economist",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[ C ]",
                        "usage": "",
                        "region": "",
                        "definition": "noun nhà kinh tế học",
                        "examples": [
                            "a person who studies or has a special knowledge of economics"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "inflation",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[ U ]",
                        "usage": "",
                        "region": "",
                        "definition": "nounsự lạm phát",
                        "examples": [
                            "a general, continuous increase in prices",
                            "_high/low inflation",
                            "_the rate of inflation",
                            "_3% inflation"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "standard of living",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[ C usually singular ]",
                        "usage": "",
                        "region": "",
                        "definition": "noun(alsoliving standard)mức sống",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "the amount of money and comfort people have in a particular society",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_The standard of living in many developing countries is low."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "sector",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[ C ]",
                        "usage": "",
                        "region": "",
                        "definition": "nounECONOMIC AREAkhu vực",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "one of the areas into which the economic activity of a country is divided",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_In thefinancialsector, banks and insurance companies have both lost a lot of money.",
                                    "_The new government's policy is to transfer state industries from thepublicsector to theprivatesector."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "depressed",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "usage": "",
                        "region": "",
                        "definition": "adjectiveREDUCED trì trệ; đình trệ",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "not having enough money, jobs or business activity",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "_In a depressed market, it's difficult to sell goods unless you lower your prices."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "_an economically depressed area",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "underdeveloped",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "usage": "",
                        "region": "",
                        "definition": "adjective chậm phát triển,",
                        "examples": [
                            "(especially of a country) without modern industry or modern services that provide transport, health care, etc",
                            "_an underdeveloped country",
                            "_It's in the poorer, underdeveloped eastern region of the country that the biggest problems exist."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "the financial system in a country or area",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "economy",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪˈkɒnəmiǁɪˈkɑː-/ nền kinh tế",
                        "examples": [
                            "▪ The government’s management of the economy has been severely criticized.",
                            "▪ Inflation is a major problem in many South American economies.",
                            "black/shadow economy",
                            "kinh doanh chui",
                            "business activities that take place illegally, especially in order to avoid paying tax",
                            "▪ It is impossible to quantify the exact value of the black economy.",
                            "▪ shadow economies that escape accurate analysis",
                            "global economy",
                            "nền kinh tế toàn cầu",
                            "the economy of the world, seen as whole",
                            "▪ In a global economy, the only way to maintain a competitive edge is to lead the world in innovation.",
                            "market/free-market economy",
                            "nền kinh tế thị trường/thị trường tự do",
                            "a system in which companies, rather than the government, decide what to produce and sell",
                            "▪ Poland is trying to move from a centrally planned socialist economy to a free-market capitalist economy.",
                            "economynounSYSTEM nền kinh tế",
                            "[ C ] the system of trade and industry by which thewealthof a country is made and used",
                            "_theglobaleconomy",
                            "_the German/US economy",
                            "_thestate ofthe economy",
                            "_aweak/strongeconomy",
                            "_Tourism contributes millions of pounds to the country's economy."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]