[
    {
        "id": "",
        "name": "not showing or feeling emotions",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "not showing your feelings on the face",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "expressionless",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪkˈspreʃənləs/ vô cảm",
                        "examples": [
                            "▪Oswini was watching her with expressionless eyes.",
                            "Oswini nhìn cô với đôi mắt vô cảm.",
                            "▪ Terry’s face was expressionless as he listened to the report.",
                            "Mặt Terry vô cảm khi nghe bản báo cáo.",
                            "expressionlessadjective khôngcảm xúc",
                            "not showing what someone thinks or feels",
                            "_He has such an expressionlessface/voice."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "blank",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/blæŋk/  showing no emotion, interest, or understanding in your expression, for example because you are bored, or have not been paying attention to what is being said:",
                        "examples": [
                            "trống rỗng",
                            "▪Maria could tell by the blank look in my eyes that I didn’t understand.",
                            "Maria có thể nhận ra bằng cái nhìn trống rỗng trong mắt tôi rằng tôi không hiểu.",
                            "▪ The children’s faces were blank with sleepiness.",
                            "Khuôn mặt của trẻ trống rỗng với sự buồn ngủ.",
                            "blankly[adverb]một cách ngớ ngẩn",
                            "▪Charlie looked at her blankly, and she patiently repeated everything she had said.",
                            "Charlie nhìn cô một cách ngớ ngẩn, và cô kiên nhẫn lặp lại mọi điều cô đã nói.",
                            "blankadjective NOT REACTING",
                            "không biểu lộ tình cảm, sự hiểu biết hoặc hứng thú; trống rỗng",
                            "showing no understanding or no emotion in the expression on your face",
                            "_a blankstare/expression",
                            "blanklyadverb ngây ra, không có thần",
                            "_He juststaredblankly at me."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "deadpan",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈdedpæn/  deliberately showing no humour in your expression, even though what you are saying or doing is meant as a joke:",
                        "examples": [
                            "tỉnh bơ ( khi đùa cợt )",
                            "▪ ‘We’re out of gas, so I guess you’ll have to walk home,’ he said, giving me a deadpan expression.",
                            "Chúng tôi hết xăng, vì vậy tôi đoán bạn sẽ phải đi bộ về nhà, \"anh nói một cách tỉnh bơ .",
                            "deadpan[adverb]ngây ra",
                            "▪They look at each other deadpan, and then look at me.",
                            "Họ nhìn nhau ngây ra, và rồi nhìn tôi.",
                            "deadpanadjective trơ trơ; không cảm xúc; vô cảm",
                            "looking or seeming serious when you are telling a joke",
                            "_a deadpan expression/voice"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "inscrutable",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪnˈskruːtəbəl/  someone who has an inscrutable expression shows no emotion or reaction, so it is impossible to guess what they are thinking or feeling:",
                        "examples": [
                            "bí hiểm ( không hiểu được họ nghĩ gì )",
                            "▪She looked for some response, but Jean’s expression remained inscrutable.",
                            "Cô tìm kiếm một vài phản ứng, nhưng nét mặt của Jean vẫn không thể tả nổi.",
                            "▪ The inscrutable gaze of the palace guards made me a little nervous.",
                            "Cái nhìn chằm chằm khó hiểu của những người bảo vệ cung điện làm cho tôi một chút lo lắng.",
                            "inscrutably[adverb]một cách khó hiểu",
                            "▪The man just stood there grinning inscrutably",
                            "Người đàn ông chỉ đứng đó cười toe một cách khó hiểu",
                            "inscrutableadjective bí hiểm, khó hiểu",
                            "(especially of a person or their expression) not showing emotions or thoughts and therefore very difficult to understand or get to know",
                            "_an inscrutable face/expression/smile",
                            "inscrutablyadverb bí hiểm, khó hiểu",
                            "_She smiled inscrutably.",
                            "inscrutabilitynoun[ U ] tính bí hiểm, tính khó hiểu"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "poker-faced",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈpəʊkəʳ feɪst/  someone who is poker-faced does not show at all what they are thinking or feeling, either because they do not want other people to know or because they disapprove of something:",
                        "examples": [
                            "mặt lạnh như tiền ( ko muốn thể hiện cảm xúc )",
                            "▪Not even Will Rogers could make the poker-faced President laugh.",
                            "Ngay cả Will Rogers cũng không thể làm cho vị Tổng thống với gương mặt không cảm xúc cười.",
                            "▪ Albert, normally poker faced, wore a look of shock.",
                            "Albert, thường có gương mặt không cảm xúc, đã nhìn như bị sốc.",
                            "poker-facedadjective có bộ mặt lạnh như tiền, có bộ mặt phớt tỉnh",
                            "describes someone whose face does not show what they are thinking or feeling",
                            "_She sat poker-faced all the way through the film.",
                            "poker facenoun[ C ] mặt lạnh như tiền; mặt ngây ra",
                            "_to wear/keep a poker face"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "impassive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪmˈpæsɪv/  not showing any emotion, especially in a situation where you would normally expect someone to be sad, shocked, upset, etc:",
                        "examples": [
                            "impassively[adverb]một cách bình thản",
                            "▪Adams was staring impassively at the death and destruction caused by the blast.",
                            "Adams đang nhìn một cách điềm tĩnh vào những cái chết và tàn tích của vụ nổ."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "bình thản ( khô thể hiện cảm xúc như mọi người nghĩ )",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "D",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪Russell struggled to keep an impassive face as she continued.",
                                    "Russell cố gắng để giữ một khuôn mặt trầm tĩnh khi cô tiếp tục.",
                                    "▪ The defendant remained impassive as the judge announced the guilty verdict.",
                                    "Bị cáo vẫn điềm tĩnh khi thẩm phán tuyên bố bản án có tội."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "not showing your feelings",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "unemotional U",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "unemotional/ˌʌnɪˈməʊʃənəl◂/  not showing your feelings:",
                        "examples": [
                            "không cảm xúc",
                            "▪ Police were shocked at the unemotional way the murderer described the killings.",
                            "Cảnh sát đã bị sốc bởi cách mà kẻ sát nhân mô tả các vụ giết người một cách điềm nhiên.",
                            "▪ Pat’s father was a distant, unemotional man who couldn’t really talk to his children.",
                            "Bố của Pat là một người đàn ông khó gần, lãnh đạm, là người thực sự không thể trò chuyện với con cái.",
                            "unemotionally[adverb]",
                            "một cách điềm nhiên, hững hờ",
                            "▪ The witness answered most questions unemotionally with a simple ‘yes’ or ‘no’",
                            "Nhân chứng đã trả lời hầu hết các câu hỏi một cách điềm nhiên chỉ đơn giản là \"có\" hoặc \"không\"."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "matter-of-fact",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌmætər əv ˈfækt◂/  showing no emotion when you are talking about something that is very frightening, embarrassing etc:",
                        "examples": [
                            "thản nhiên như không",
                            "▪ We were surprised at the matter-of-fact way Judith described her husband’s death.",
                            "Chúng tôi đã rất ngạc nhiên với lối mô tả thờ ơ của bà Judith về cái chết của chồng bà.",
                            "▪ A spokesman listed the casualties in a detached, matter-of-fact tone of voice.",
                            "Một phát ngôn viên đã liệt kê số thương vong với một giọng nói thản nhiên, không chút thương xót.",
                            "▪ The condom advertising campaign is going to be very straightforward and as matter-of-fact as possible.",
                            "Chiến dịch quảng cáo bao cao su sẽ rất trung thực và thực tế nhất có thể.",
                            "matter-of-factadjective thản nhiên",
                            "not showing feelings or emotion, especially in a situation when emotion would be expected",
                            "_He spoke in a very matter-of-fact way about the accident.",
                            "matter-of-factlyadverbthản nhiên",
                            "matter-of-factnessnoun[ U ]thản nhiên"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "cold",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "not showing any feelings and especially not showing friendliness, humour, or pleasure: lạnh lùng",
                        "examples": [
                            "She accused me of being cold and uncaring towards her.",
                            "The officers were cold and aloof in their dealings with other ranks.",
                            "The English are often unfairly stereotyped as cold, reserved people."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "impassive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪmˈpæsɪv/  not allowing your feelings to show on your face, so that it is very difficult for people to guess how you feel:",
                        "examples": [
                            "bình thản, thản nhiên ( nên khó đoán được họ nghĩ gì )",
                            "▪ Mr Deacon remained impassive throughout the performance.",
                            "Ông Deacon vẫn tỏ ra bình thản suốt buổi trình diễn.",
                            "▪ Her impassive face showed no sign of reaction to the verdict.",
                            "Vẻ mặt dửng dưng của cô ta không cho thấy dấu hiệu phản ứng nào đối với lời tuyên án.",
                            "impassively[adverb]",
                            "một cách bình thản",
                            "▪ The three men sat impassively watching their captors.",
                            "Ba người đàn ông dõi theo những kẻ bắt giam không chút nao núng.",
                            "impassiveadjective bình thản, không nao núng, dửng dưng",
                            "describes a person's face when it expresses no emotion, because they seem not to be affected by the situation they are experiencing",
                            "impassively adverbbình thản, không nao núng, dửng dưng",
                            "_The defendant sat impassively in the dock while evidence was given against him.",
                            "impassivitynoun[ U ] sự bình thản, sự không nao núng, sự dửng dưng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "detached",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/dɪˈtætʃt/  trying not to react in an emotional way, so that you can do your job properly or make the correct decisions about something:",
                        "examples": [
                            "vô tư, không hiện kiến ( không để cảm xúc chi phối )",
                            "▪ You’ll never be a good lawyer until you learn to be more detached.",
                            "Bạn sẽ không bao giờ là một luật sư giỏi cho đến khi bạn học cách trở nên khách quan.",
                            "▪ Witnessing all the pain and suffering, it is sometimes difficult for relief workers to remain detached",
                            "Chứng kiến những nỗi đau và khổ nhục đôi khi khiến các nhân viên cứu trợ khó mà thờ ơ.",
                            "detachedadjectiveNO EMOTION trơ trơ; không cảm xúc; vô cảm",
                            "describes someone who does not show any emotional involvement or interest in a situation",
                            "_She seemed a bit detached, as if her mind were on other things.",
                            "_Throughout the novel, the story is seen through the eyes of a detached observer."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "not affected by a particular emotion",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "immune",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "usage": "",
                        "region": "",
                        "definition": "adjective miễn dịch ( trở nên vô cảm với điều gì )",
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "not showing your feelings in a dissapproving way",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "clinical",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈklɪnɪkəl/  not showing the feelings that people usually show in an upsetting situation, because you have to do a job or because you really have no feelings about the situation:",
                        "examples": [
                            "vô cảm, lãnh đạm, thờ ơ ( không đồng cảm )",
                            "▪ His words were harsh and clinical -- ‘I don’t love you any more. It is over. I am leaving you.’",
                            "Lời nói của anh ấy thật nhẫn tâm và lạnh lùng - 'Tôi không còn yêu em nữa. Kết thúc rồi. Tôi sẽ rời xa em.'",
                            "clinically[adverb]",
                            "▪ ‘Are you Mrs Wood?’ the officer asked clinically. ‘Your son Thomas is dead.’",
                            "'Bà có phải là bà Wood?' Viên sĩ quan hỏi một cách lạnh lùng. 'Con trai Thomas của bà đã mất.'",
                            "clinicaladjectiveWITHOUT EMOTION lãnh đạm; lạnh lùng; khóxúc cảm; khócảm động",
                            "disapprovingexpressing no emotion or feelings",
                            "_She seems to have a very clinical attitude towards her children.",
                            "clinicallyadverb",
                            "lãnh đạm; lạnh lùng; khóxúc cảm; khócảm động",
                            "_This toothpaste has been clinically proven (= has been shown in experiments) to protect your teeth.",
                            "_Doctors pronounced him clinicallydead(= judged him to be dead by examining his body) .",
                            "_disapprovingShould doctors always remain clinically detached from (= express no emotion towards) their patients?"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "unmoved",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ʌnˈmuːvd/  feeling no pity, sadness, or sympathy, in a situation where most people would feel this:",
                        "examples": [
                            "dửng dưng, không mủi lòng, không dao động",
                            "▪ The defendant’s claims of self-defense left the jury unmoved",
                            "Lời tuyên bố của bị cáo về sự tự vệ đã chẳng thể lay động đến ban bồi thẩm.",
                            "▪ How can anyone remain unmoved by pictures of starving children on our TV screens?",
                            "Làm sao người ta vẫn có thể không dao động trước những cảnh tượng trẻ em đang chết đói trên màn hình TV?",
                            "unmoved by : mặc cho ...",
                            "▪ Unmoved by his pleas, Lucy strolled out of the room.",
                            "Mặc cho những lời cầu xin của anh ta, Lucy thản nhiên ra khỏi phòng.",
                            "unmovedadjective[ after verb ] thản nhiên",
                            "not feeling any emotion",
                            "_Both men appeared unmoved as the judge read out their sentence."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "not yet",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "hard-bitten",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "sb who is hard-bitten has developed a hard, unsympathetic character because their experience of life has been difficult and unpleasant:ngoan cường",
                        "examples": [
                            "Miss Davies is not really the tough, hard-bitten businesswoman that she appears to be.",
                            "Jensen’s experience in prison left him hard-bitten, cynical, and ruthless."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]