[
    {
        "id": "",
        "name": "ideas concepts and theories",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "an idea or set of ideas that explains sth",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "idea",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "a way of explaining something about life, society, etc:tư tưởng",
                        "examples": [
                            "Ideas and customs used to be passed on intact down the generations.",
                            "Do you agree generally with Marx’s ideas?",
                            "idea about",
                            "She had some rather unusual ideas about raising children.",
                            "medieval ideas about the origins of the universe",
                            "idea that",
                            "How old is the idea that there is life after death?",
                            "idea of",
                            "Ideas of how society should function have changed dramatically in the last 200 years.",
                            "where did you get that idea?(= used to say that what someone thinks is completely wrong )",
                            "No, I’m not seeing Jane. Where did you get that idea?"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "theory",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "1 an idea or set of ideas that is intended to explain something about life or the world, especially an idea that has not yet been proved to be true →theoretical: thuyết học, thuyết",
                        "examples": [
                            "theory about/on",
                            "different theories about how the brain works",
                            "theory of",
                            "Darwin’s theory of evolution",
                            "sb’s theory of sth",
                            "Darwin’s Theory of Evolution",
                            "Einstein’s theory of relativity",
                            "theory that",
                            "the theory that light is made up of waves",
                            "2[U] general principles and ideas about a subject : thuyết, lý thuyết",
                            "Freudian theory has had a great influence on psychology.",
                            "political/economic/literary etc theory",
                            "I’m taking a course on political theory.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "come up with/develop a theoryThese birds helped Darwin develop his theory of natural selection.",
                            "test a theoryResearchers gave workers a questionnaire to test that theory.",
                            "prove a theoryNo evidence emerged to prove either theory.",
                            "support a theoryModern research strongly supports this theory.",
                            "disprove a theory(alsorefute a theoryformal) (= show that it is wrong )Later experiments seemed to disprove the theory.",
                            "discredit a theory(= make people stop believing in it )These latest findings discredit his entire theory.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "a scientific theoryScientific theories can be tested experimentally.",
                            "an economic theoryHis economic theory assumes that both labour and capital are perfectly mobile.",
                            "a conspiracy theory(= a theory that an event was the result of secret plan made by two or more people )A variety of conspiracy theories question the official account of President Kennedy’s assassination.",
                            "a pet theory(= a personal theory that you strongly believe )Each of them had his pet theory on what had caused the uprising.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "the theory of evolution/relativity etcAccording to the theory of relativity, nothing can travel faster than light."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "hypothesis",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "formal an idea that is based on very few facts and that you cannot be sure is right: giả thuyết",
                        "examples": [
                            "Various hypotheses are possible regarding the nature and structure of the world.",
                            "The results of our experiment confirmed this hypothesis.",
                            "One hypothesis is that the victim fell asleep while driving.",
                            "prove/test/support etc a hypothesis",
                            "We hope that further research will confirm our hypothesis.",
                            "hypothesis about",
                            "The authors reject the hypothesis about unemployment contributing to crime."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "premise",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "a statement or idea that you accept as being true and use as a base for developing other ideas:tiên đề, giả định",
                        "examples": [
                            "American justice works on the premise that an accused person is innocent until they are proved guilty.",
                            "I believe his whole argument is based on a false premise.",
                            "The idea that there is life on other planets is the central premise of the novel.",
                            "premise that",
                            "the premise that an accused person is innocent until they are proved guilty"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "notion",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "a way of explaining something about life, society, etc, that people often think is a littlestupidorold-fashioned:khái niệm, ý niệm (ngu ngốc , lỗi thời )",
                        "examples": [
                            "notion of",
                            "misguided notions of male superiority",
                            "The traditional notion of marriage goes back thousands of years.",
                            "notion that",
                            "the notion that human beings are basically good",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "have a notionHe didn’t have a clear notion of what he had to do.",
                            "accept a notionProbably 95% of scientists now accept the notion that human activity is causing climate change.",
                            "support a notionThere is no evidence to support the notion that girls are treated better than boys in school.",
                            "reinforce a notion(= make an idea stronger or easier to believe )The research reinforces the notion that fathers have an important role in their children’s lives.",
                            "challenge/dispute a notionCopernicus challenged the notion that the sun goes around the earth.",
                            "reject/dismiss a notionAristotle rejected the notion that the body and the soul are separate.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "a vague notion(= an unclear idea )He had only a vague notion of what might happen next.",
                            "an absurd/ridiculous notionThey had the ridiculous notion that they could make a living from singing.",
                            "a simple notionYou cannot rate the project according to a simple notion of ‘value for money’: there are too many factors involved.",
                            "an abstract notionIn art, how can you represent abstract notions such as peace or justice?",
                            "a romantic notion(= one that is based on how you want something to be, not how it is in real life )He rejected the romantic notion of rugby as a game for gentlemen.",
                            "a preconceived notion(= an idea that you have before you have enough knowledge or experience )The police were accused of twisting the evidence to meet their preconceived notion of his guilt.",
                            "an accepted/received notion(= an idea that most people believe )These women challenged accepted notions of female roles in society.",
                            "the whole notion of something(= used to emphasize that you are talking about a lot of related ideas, not just one specific idea )The movie makes us question the whole notion of what makes a hero.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "not have the faintest/foggiest notion(= not know or understand something at all )He had not the foggiest notion how far he might have to walk."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "concept",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[ countable ]",
                        "usage": "",
                        "region": "",
                        "definition": "an idea of how something is, or how something should be done : khái niệm",
                        "examples": [
                            "concept of",
                            "the concept of total patient care",
                            "the concept of infinite space",
                            "concept that",
                            "the concept that we are citizens of one world",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "a new conceptPart of a teacher’s job is to introduce new concepts to students.",
                            "a basic/fundamental conceptThe children are taught the basic concepts of mathematics.",
                            "a key/central/important conceptThe title tells you something about the central concept of the poem.",
                            "a difficult conceptDifficult concepts can sometimes be explained by diagrams or graphs.",
                            "a simple conceptCause and effect is a fairly simple concept.",
                            "the whole concept of somethingSome people reject the whole concept of evolution.",
                            "a general/broad conceptThe book begins with some general historical concepts.",
                            "an abstract concept(= based on general ideas rather than on something that exists )He finds it hard to grasp abstract concepts.",
                            "a theoretical concept(= that exists only as a theory )The theoretical concepts of psychology, for example Freud’s ideas, are also useful in the study of literature.",
                            "a legal/mathematical/marketing etc conceptDemocracy is a very important political concept.",
                            "an alien concept(= an idea that is very strange or that does not exist )In many countries, queuing for a bus is an alien concept.",
                            "an ambiguous/vague concept(= one that is not clear or is hard to define )Creativity is an ambiguous concept.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "have a concept of somethingAnimals have no concept of their own mortality.",
                            "understand a conceptThe class will help you understand the basic concepts of physics.",
                            "grasp a concept(= understand it )Children often grasp new concepts more quickly than adults.",
                            "introduce a conceptThe first year of the course introduces the basic concepts of management.",
                            "develop a conceptThe Greeks developed the concept of a scientific theory.",
                            ""
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "the main idea of sth",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "gist",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[S]",
                        "usage": "",
                        "region": "",
                        "definition": "the main idea and meaning of sth such as an article or a speech: thực chất, ý chính",
                        "examples": [
                            "the gist of sth",
                            "▪ I don’t know the whole story but this is the gist of it.",
                            "get the gist (of sth)understand the gist of something",
                            "▪ Read the article once through to get the gist of it.",
                            "▪ Students are encouraged to read the text, getting the gist, then go deeper into the meaning.",
                            ""
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "point",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[S]",
                        "usage": "",
                        "region": "",
                        "definition": "the main idea of an argument, discussion, statement etc that shows its general or most important meaning:",
                        "examples": [
                            "The point is, at least we’re all safely back home.",
                            "Nobody knows exactly how it works. That’sthe whole point.",
                            "He may not have stolen the money himself, butthat’s not the point.",
                            "I need to find out who killed Alf, andmore to the point(= what is more important )I need to do it before anyone else gets killed.",
                            "We all like him, but that’sbeside the point(= not the most important thing ).",
                            "sb’s point",
                            "What’s your point? Do you think I’m not good enough for your daughter?",
                            "the point of sth",
                            "The point of the story did not emerge until the end of the film.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "the point is (that) ...The point is that going by bus would be a lot cheaper.",
                            "that’s the (whole) pointThat’s the point. She didn’t tell us what was going on.",
                            "that's not the pointWe'd earn a lot of money, but that's not the point.",
                            "be beside the point(= be not the most important thing to consider )He's the best person for the job so his age is beside the point.",
                            "more to the point(= what is more important )When did she leave, and, more to the point, why?",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "get/come (straight) to the point(= talk about the most important thing immediately )I haven't got much time so let's get straight to the point.",
                            "get the point(= understand it )He didn’t get the point at first.",
                            "miss the point(= not understand it )I don't know why but Mel always seems to miss the point."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "essence",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[S]",
                        "usage": "",
                        "region": "",
                        "definition": "the most important meaning of sth such as an argument or piece of writing: cốt lõi, thực chất",
                        "examples": [
                            "the essence of sth",
                            "The essence of Arsenal’s style of football was speed.",
                            "She seemsthe very essence ofkindness(= she seems very kind ).",
                            "in essenceused when talking about the most basic and important part of something, especially an idea, belief, or argument :",
                            "In essence his message was very simple.",
                            "The essence of his argument is that human character is formed by society."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "drift",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[S]",
                        "usage": "",
                        "region": "",
                        "definition": "the main set of ideas involved in sth such as an explanation, argument, or account of sth: ý định, chủ ý",
                        "examples": [
                            "the drift of sth",
                            "The drift of his letter is that he wants to come back.",
                            "catch/get/follow sb’s driftunderstand the basic idea of what someone is saying",
                            "It was a complicated argument but I think I caught his drift.",
                            "I follow your drift, but I just don’t believe it."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "thrust",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[S]",
                        "usage": "",
                        "region": "",
                        "definition": "the most important message of an argument, explanation etc, especially when it consists of a set of connected ideas leading to a final answer or idea:",
                        "examples": [
                            "the thrust of sth",
                            "It is difficult to argue with the thrust of Davidson’s analysis of the situation.",
                            "The overall thrust of her argument was that women are still oppressed in all areas of life.",
                            "the main thrust",
                            "the main idea, subject, or opinion that is discussed or written about"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "substance",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[S]",
                        "usage": "",
                        "region": "",
                        "definition": "formal the most important ideas contained in an argument or piece of writing: thực chất, cốt lõi, căn bản",
                        "examples": [
                            "the substance of sth",
                            "The substance of Marx’s views is the same in both of these books.",
                            "The substance of his argumentwas that people on welfare should work.",
                            "in substance",
                            "What she said, in substance, was that the mayor should resign.",
                            ""
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "sth that you think of",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "thought",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "an idea - use this especially when youhave not yet consideredit carefully: ý nghĩ , ý tưởng",
                        "examples": [
                            "That’s an interesting thought. Let’s discuss it at the meeting.",
                            "What are your thoughts, Michael?",
                            "thoughts on",
                            "Any thoughts on how we should spend the money?",
                            "If you have any thoughts on the matter, let me know.",
                            "sb’s thoughts about sth",
                            "I’d like you to begin by writing down your thoughts about the play.",
                            "it was (just/only) a thoughtspoken say this when someone seems to disagree with your idea",
                            "‘That’s not a very good time of year to travel.’ ‘Perhaps not. It was just a thought.’",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "have a thoughtI just had a funny thought.",
                            "express your thoughts(= say what they are or tell other people about them )He was finding it difficult to express his thoughts.",
                            "a thought occurs to/comes to/strikes somebody(= someone suddenly has a thought )The thought occurred to him that she might be lying.",
                            "a thought crosses sb’s mind(= someone has a thought )The thought never crossed my mind that I could be wrong.",
                            "can’t bear the thought of somethingI can’t bear the thought of you being hurt.",
                            "sb’s thoughts turn to something(= they start thinking about something )As summer approaches, people’s thoughts turn to holidays.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "sb’s first thoughtMy first thought was that a bomb had gone off.",
                            "a passing thought(= a quick, not very serious thought )He never gives his appearance more than a passing thought.",
                            "a sobering thought(= one that makes you feel serious )We have the power to destroy the world, which is a sobering thought.",
                            "horrible/disturbingA horrible thought struck her: could he be having an affair?",
                            "a comforting thought‘People might not have noticed we’re late.’ ‘That’s a comforting thought.’",
                            "a sudden thoughtA sudden thought struck her and she began to laugh.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "the very thought(= even the idea of doing something )The very thought of going on stage made her feel ill."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "idea",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "a plan or suggestion for a possible course of action, especially one that you think of suddenly : ý tưởng",
                        "examples": [
                            "You should talk to Ken - he's always full of good ideas.",
                            "I knew it was a bad idea to leave him on his own.",
                            "It was my wife’s idea to move house.",
                            "idea for",
                            "The idea for the book came from an old war movie.",
                            "the idea of (doing) sth",
                            "The idea of an underground garage in the park has provoked a lot of anger.",
                            "I had the idea of asking Katie for help.",
                            "idea to do sth",
                            "Who’s idea was it to ask him to the party?",
                            "idea that",
                            "Nobody seemed very keen on the idea that we should all dress up for the party.",
                            "it was sb’s ideathey thought of it đó là ý của ai đó",
                            "I never wanted to go to Spain. It was Sue’s idea.",
                            "►Do not say ‘the idea to do something’. Saythe idea of doing something.However, you can sayit is a good idea to do somethingandit was someone’s idea to do something.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "have an ideaI’ve had an idea. Why don’t we walk into town?",
                            "get an ideaShe got the idea from an article in a magazine.",
                            "give somebody an ideaWhat gave you the idea for the book?",
                            "come up with an idea(= think of an idea )He’s always coming up with interesting ideas.",
                            "hit on an ideainformal(= suddenly think of an idea )Then we hit on the idea of renting a cottage.",
                            "toy with an ideainformal(= think about using an idea, but not very seriously )I’m toying with the idea of going back to college.",
                            "brainstorm ideas(= get a group of people to all try and think of ideas )We had a meeting to brainstorm ideas for the new advertising campaign.",
                            "share/exchange ideas(= tell someone else your ideas, and learn their ideas )an opportunity for local business people to share ideas",
                            "an idea comes to somebody(= someone suddenly thinks of an idea )The idea came to me while I was having a bath.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "a good/bad ideaKeeping the drinks cold in the bath was a good idea.|Knocking down this wall was a really bad idea.",
                            "a great/brilliant/excellent ideaWhat a great idea!",
                            "a bright idea(= a very good idea - often used ironically )Whose bright idea was it to leave the washing out in the rain?",
                            "a clever ideaIt seemed like a clever idea at the time.",
                            "interestingThe idea sounded interesting , but I didn’t think it would work.",
                            "stupid/ridiculous/crazyThe idea sounded crazy to me.|Camping in the middle of winter was a ridiculous idea!|He had the crazy idea of hitchhiking around South America.",
                            "original/innovative(= no one has thought of it before )The company is looking for people who can come up with original ideas.",
                            "a half-baked idea(= an idea that has not been carefully thought out )It’s yet another of the government’s half-baked ideas.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "be full of ideas(alsobe bursting with ideas) (= have a lot of ideas )The children were enthusiastic and full of ideas.",
                            "fire/bounce ideas off one another(= discuss each other’s ideas and think of good new ones )Our regular meetings are opportunities to fire ideas off each other."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "a good idea",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "good idea",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "good/great/fantastic etc idea especially spoken: ý tưởng hay, tốt, tuyệt vời",
                        "examples": [
                            "‘We could go and see a movie.’ ‘Good idea!’",
                            "I think a skiing holiday is a brilliant idea.",
                            "That’s a great idea! Let’s call Madge and see if she can come too."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "bright idea",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "a very good idea that you think of suddenly. This is sometimes also used when you think that sb’s idea is not good:ý tưởng sáng suốt",
                        "examples": [
                            "Why not ask Sylvia? She’s always full of bright ideas.",
                            "whose bright idea was it...used when you think sth is a bad idea ai đã nghĩ ra cái ý sáng suốt là...",
                            "Whose bright idea was it to start major road repairs right at the start of the holiday season?"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "brainwave",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "UK/brainstormUS  informal a sudden, very good idea:ý tưởng hay, sáng kiến, \"sóng não\"",
                        "examples": [
                            "Unless sb comes up with a brainwave soon, I can’t see how we can possibly get out of this mess.",
                            "have a brainwave",
                            "Then Mo had a brainstorm. She would start her own coffee bar for teenagers."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "stroke of genius",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[NP]",
                        "usage": "",
                        "region": "",
                        "definition": "informal a very good and original idea about what to do or how to deal with a problem: sáng kiến thiên tài",
                        "examples": [
                            "They named the new car ‘Thunderbird.’ It was a stroke of genius.",
                            "At first, the manager’s appointment of talented but inexperienced players seemed like a stroke of genius.",
                            "",
                            ""
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "to think of an idea",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "have an idea",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "có một ý tưởng, nghĩ ra 1 ý tưởng",
                        "examples": [
                            "▪ I’ve had an idea. What do you think about going to Greece this summer?",
                            "▪ That’s the best idea you’ve had all day.",
                            "have an idea for",
                            "▪ Do you have any ideas for a birthday present for Mum?",
                            "have the idea of doing sth",
                            "▪ He had the idea of hiding Ali’s shoes."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "get an idea",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[VP]",
                        "usage": "",
                        "region": "",
                        "definition": "to think of an idea - use this especially to say what made you think of it or to ask sb what made them think of it:có được ý tưởng",
                        "examples": [
                            "▪ Where on earth did you get that idea?",
                            "get the idea for sth",
                            "▪ Mark got the idea for the novel when he was in Boston in 1969.",
                            "get an idea from",
                            "▪ It wasn’t my own idea. I got it from a TV movie.",
                            "get the idea of doing sth",
                            "▪ She first got the idea of working with elderly people after the death of her mother.",
                            "get an idea that",
                            "▪ I don’t know how she got the idea that she was too fat."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "think of",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[T PV not in prog]",
                        "usage": "",
                        "region": "",
                        "definition": "sth to have an idea about what to do, how to do sth etc:nghĩ ra",
                        "examples": [
                            "At first, we couldn’t think of a name for the band.",
                            "Seth decided to go home. He couldn’t think of anything else to do.",
                            "Ask Dad. He might be able to think of a solution.",
                            "We'll have to think of a pretty good excuse for being late."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "come to",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[T PV]",
                        "usage": "",
                        "region": "",
                        "definition": "sb if an idea comes to sb, they have the ideasuddenlyand without trying hard to think of it:đến với ai",
                        "examples": [
                            "▪ The idea for the new advertising campaign came to me while I was visiting Thailand.",
                            "it came to sb that",
                            "▪ It suddenly came to me that I’d seen her somewhere before.",
                            "come to sb in a flashvery suddenly",
                            "▪ It came to Blake in a flash that the man was really a detective."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "hit on",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[T PV not in prog]",
                        "usage": "",
                        "region": "",
                        "definition": "/upon sth informal to have a good idea after thinking about or working on a problem for a long time: bật lên ý tưởng",
                        "examples": [
                            "At last we hit on a way of getting Tom and Marcia to meet.",
                            "The architects finally hit upon a design that seemed to please everyone."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "be inspired by",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "if sb’s plan, work of art, action etc is inspired by sth, that is what gave them the idea to do it:được truyền cảm hứng bởi",
                        "examples": [
                            "The novel was inspired by her own experiences in India.",
                            "Some of Picasso’s work was inspired by African art.",
                            "The 1911 strike was inspired by the revolutionary ideas flooding out of Europe at that time."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "containing new or interesting ideas",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "imaginative",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "/ inventive approving containing new ideas that are used in interesting and original ways: giàu tưởng tượng",
                        "examples": [
                            "▪ The film uses computer graphics in an unusual and highly imaginative way.",
                            "▪ an imaginative solution to the city’s crime problem",
                            "▪ These figures are some of the most inventive of all African tribal sculptures.",
                            "▪ Inside the magazine you will find plenty of inventive ideas for redecorating your home.",
                            "an imaginative new approach/policy",
                            "The architects have made imaginative use of glass and transparent plastic."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "not yet",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "abstract",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "usage": "",
                        "region": "",
                        "definition": "adjectiveGENERALtrừu tượng",
                        "examples": [
                            "existing as an idea, feeling or quality, not as a material object",
                            "_Truth and beauty are abstract concepts."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "content",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[singular/uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈkɒntentǁˈkɑːn-/  the ideas, facts, or opinions that are contained in a speech or piece of writing:",
                        "examples": [
                            "▪ Many of the essays are political in content.",
                            "▪ The software, designed for children, has good graphics and animation that doesn’t overwhelm the content.",
                            "content of",
                            "▪ People pay as much attention to your voice as to the content of your speech.",
                            "contentnounSUBJECTnội dung",
                            "[ S or U ] the ideas that are contained in a piece of writing, a speech or a film",
                            "_It's a very stylish and beautiful film, but it lacks content.",
                            "_We've discussed the unusual form of the book - now, what about the content?"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "point",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "idea",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "usage": "",
                        "region": "",
                        "definition": "nounKNOWLEDGEý nghĩ",
                        "examples": [
                            "[ S or U ] an understanding, thought or picture in your mind",
                            "_Do youhave anyideaofwhat he looks like?",
                            "_Can yougiveme an ideaofthe cost (= Can you tell me approximately how much the cost is) ?",
                            "_I don't like the ideaoflivingso far away from my family.",
                            "_[ + question word ]I haven'tthe slightest/faintestideawhere they've gone.",
                            "_I've got apretty goodideawhy they left early.",
                            "_\"Where's Serge?\" \"I've noidea (= I do not know) \"."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "the/sb's point",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "usage": "",
                        "region": "",
                        "definition": "the meaning or most important part of what someone says or writes",
                        "examples": [
                            "_The point is, if you don't claim the money now you might never get it.",
                            "_I think youmissed(= did not understand) the point of what she was saying.",
                            "_Itakeyour point/Pointtaken(= I understand that what you are saying is important) .",
                            "_Pleaseget tothe point (= say the thing that is most important to you) .",
                            "_He hasn't got much money, but that's not the point (= that is not the important thing) ."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "conception",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "usage": "",
                        "region": "",
                        "definition": "nounIDEA quan niệm",
                        "examples": [
                            "[ C or U ] an idea of what something or someone is like, or a basic understanding of asituation or a principle",
                            "_People from different cultures have different conceptionsofthe world.",
                            "_She has a conceptionofpeople as being basically good.",
                            "_I thought the book's writing was dreadful, and its conception (= the ideas on which it was based) even worse.",
                            "_He has absolutelynoconceptionofhow a successful business should run."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "principle",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "usage": "",
                        "region": "",
                        "definition": "nounBASIC IDEAnguyên lý, nguyên tắc",
                        "examples": [
                            "[ C ] a basic idea or rule that explains or controls how something happens or works",
                            "_the principles of the criminal justice system",
                            "_The country is runonsocialist principles.",
                            "_The machine works according to the principleofelectromagnetic conduction.",
                            "_The organization workson theprinciplethatall members have the same rights."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]