[
    {
        "id": "",
        "name": "scare inadequate and not enough",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "not common and existing only in small numbers",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "rare",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "an animal, plant, object etc that is rare does not exist in large numbers or in large amounts: quý hiếm",
                        "examples": [
                            "▪ A new law to prevent the export of rare birds is to be introduced.",
                            "1 đạo luật mới để ngăn chặn việc xuất khẩu các loài chim quý hiếm được giới thiệu.",
                            "▪ They’re pretty rare. Only about a hundred were made.",
                            "Chúng khá hiếm. Số lượng chỉ khoảng 100.",
                            "▪ The palace library contains some of the rarest books in Europe.",
                            "Thư viện trong cung điện chứa vài đầu sách cực quý hiếm ở Châu Âu.",
                            "▪ In Cholon’s narrow streets, Europeans were far rarer than on the boulevards of Saigon.",
                            "Trong những đường hẻm Chợ Lớn, người châu Âu hiếm xuất hiện hơn so với các đại lộ Sài Gòn."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "scarce",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "something that is scarce, especially something that people need such as food, clothing, or water, is not available in large enough numbers or amounts at the moment: khan hiếm",
                        "examples": [
                            "▪ After the war, food and clothing were scarce.",
                            "Sau chiến tranh, thực phẩm và quần áo rất khan hiếm.",
                            "▪ With the increase in trade, good timber for shipbuilding was becoming scarcer.",
                            "Với sự gia tăng thương mại, gỗ tốt cho ngành đóng tàu trở nên khan hiếm.",
                            "scarce resources",
                            "nguồn tài nguyên khan hiếm",
                            "▪ Government departments often found themselves competing for scarce resources.",
                            "Các cơ quan chính phủ thường phải đối mặt với vấn đề nguồn lực khan hiếm."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "not common",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "fairly rare, especially in one particular area or group: không phổ biến",
                        "examples": [
                            "▪ Silver coins of this period are not common, and could be very valuable.",
                            "Tiền xu bằng bạc không phổ biến vào giai đoạn này và có thể chúng rất có giá trị.",
                            "▪ Although tigers still exist, they’re not very common.",
                            "Dù hổ vẫn tồn tại, chúng không quá phổ biến."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be thin on the ground",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "British if you say that people or things of a particular type are thin on the ground, you mean that there are very few available and they are hard to find when you need them: hiếm hoi",
                        "examples": [
                            "▪ Our only problem is finding staff, because good programmers are really thin on the ground.",
                            "Vấn đề duy nhất của chúng tôi là tìm kiếm nguồn lực vì những người lập trình giỏi thật sự rất hiếm hoi.",
                            "▪ Magazines about home improvement were very thin on the ground at the time - not like now.",
                            "Tạp chí về Cải cách nhà đất rất hiếm hoi vào thời đó chứ không phải như bây giờ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be few and far between",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to not be as common as you expect or as you would like: thất thường, không thường xuyên, hiếm có",
                        "examples": [
                            "▪ The schools are crowded, and good teachers are few and far between.",
                            "Trường học thì đông mà giáo viên giỏi thì lại hiếm.",
                            "▪ Toys were few and far between, but the children invented games and played together.",
                            "Đồ chơi rất hiếm mà tụi nhỏ vẫn nghĩ ra mấy trò chơi để chơi cùng nhau."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be/become a rarity",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[noun phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "if something or someone is a rarity, it is surprising to find one, because very few exist: rất hiếm, trở nên hiếm, ít",
                        "examples": [
                            "▪ The traditional costume is becoming a rarity, even in remote villages.",
                            "Trang phục truyền thống đang trở nên hiếm hoi thậm chí ở những miền quê hẻo lánh.",
                            "be something of a raritybe fairly rare",
                            "khá hiếm",
                            "▪ Women are still something of a rarity in senior management positions.",
                            "Phụ nữ vẫn còn khá hiếm ở những vị trí quản lý cấp cao."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "there aren’t many around",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "[informal]",
                        "region": "",
                        "definition": "use this to say that something is rare, especially something that has been made such as a machine, car, or piece of furniture:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "hiếm (động cơ, xe)",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ He drives an original Volkswagen, and there aren’t many of those around these days.",
                                    "Ông ta lái 1 chiếc Volkswagen đời đầu mà ngày nay rất hiếm gặp."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "a small number of people or things",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "a few",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "a small number of people, things, places etc: một số",
                        "examples": [
                            "▪Most of the trees were destroyed by the fire, but a few survived.",
                            "Phần lớn cây cối đã bị cháy, nhưng một số thì sống sót",
                            "a few people/days/things etc một số người, ngày, việc",
                            "▪She’s gone to stay with her father for a few days.",
                            "Cô đã ở lại với cha cô thêm ít ngày",
                            "▪ Can I borrow a few dollars until I get paid?",
                            "Tôi có thể mượn một ít đô la cho đến khi tôi được trả lương không?",
                            "▪ I invited a few friends around on Saturday night.",
                            "Tôi đã mời một số bạn bè xung quanh vào tối thứ bảy.",
                            "a few of một số",
                            "a small number from a larger group",
                            "▪Sean left the gate open and a few of the cows got out.",
                            "Sean để cổng chuồng mờ và một vài con bò ra được khỏi đó."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "a small number",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "a few people, things, places etc, especially when they are part of a much bigger number: một số ít",
                        "examples": [
                            "▪Hundreds of people begin the training programme, but only a small number complete it successfully.",
                            "Hàng trăm người bắt đầu chương trình đào tạo, nhưng chỉ có một số ít thành công."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "a small number of một số ít",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪Only a small number of people still speak Gaelic.",
                                    "Chỉ có một số ít người vẫn nói tiếng Gaelic.",
                                    "▪ The new system is being tested in a small number of schools.",
                                    "Hệ thống mới đang được thử nghiệm ở một số ít trường học.",
                                    "▪ A relatively small number of industrially advanced countries control the world economy.",
                                    "Một số ít các quốc gia tiên tiến trong công nghiệp kiểm soát nền kinh tế thế giới."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "not many",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "a smaller number than you expected or wanted: không nhiều",
                        "examples": [
                            "▪‘Were there many people at the show?’ ‘No, not many.’",
                            "'Có nhiều người trong buổi diễn không?' 'Không, không nhiều.'",
                            "not many people/places etc không nhiều người, nơi",
                            "▪There weren’t many people at the party, but we still had a good time.",
                            "Không có nhiều người trong bữa tiệc, nhưng chúng tôi vẫn có một khoảng thời gian vui vẻ.",
                            "▪ Not many restaurants stay open after midnight.",
                            "Không nhiều nhà hàng mở cửa sau nửa đêm.",
                            "not many of không nhiều",
                            "▪I think I’m quite a good cook but not many of my friends agree with me.",
                            "Tôi nghĩ rằng tôi là một đầu bếp giỏi nhưng không nhiều bạn bè của tôi đồng ý với tôi."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "one or two",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "[spoken]",
                        "region": "",
                        "definition": "a small number of people or things: một hai",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪‘Do you have any Bob Dylan albums?’ ‘Yes, one or two.’",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "'Bạn có bất kỳ album Bob Dylan nào không?' 'Vâng, một hai cái'."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "one or two people/places/questions etc một hai người, nơi, câu hỏi",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ We’ve had one or two problems with the car but nothing serious.",
                                    "Chúng tôi đã có một hai vấn đề với chiếc xe nhưng không có gì nghiêm trọng.",
                                    "▪ There are one or two things I’d like to ask you about.",
                                    "Có một hai điều tôi muốn hỏi bạn."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "one or two of một hai",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪I only know the names of one or two of the new students.",
                                    "Tôi chỉ biết tên của một hai sinh viên mới."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "a couple",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "especially spoken two, or a small number: một vài, một chút",
                        "examples": [
                            "▪ ‘How many drinks did you have?’ ‘Just a couple.’",
                            "'Bạn đã uống bao nhiêu rồi' 'Chỉ một chút'",
                            "a couple of một vài một chút",
                            "▪A couple of kids were playing in the street.",
                            "Một vài đứa trẻ đang chơi trên phố.",
                            "▪ I saw her a couple of days ago.",
                            "Tôi đã nhìn thấy cô ấy một vài ngày trước"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "a handful",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "a very small number of people or things, especially when this number is disappointing or surprising: một vài",
                        "examples": [
                            "▪We offer a gym for our employees but only a handful ever use it.",
                            "Chúng tôi cung cấp một phòng tập thể dục cho nhân viên của chúng tôi nhưng chỉ một số vài người sử dụng nó",
                            "a handful of một số ít",
                            "▪Only a handful of artists in Britain can make a living from painting.",
                            "Chỉ một số ít nghệ sĩ ở Anh có thể kiếm sống bằng tranh vẽ",
                            "▪ A handful of people stayed after the concert to help clear the chairs away.",
                            "Một sốt ít người ở lại sau buổi hòa nhạc để giúp dọn ghế đi."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "a minority",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "a small group of people or things from within a larger group, usually forming much less than half of the larger group: thiểu số",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "a minority of thiểu số",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪Only a minority of union members voted in favour of continuing the strike.",
                                    "Chỉ có thiểu số các thành viên công đoàn đã bỏ phiếu ủng hộ việc tiếp tục cuộc đình công."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "a small/tiny etc minority một nhóm nhỏ thiểu số",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪Joyce is among the tiny minority of arthritis sufferers who experience these symptoms.",
                                    "Joyce là một trong số nhóm nhỏ thiểu số những người bị viêm khớp gặp phải những triệu chứng này.",
                                    "▪ Every year more than three hundred students enter this program but only a small minority will go on to become lawyers.",
                                    "Hàng năm có hơn ba trăm sinh viên tham gia chương trình này, nhưng chỉ một nhóm nhỏ thiếu sổ sẽ trở thành luật sư."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "sparse",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "if something is sparse, there are only very small amounts of it, especially spread over a large area: thưa thớt",
                        "examples": [
                            "sparsely[adverb]thưa thớt",
                            "▪This is one of the most sparsely populated areas of Asia there are only a few people living there.",
                            "Đây là một trong những khu vực thưa thớt nhất của châu Á chỉ có một vài người sống ở đó."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪sparse traffic Giao thông thưa thớt",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Trees are sparse in this part of the world because of the continuous wind that blows across the plains.",
                                    "Cây cối rất thưa thớt ở phần này của thế giới vì gió liên tục thổi qua vùng đồng bằng."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "very few",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "few/very few",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "a very small number of people, things, places etc: rất ít",
                        "examples": [
                            "▪At that time, few people had televisions.",
                            "Vào thời điểm đó, rất ít người có TV.",
                            "▪ Very few new restaurants survive for more than two years.",
                            "Rất ít các nhà hàng mới tồn tại được hơn hai năm."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "few/very few of rất ít",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪Very few of the students we asked said they were interested in politics.",
                                    "Rất ít sinh viên mà chúng tôi hỏi nói họ hứng thú với chính trị."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "almost no",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "so few people or things that there are almost none: dường như không có",
                        "examples": [
                            "▪There are almost no black students at the college.",
                            "Dường như không có học sinh da đen nào trong trường.",
                            "▪ My grandmother received almost no education as she was growing up."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Bà của tôi dường như không được giáo dục khi bà dần lớn lên",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Except for a lone seagull flying overhead, there are almost no signs of animal life.",
                                    "Ngoại trừ một con mòng biển đơn độc đang bay trên cao, hầu như không có dấu hiệu của sự sống động vật."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "hardly any/scarcely any",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "so few people or things that there are almost none - use this especially when this number is disappointing or surprising: không có, không thể",
                        "examples": [
                            "▪There are supposed to be a lot of teachers at the conference, but I’ve met hardly any.",
                            "Có rất nhiều giáo viên trong hội nghị, tôi không thể gặp bất kì ai",
                            "hardly/scarcely any people/things/places etc",
                            "hầu như không có bất kì ai, thứ gì, nơi nào",
                            "▪Although it was Monday morning there were hardly any people around.",
                            "Mặc dù buổi sáng thứ hai không có ai xung quanh.",
                            "▪ He enjoyed his work even though he made scarcely any money.",
                            "Anh ta tận hưởng công việc của mình mặc dù ông hầu như không kiếm được tiền.",
                            "hardly anyone hầu như không ai",
                            "▪We sent out over a hundred invitations but hardly anyone came.",
                            "Chúng tôi đã gửi hơn 100 lời mời nhưng hầu như không ai đến.",
                            "hardly any/scarcely any of hầu như không có",
                            "▪Scarcely any of the private schools replied to the researcher’s questionnaire.",
                            "Hầu như không có bất kỳ trường tư nào trả lời câu hỏi của nhà nghiên cứu."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be able to count st on (the fingers of) one hand",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "be able to count something on (the fingers of) one hand  spoken say this to emphasize that there is only a very small number of people, things, times when something happens etc: đếm trên đầu ngón một bàn tay",
                        "examples": [
                            "▪I can count the number of times my son’s called me on one hand.",
                            "Tôi có thể đếm trên đầu ngón một bàn tay số lần con trai tôi gọi tôi.",
                            "▪ Ten years ago, you could count the Korean restaurants in this city on the fingers of one hand."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Cách đây mười năm, bạn có thể đếm được các nhà hàng Hàn Quốc trong thành phố này trên đầu ngón một bàn tay",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "when a small number of people or things arrive, leave etc",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "a trickle",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[singular noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a number of people going in small groups from one place to another, especially from one country to another, over a long period of time: nhỏ giọt",
                        "examples": [
                            "▪The flow of immigrants from Bosnia has slowed to a trickle.",
                            "Dòng di dân từ Bosnia đã trở nên nhỏ giọt",
                            "a trickle of nhỏ giọt",
                            "▪Since the rebellion there has been a steady trickle of refugees making their way across the border.",
                            "Kể từ cuộc nổi dậy, đã có một dòng nhỏ giọt những người tị nạn ổn định đi ngang qua biên giới."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "in dribs and drabs",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "if people or things arrive, leave etc in dribs and drabs, they come or go in small groups and not all together at the same time: từng phần, lần lượt",
                        "examples": [
                            "▪The wedding guests were arriving in dribs and drabs.",
                            "Các khách mời đám cưới đã đến lần lượt.",
                            "▪ He insisted on paying me back in dribs and drabs, five or ten dollars at a time.",
                            "Anh ta khăng khăng trả tiền cho tôi từng phần, mỗi lần năm hay mười đô la."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "in ones and twos",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "if people or things arrive, leave etc in ones or twos, they arrive etc on their own or in very small groups: nhóm nhỏ",
                        "examples": [
                            "▪ There were only about fifty people in the hall, standing around in ones and twos."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Chỉ có khoảng năm mươi người trong hội trường, đứng xung quanh thành từng nhóm nhỏ",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]