[
    {
        "id": "",
        "name": "curiosity",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "sb who likes to find out about things",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "curious",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "wanting to find out about someone or something because you are very interested in them:",
                        "examples": [
                            "tò mò",
                            "▪ ‘Why do you want to know about Catherine?’ ‘Oh no reason. I’m just curious.’",
                            "'Tại sao bạn lại muốn biết về Catherine?' 'Ồ không có gì, tôi chỉ tò mò thôi.'",
                            "▪ Being naturally curious animals, cats often find their way into dangerous places.",
                            "Là động vật có tính tò mò bẩm sinh, mèo thường tìm vào những nơi nguy hiểm.",
                            "curious about",
                            "tò mò về",
                            "▪ Even young children often become curious about drugs.",
                            "Ngay cả trẻ nhỏ cũng thường xuyên tò mò về ma túy.",
                            "curious to learn/know/ see etc",
                            "tò mò muốn học/ biết/ xem",
                            "▪ It was a weird situation, and I was curious to learn more.",
                            "Đó là một tình huống kỳ lạ, nên tôi tò mò muốn tìm hiểu thêm.",
                            "curiously[adverb]",
                            "một cách tò mò",
                            "▪ ‘Why are you wearing that ring?’ said Sally, looking at me curiously.",
                            "\"Tại sao bạn đeo chiếc nhẫn đó?\" Sally nói, nhìn tôi bằng ánh mắt tò mò."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "curiosity",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "the desire to find out about things:",
                        "examples": [
                            "sự tò mò",
                            "▪ Events like these excite a child’s natural curiosity.",
                            "Những sự kiện như thế này kích thích sự tò mò tự nhiên của trẻ.",
                            "curiosity about",
                            "sự tò mò về",
                            "▪ Olly was bursting with curiosity about the new house.",
                            "Olly cực kỳ tò mò về ngôi nhà mới.",
                            "satisfy somebody’s curiositytell them about something so that they are no longer curious",
                            "thỏa mãn nỗi tò mò của ai",
                            "▪ To satisfy vistors’ curiosity, park officials have prepared maps on which the historical sites are clearly marked.",
                            "Để thỏa mãn nỗi tò mò của du khách, nhân viên công viên đã chuẩn bị bản đồ đã đánh dấu rõ ràng các di tích lịch sử."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "inquisitive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "always wanting to find out about what people are doing, how things work, what is happening etc:",
                        "examples": [
                            "tọc mạch",
                            "▪ Jenny was a very inquisitive child, always asking ‘why?’",
                            "Jenny là một đứa trẻ rất hay dò hỏi, luôn luôn hỏi 'tại sao?'",
                            "▪ The crowded room was filled with lights, cameras, and inquisitive reporters.",
                            "Căn phòng đông đúc nhấp nháy đủ thứ ánh sáng, máy ảnh, và cánh phóng viên hiếu kỳ.",
                            "▪ The kids were wide-eyed and inquisitive.",
                            "Những đứa trẻ tròn xoe mắt trông hiếu kỳ..",
                            "inquisitively[adverb]",
                            "một cách tò mò",
                            "▪ He peered inquisitively into the open window.",
                            "Cậu ấy nhìn chăm chăm ra ngoài cửa sổ mở."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "nosy",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "always wanting to find out things that do not concern you, especially other people’s private affairs:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "quá hiếu kỳ",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ A nosy neighbor actually videotaped them in their own backyard.",
                                    "Một người hàng xóm nhiều chuyện thực sự đã ghi hình họ ở chính sân sau của họ.",
                                    "▪ At first, the children are afraid to ask questions, they think might be impolite or nosy.",
                                    "Lúc đầu, các em ngại đặt câu hỏi, các em nghĩ là bất lịch sự hay quá tò mò."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]