[
    {
        "id": "",
        "name": "interesting or interested",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "Feeling interested in st",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "find st interesting",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "find something interesting/ˌfaɪnd something ˈɪntrstɪŋ/  to feel interested in something because it is the type of thing that youusuallylike to know more about:",
                        "examples": [
                            "thấy cái gì đó thú vị[cụm động từ ] cảm thấy thích thú thứ gì đó bởi vì đó là thứ bạn thường muốn biết nhiều hơn về nó",
                            "▪ It’s a book about travelling round India. I thought you’d find it interesting.",
                            "Đây là cuốn sách du lịch vòng quanh Ấn độ. Tôi nghĩ bạn sẽ thấy nó thú vị.",
                            "find sth interesting to read/watch/hear about etc",
                            "thấy thứ gì đó thú vị để đọc/xem/nghe về vâng vâng",
                            "▪ I always find wildlife programmes interesting to watch.",
                            "Tôi luôn luôn thấy chương trình cuộc sống hoang dã rất thú vị để xem"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "interested",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective not usually before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈɪntrɪstəd, ˈɪntrəstəd/  if you are interested in something, you give it your attention because you want to know more about it:",
                        "examples": [
                            "quan tâm , thích thú[tính từ thường không dùng trước danh từ ] nếu bạn thích thú thứ gì đó, bạn sẽ chú ý vào nó bởi vì bạn muốn bị nhiều hơn về nó",
                            "▪ The children seemed very interested when I showed them my photographs.",
                            "Những đứa trẻ dường như rất thích thú khi tôi cho nó xem những tấm hình",
                            "▪ I can’t remember the name of the book, but if you’re interested I can find out.",
                            "Tôi không thể nhớ tên cuốn sách, nhưng nếu bạn thích nó tôi sẽ tìm cho bạn",
                            "interested in",
                            "thấy thích thú , vui thích",
                            "▪ I’ve never really been interested in politics.",
                            "Tôi chưa từng thích thú chính trị",
                            "▪ Bob first got interested in motor cycles when he was about sixteen.",
                            "Bob lần đầu tiên thích thú xe mô tô khi anh ấy 16 tuổi",
                            "interested to know/hear/see/learn etc something",
                            "thích thú , quan tâm biết / nghe/thấy/học vâng vâng cái gì đó",
                            "▪ You’re an expert on legal problems - I’d be interested to know what you think",
                            "Bạn là 1 chuyên gia về những vấn đề pháp lí - Tôi rất hứng thú muốn biết bạn nghĩ gì.",
                            "▪ We’d be very interested to hear your opinion about this.",
                            "Chúng tôi rất hứng thú muốn nghe ý kiến của bạn về nó"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "with interest",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/wɪð ˈɪntrst/  especiallywrittenif you do something with interest, you do it in a way that shows you are interested:",
                        "examples": [
                            "với niềm hứng thú say mê[trạng từ ] đặc biệt được viếtkhi bạn làm điều gì đó với niềm hứng thú say mê, bạn sẽ làm mọi cách để tỏ ra bạn thích thú",
                            "▪ Richard listened with interest to the conversation at the next table.",
                            "Richard nghe say mê đoạn hội thoại tại bàn kế bên",
                            "with great interest",
                            "với sự quan tâm lớn",
                            "▪ I read with great interest your article concerning the history of the university.",
                            "Tôi đọc bài báo của bạn liên quan đến lịch sử của trường đại học với sự quan tâm lớn."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "show/express interest",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "show/express(an) interest/ˌʃəʊ, ɪkˌspres (ən) ˈɪntrst/  tosayordosomething to show that you are interested in something:",
                        "examples": [
                            "tỏ ra niềm thích thú[cụm động từ ] nói hoặc làm thứ gì đó để tỏ ra bạn thích thú nó",
                            "▪ If you think you’d like the job, you should at least express an interest.",
                            "Nếu bạn nghĩ bạn thích công việc đó, ít nhất bạn nên tỏ ra niềm thích thú",
                            "show/express (an) interest in",
                            "tỏ ra niềm thích thú cái gì đó",
                            "▪ Several companies have already expressed interest in our research.",
                            "1 số công ty đã sẵn sàng bày tỏ niềm thích thú với nghiên cứu",
                            "▪ At a few weeks old, most babies are showing an interest in what is going on around them.",
                            "Ở 1 số tuần tuổi, đa số những đứa trẻ thường tỏ ra niềm thích thú với những thứ xảy ra xung quanh chúng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be into st",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "be into/biː ˈɪntuː/  Britishspokeninformal to be very interested in a subject or activity, and to spend a lot of time on it because you enjoy it:",
                        "examples": [
                            "thích thú với[ngoại động từ ] khi bạn rất thích chủ đề hay hoạt động nào đó, và đanh nhiều thười gian cho nó bởi vì bạn rất thích nó",
                            "▪ Both the kids are into computer games at the moment, and nothing else!",
                            "Bây giờ cả 2 đứa trẻ đều rất thích thú trò chơi trên máy tính, và không thích cái gì khác!",
                            "be into doing something",
                            "say mê điều gì",
                            "▪ Luke’s really into keeping fit - he goes running at 6 o'clock every day.",
                            "Luke rất muốn giữ thân hình cân đối - anh ấy chạy bộ vào 6 giờ mỗi ngày"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "interest in something",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[noun phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈɪntrɪst ɪn , ˈɪntrəst ɪn something/  if there is interest in something, several or a lot of people are interested in it and want to find out more about it:",
                        "examples": [
                            "thích thú cái gì đó[cụm danh từ ] nếu có cái gì thú vị, 1 số hoặc nhiều người sẽ thích thú nó và muốn khám phá về nó",
                            "▪ There has always been a lot of interest in the question of life on other planets.",
                            "Nó luôn luôn thích thú những câu hỏi về cuộc sống ở trên những hành tinh khác",
                            "▪ The Head of Geography said the project was an example of the school’s continuing interest in environmental issues.",
                            "Người đứng đầu địa lí đã nói rằng dự án này là 1 ví dụ cho các trường học tiếp tục quan tâm đến các vấn đề môi trường.",
                            "take an interest in something",
                            "quan tâm đến , thích thú thứ gì đó",
                            "▪ I was a teenager when I first took a serious interest in films.",
                            "Tôi đã là 1 thanh thiếu niên khi lần đầu tiên tôi nghiêm túc thích thú 1 bộ phim",
                            "▪ Children with parents who take an interest in their education generally do better at school.",
                            "Những đứa trẻ cùng với cha mẹ chúng người mà quan tâm đến học tập của con cái họ nói chung học tập tốt hơn ở trường"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "curious",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈkjʊəriəs/  eager to find out more about something because you are interested but do not know much about it:",
                        "examples": [
                            "hiếu kì[tính từ ] háo hức khám phá ra nhiều hơn về điều gì đó bởi vì bạn rất thích thú nó nhưng ban không biết nhiều về nó",
                            "▪ The visitors were soon surrounded by a crowd of curious children.",
                            "Những du khánh sớm bị bao vây bởi 1 đám trẻ hiếu kì",
                            "▪ I’m not being nosy, I’m just curious.",
                            "Tôi không làm ồn, tôi chỉ thấy hiếu kì",
                            "curious about",
                            "hiếu kì về điều gì",
                            "▪ People have always been curious about exactly how life on earth began.curious to know/find out/discover etc something",
                            "Mọi người luôn luôn hiếu kì về chính xác cuộc sống trên trái đất bắt đầu như thế nào",
                            "hiếu kì để biết/tìm ra/khám phá vâng vâng cái gì đó",
                            "▪ He was curious to find out why she had left her job so suddenly.",
                            "Anh ấy rất hiếu kì tìm ra nguyên nhân tại sao cô ấy đột nhiên bỏ công việc của mình",
                            "curiously[adverb]",
                            "tò mò[trạng từ ]",
                            "▪ Everyone stared at us curiously, wondering who we were.",
                            "Mọi người nhìn chúng tôi 1 cách tò mò, rất muốn biết chúng tôi là ai",
                            "curiosity/ˌkjʊəriˈɒsɪti, ˌkjʊəriˈɒsətiǁ-ˈɑːs-/ [uncountable noun]",
                            "sự tò mò, tính hiếu kì[danh từ không đếm được]",
                            "▪ She seems to have no curiosity as to who her natural parents are",
                            "Cô ấy dường như không tò mò muốn biết cha mẹ ruột cô ấy là ai.",
                            "▪ Out of curiosity, I started to read the record he’s made.",
                            "Thoát khỏi sự tò mò, tôi bắt đầu đọc hồ sơ anh ấy làm"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "fascinated",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective not usually before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈfæsɪneɪtəd, ˈfæsəneɪtəd/  extremely interested in something that you are watching or listening to, especially because it is unusual:",
                        "examples": [
                            "mê hoặc[tính từ thường không đứng trước danh từ ] thích thú thứ gì đó cực độ mà bạn đang xem hoặc nghe, đặc biệt bởi vì nó không bình thường",
                            "▪ She watched, fascinated, as the bird came closer until she could almost touch it.",
                            "Cô ấy đang xem, bị mê hoặc khi con chim tiến tới gần hơn đến khi cô ấy gần như chạm được vào nó",
                            "▪ The more I heard about him, the more fascinated I became.",
                            "Tôi càng nghe về anh ấy bao nhiêu, tôi càng bị mê hoặc bấy nhiêu",
                            "fascinated by",
                            "bị mê hoặc bởi",
                            "▪ I was fascinated by her stories of her childhood in Africa.",
                            "Tôi bị mê hoặc bởi những câu chuyện thời thơ ấu của cô ấy ở Châu Phi",
                            "fascinated to discover/find out/learn etc",
                            "bị mê, bị thu hút khám phá / tìm ra / nghiên cứu vâng vâng",
                            "▪ He was fascinated to discover that they had both been born in the same town on the same day.",
                            "Anh ấy bị thu hút khi khám phá ra họ sinh cùng thị trấn cùng ngày"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "have a fascination with/for",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/hæv ə ˌfæsˈneɪʃən wɪð, fɔːʳ/  to have a very strong and often unusual interest in something:",
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "intrigued",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective not before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪnˈtriːgd/  interested by something and eager to know more about it, because it seems mysterious or strange:",
                        "examples": [
                            "gợi thích thú, bị hấp dẫn[ tính từ không đứng trướng danh từ ] bị thích thú bởi những thứ gì đó và rất háo hức muốn biết nhiều về nó, bởi vì nó dường như rất bí ẩn hoặc kì lạ",
                            "▪ ‘Stop me if I’m boring you.’ ‘No, please carry on - I’m intrigued!’",
                            "\"Hãy dừng lại nếu tôi chán bạn\" \"Không, hãy tiếp tục đi - Tôi bị hấp dẫn rồi\"",
                            "▪ Scientists became intrigued by the rock, which appeared to have come from outer space.",
                            "Các nhà khoa học đã bị mê hoặc bởi những hòn đá, nó xuất hiện và đến từ ngoài không gian",
                            "intrigued by",
                            "gợi thích thú , bị hấp dẫn bởi",
                            "▪ Diana was intrigued by Sue’s cryptic message on the answerphone.",
                            "Diana đã bị hấp dẫn bởi tin nhắn bí ẩn của Sue trên điện thoại di động",
                            "intrigued to find out/learn/know etc",
                            "bị hấp dẫn tìm ra / nghiên cứu / biết vâng vâng",
                            "▪ I was intrigued to find that she spoke Aramaic.",
                            "Tôi bị hấp dẫn khi biết rằng cô ấy nói tiếng Aramaic"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "to make sb interested",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "interest",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb not in progressive]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈɪntrɪst, ˈɪntrəst/  if something interests you, it makes you feel interested:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "làm thú vị , gây hứng thúnếu 1 thứ nào đó làm bạn quan tâm, nó làm bạn cảm thấy thú vị",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ There was an article in yesterday’s paper that might interest you."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Đây là bài báo ngày hôm hôm qua tôi nghĩ nó sẽ làm bạn thấy thú vị",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ It’s always best to choose the subject that interests you, not the one your parents want you to do."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Nó luôn luôn là tốt nhất khi chọn chủ đề mà làm bạn thú vị, đó không pải phải điều mà cha mẹ bạn mún bạn làm",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ What interests me most is where he got all that money in the first place."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Thứ mà làm cho tôi cảm thấy thú vị nhất là nơi anh ấy có tất cả số tiền đó ở địa điểm đầu tiên",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "fascinate",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb not in progressive]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈfæsɪneɪt, ˈfæsəneɪt/  if something fascinates you, it makes youveryinterested, so that you want to spend a lot of time thinking about it, watching it etc:",
                        "examples": [
                            "mê hoặcnếu thứ gì đó mê hoặc bạn , nó làm bạn cảm thấy rất thú vị vì thế bạn muốn dành thời gina nghĩ về nó , xem nó",
                            "▪ Anything to do with computers fascinates him.",
                            "Những gì làm với máy tính đều mê hoặc anh ấy",
                            "▪ Cats fascinate me - I don’t know why.",
                            "Con mèo đã mê hoặc tôi - Tôi không biết tại sao",
                            "what fascinates me is : điều thu hút, lôi cuốn tôi là",
                            "▪ What fascinates me about his poems is their apparent simplicity.",
                            "Điều thu hút lôi cuốn tôi về bài thơ của anh ấy là vẻ bề ngoài mộc mạc của họ"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "get sb interested",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "get somebody interested/ˌget somebody ˈɪntrstd/  to make someone interested in a subject or activity, especially by trying to make it seem attractive or enjoyable:",
                        "examples": [
                            "làm cho ai đó cảm thấy thú vị[cụm động từ ] làm cho ai đó thích thú với chủ đề hoặc hoat động, đặc biệt là cố gắng làm nó dường như thu hút hoặc thú vị",
                            "▪ If we can get enough people interested, we could start a reading group.",
                            "Nếu chúng tôi có đủ người quan tâm , chúng tôi sẽ bắt đầu nhóm đọc sách",
                            "get sb interested in",
                            "làm cho ai đó cảm thấy thú vị với",
                            "▪ I’ve tried to get Sam interested in sport, but all he wants to do is watch TV",
                            "Tôi cố gắng làm Sam thích thú thể thao, nhưng tất cả anh ấy muốn làm là xem TV."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "intrigue",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪnˈtriːg/  if something intrigues you, it makes you want to know more about it because there is something about it that you do not understand or cannot explain:",
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "rekindle/revive interest",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/riːˌkɪndl, rɪˌvaɪv ˈɪntrst/  to make people interested in a particular subject again:",
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "so interested that you give all your attention to st",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "absorbed",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective not before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/əbˈsɔːʳbd, əbˈzɔːʳbd/  so interested in something that you give it all your attention and do not notice or pay attention to other things:",
                        "examples": [
                            "hoàn toàn chăm chú vào[tính từ không đứng trước danh từ ] rất thích thú thứ gì đó khiến đặt hoàn toàn sư chú ý và không để ý hay chú ý những thứ khác",
                            "absorbed in",
                            "hoàn toàn chăm chú vào thứ gì đó",
                            "▪ Penny and Sam were so absorbed in their game, that they didn’t hear me call.",
                            "Penny và Sam hoàn toàn chăm chú vào trò chơi của họ, khiến họ khôn không nghe tôi gọi.",
                            "▪ Dad was obviously far too absorbed in his own difficulties to be interested in mine.",
                            "▪ I saw Bill walking across the park, absorbed in his own thoughts.",
                            "Tôi thấy Bill đi bộ qua công viên, và chăm chú nghĩ gì đó"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "gripped/riveted",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective not before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/grɪpt, ˈrɪvtd/  extremely interested by a book, film, event etc or by what someone is saying, so that you cannot stop reading, watching, listening etc:",
                        "examples": [
                            "bị lôi cuốn/tập trung[tính từ không đứng trước danh từ ] thích thú cuốn sách ,bộ phim , hay những sự kiện vâng vâng cực độ hoặc bởi lời người nào đó nói , vì thế bạn không thể ngừng đoc, xem, nghe vâng vâng",
                            "▪ It was a brilliant documentary. I sat absolutely riveted from beginning to end.",
                            "Đó là 1 bộ phim tài liệu hay. Tôi ngồi xuống và tập trung tuyệt đối từ đầu đến cuối",
                            "▪ I was completely gripped as soon as I opened the book.",
                            "Tôi hoàn toàn bị lôi cuốn khi tôi mở cuốn sách ra",
                            "gripped/riveted by",
                            "bị lôi cuốn / tập trung bởi",
                            "▪ We stopped the car, riveted by the sight of a village wedding in progress.",
                            "Chúng tôi dừng xe lại, bị lôi cuốn bởi cảnh đám cưới của 1 ngôi làng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "engrossed",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective not before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪnˈgrəʊst/  extremely interested in something such as a book or your work, so that you do not notice anything that is happening around you:",
                        "examples": [
                            "làm mê mải, say mê ai[tính từ không đứng trước danh từ ] thích thú thứ gì đó cực độ như cuốn sách hay công việc của bạn, vì thế bạn không chú ý những thứ khác đang diễn ra xung quanh bạn",
                            "▪ As she worked, she became so engrossed that she lost all sense of time.",
                            "Khi cô ấy làm việc, cô ta trở nên say mê khiến cô ấy quên cả thời gian",
                            "engrossed in",
                            "bị say mê cái gì đó",
                            "▪ Jane was sitting in bed, engrossed in a novel.",
                            "Jane ngồi trên giường, say mê cuốn tiểu thuyết",
                            "▪ They appeared to be engrossed in their conversation and I didn’t want to disturb them.",
                            "Ho dường như bị cuốn hút trong cuộc hội thoại của họ và tôi không muốn quấy rầy họ"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "obsessed",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective not before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/əbˈsest/  to be too interested in something, so that you cannot stop thinking about it or spending your time on it:",
                        "examples": [
                            "bi ám ảnh[tính từ không đứng trước danh từ ] rất thích thú thứ gì đó vì thế bạn không thể ngừng nghĩ về nó và dành thời gian vào nó",
                            "▪ He spends all his time fiddling about with cars - he’s completely obsessed.",
                            "Anh ấy dành tất cả thời gian với những chiếc xe - anh ta đã hoàn toàn bị ám ảnh",
                            "obsessed by/with",
                            "bị ám ảnh bởi thứ gì",
                            "▪ As an artist, he was obsessed with sex and death.",
                            "Như 1 họa sĩ, anh ấy bị ám ảnh bởi tình dục và cái chết",
                            "▪ People seem to be obsessed by health issues these days.",
                            "Họ dường như bị ám ảnh bởi",
                            "become obsessed",
                            "trở nên ám ảnh",
                            "▪ She became obsessed with the idea of making money.",
                            "Cô ấy trở nên ám ảnh với ý kiến kiếm tiền",
                            "obsession/əbˈseʃən/ [countable noun]",
                            "nỗi ám ảnh [danh từ đếm được ]",
                            "▪ His interest in the Internet was rapidly becoming an obsession.",
                            "Niềm thích thú internet của anh đấy đã nhanh chóng trở thành nỗi ám ảnh"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "enthralled",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪnˈθrɔːld/  very interested and excited by a story or by something that you see or hear, so that you give all your attention to it:",
                        "examples": [
                            "bị mê hoặc , làm mê mệt[tính từ ] rất thích thú và bị kích thích bởi 1 câu chuyện hay thứ gì đó bạn thấy hoặc nghe, vì thế bạn đặt mọi sự chú ý vào nó",
                            "▪ From the opening line of the play, the audience was completely enthralled.",
                            "Kể từ khi mở đầu vở kịch, khán giả đã hoàn toàn bị mê hoặc",
                            "listen/watch etc enthralled",
                            "nghe / xem vâng vâng mê mệt",
                            "▪ We listened enthralled as she told us the story of her life.",
                            "Chúng tôi lắng nghe mê mêt khi cô ấy kể chúng tôi nghe câu chuyện về cuộc sống của cô ấy",
                            "enthralled by",
                            "bị mê hoặc , mê mệt bởi",
                            "▪ I was completely enthralled by the world of the theatre, and knew that I wanted to act.",
                            "Chúng tôi hoàn toàn bị mê hoặc bởi thế giới sân khấu, và biết rằng tôi muốn diễn xuất."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "mesmerized",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective not before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "alsomesmerisedBritish /ˈmezməraɪzd/  unable to stop looking at something or listening to someone because they completely keep your attention:",
                        "examples": [
                            "bị thôi miên , mê hoặc[tính từ không đứng trước danh từ ] không thể dừng nhìn vào thứ gì đó hay nghe 1 ai đó bởi vì họ đã giữ được sự chú ý của bạn",
                            "▪ She stood there mesmerized as he picked up the gun and turned it slowly towards her.",
                            "Cô ấy như bị thôi miên đứng đó khi anh ấy nhặt súng lên và bắn chầm chậm về phía cô",
                            "mesmerized by",
                            "bị thôi miên , mê hoặc bởi",
                            "▪ It was as if the audience was completely mesmerized by the small figure on the stage.",
                            "Như thể khác giả đã hoàn toàn bị mê hoặc bởi cuộc chiến nhỏ trên sân khấu"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "spellbound",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈspelbaʊnd/  so interested by something, especially something strange or wonderful, that you are unable to move or think of anything else:",
                        "examples": [
                            "mê , say mê[tính từ ] rất thích thú thứ gì đó, đặc biệt là thứ gì đó lạ và đẹp , khiến chúng ta bất lực di chuyển hoặc nghĩ về những thứ khác",
                            "listen/watch/wait etc spellbound",
                            "nghe / xem/chờ vâng vâng say mê",
                            "▪ Millions of Japanese listened spellbound as they heard the Emperor speak in public for the first time.s",
                            "Hàng triệu người Nhật bản đã lắng nghe say mê khi họ nghe hoàng đế nói trước công chúng lần đầu tiên",
                            "spellbound by",
                            "say mê bởi",
                            "▪ On clear nights we were spellbound by the strange flickering of the Northern lights in the sky.",
                            "Vào những đêm đẹp trời chúng tôi đã say mê bởi sự nhấp nháy kì la của những ánh đèn phương Bắc trên trời",
                            "held somebody spellbound",
                            "làm ai đó say mê",
                            "▪ The Firebird is a magical ballet that still holds audiences spellbound.",
                            "The Firebird là 1 vở ba lê huyền diệu khiến khán giả say mê"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be all ears",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/biː ˌɔːl ˈɪəʳz/  spoken to be extremely interested in what someone is telling you, and listen very carefully to it:",
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "to become interested",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "get/become interested",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌget, bɪˌkʌm ˈɪntrstd/",
                        "examples": [
                            "trở nên hứng thú[cụm động từ ]",
                            "▪ ‘Really?’ he said. He was obviously getting interested.",
                            "\"Thât không ? Anh ấy nói. Anh ấy chắc chắn trở nên hứng thú.",
                            "get/become interested in",
                            "trở nên hứng thú với",
                            "▪ When did you first get really interested in baseball?",
                            "Khi nào bạn thực sự hứng thú với bóng chày ?",
                            "▪ Early in his career, Piaget became interested in children’s development.",
                            "Từ sớm trong sự nghiệp của anh ấy, Piaget trở nên hứng thú với sự phát triển của trẻ em"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "get into",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive phrasal verb]",
                        "usage": "",
                        "region": "",
                        "definition": "/get ˈɪntuː/  especially spoken, informal to start to become interested in something:",
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "get the bug",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌget ðə ˈbʌg/  informal to become interested in something, so that you want to do it a lot:",
                        "examples": [
                            "đột nhiên có hứng thú[cụm động từ ] trở nên hứng thú với thứ gì đó, vì thế bạn muốn làm nó thật nhiều",
                            "get the gardening/travel/golf etc bug",
                            "đột nhiên có hứng thú với làm vườn / du lịch / gôn",
                            "▪ Since my college days I’ve always had the travel bug.",
                            "Kể từ những ngày đại học của tôi tôi đã có hứng thú với đi du lich",
                            "▪ As soon as the kids got out on the slopes, they were bitten by the skiing bug.",
                            "Ngay khi những đứa trẻ ra ngoài trên sườn núi, chúng đột nhiên thích thú với trượt tuyết."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "to stop being interested",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "lose interest",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌluːz ˈɪntrst/  to stop being interested in something that you were interested in before:",
                        "examples": [
                            "mất đi sự thú vị[cụm động từ ] dừng lại sự hứng thú với cái gì đó mà bạn đã rất thích thú từ trước",
                            "▪ Dan used to play football every Sunday, but then he just lost interest.",
                            "Dan thường chơi bóng đá mỗi chủ nhật, nhưng rồi anh ấy mất đi sự thú vị",
                            "lose interest in",
                            "mất đi sự thú vị với",
                            "▪ Recently she seems to have lost all interest in her work.",
                            "Gần đây cô ấy gần như mất đi sự thú vị với công việc của cô ấy"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "not interested",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "not be interested",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/nɒt biː ˈɪnstrstd/",
                        "examples": [
                            "không hứng thú[cụm động từ ]",
                            "▪ I started telling them about my vacation, but they weren’t very interested.",
                            "Tôi bắt đầu kể họ nghe về kì nghĩ của tôi, nhưng họ không hứng thú",
                            "▪ Helen tried to persuade her sister to come with us, but she just wasn’t interested.",
                            "Helen cố gắng thuyết vụ em gái cô ấy đi với chúng tôi , nhưng cô ấy không hứng thú",
                            "not be interested in",
                            "không hứng thú với",
                            "▪ I’m sure you’re not interested in hearing me talk about my ex-boyfriends.",
                            "Tôi chắc chắn cô ấy không hứng thú nghe tôi kể về những bạn trai cũ của tôi."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "uninterested",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ʌnˈɪntrɪstəd, ʌnˈɪntrəstəd/  not interested and not wanting to know about something:",
                        "examples": [
                            "không quan tâm , hứng thú[tính từ ] không hứng thú hay muốn biết về thứ gì đó",
                            "▪ Morris appeared to be completely uninterested in any of the suggestions I made.",
                            "Morris dường như hoàn toàn không quan tâm những đề nghị tôi đề ra.",
                            "▪ ‘Oh is that all?’ she said in an uninterested tone of voice.",
                            "\"Oh đó là tất cả à ?\" Cô ấy nói với giọng điệu không hứng thú",
                            "uninterested in",
                            "không quan tâm , hứng thú với",
                            "▪ It’s a pity that so many people are uninterested in science at school.",
                            "Thật đáng tiếc khi nhiều người không hứng thú với môn khoa học ở trường"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "not interest",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "notinterest/nɒt ˈɪntrst/  if a subject or activity does  you, you do not want to know about it or learn about it:",
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "show/express no interest",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌʃəʊ, ɪkˌspres nəʊ ˈɪntrst/  to not be interested in something, and to not do or say anything that shows you are interested:",
                        "examples": [
                            "tỏ ra không hứng thú[cụm động từ ] tỏ ra không hứng thú với cái gì đó, và bạn không làm hay nói bất cứ gì để tỏ ra bạn thích thú",
                            "▪ I try to talk to her about my work, but she shows no interest.",
                            "Tôi cố gắng nói với cô ấy về công việc của tôi , nhưng cô ấy tỏ ra không hứng thú",
                            "▪ When we suggested going camping, no one expressed any interest.",
                            "Khi chúng tôi quyết định đi cấm trại , không ai tỏ ra hứng thú cả",
                            "show/express no interest in",
                            "tỏ ra không hứng thú với",
                            "▪ A lot of people have been to look at the house, but they’ve shown no interest in buying it.",
                            "Rất nhiều người nhìn vào căn nhà, họ tỏ ra không hứng thú với việc mua nó"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "lack of interest",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[noun phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌlæk əv ˈɪntrst/  if there is a lack of interest in something, people are not interested in it, especially when you would expect them to be interested:",
                        "examples": [
                            "thiếu sự quan tâm[cụm danh từ ] nếu thiếu sự quan tâm thứ gì đó, mọi người không hứng thú với nó, đặc biệt khi bạn mong muốn họ hứng thú",
                            "▪ The boy replied with a complete lack of interest.",
                            "Đứa con trai trả lời 1 cách hoàn toàn thiếu quan tâm",
                            "lack of interest in",
                            "thiếu quan tâm với",
                            "▪ A depressed person often shows self-pity and a lack of interest in the outside world.",
                            "1 người phiền muộn thường tỏ ra thương hại và thiếu quan tâm đối với thế giới bên ngoài"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "apathetic",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌæpəˈθetɪk◂/  someone who is apathetic about a particular activity or problem is not interested in it and does not care about it enough to try and change it:",
                        "examples": [
                            "không tình cảm, thờ ơ[tính từ ] 1 người nào đó thờ ơ với những hoạt động đặc biệt hay vấn đề là không hứng thú với nó và khong quan tâm về nó đủ để cố gắng và thay đổi nó",
                            "▪ Of course it matters whether you vote or not! Don’t be so apathetic!",
                            "Đương nhiên sẽ có vấn đề nếu bạn có bỏ phiếu hay không ! Đừng có quá thờ ơ !",
                            "apathetic about",
                            "không tình cảm ,thiếu quan tâm về",
                            "▪ People must realize that we can’t afford to be apathetic about environmental issues any longer.",
                            "Mọi người nên nhận ra chúng ta không có đủ khả năng để thờ ơ về những vấn đề môi trường lâu hơn nữa",
                            "apathy/ˈæpəθi/ [uncountable noun]",
                            "tính thờ ơ , vô tình cảm [danh từ không đếm được ]",
                            "▪ Sometimes the apathy of the electorate is quite depressing.",
                            "Đôi khi sự thờ ơ của cử tri thì khá buồn",
                            "▪ political apathy",
                            "sự thờ ơ chính trị"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "leave sb cold",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "leave somebody cold/ˌliːv somebody ˈkəʊld/  informal if something leaves you cold, you do not feel at all interested in it, even though many other people are:",
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]