[
    {
        "id": "",
        "name": "ever",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "at any time in the past or future",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "ever",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈevəʳ/ bao giờ",
                        "examples": [
                            "▪Have you ever bought any of their products?",
                            "Bạn đã bao giờ mua bất kỳ sản phẩm của họ chưa?",
                            "▪ When he left, Bartlett didn’t know if he’d ever see Alaska again.",
                            "Khi rời khỏi, Bartlett không biết liệu anh ta có bao giờ gặp lại Alaska hay không..",
                            "▪ I don’t think I’ll ever get used to that feeling of excitement before a show.",
                            "Tôi không nghĩ rằng tôi sẽ có bao giờ quen với cảm giác phấn khích trước một chương trình.",
                            "ever ... (before) từng",
                            "▪ Have you ever been on a ship like this before?",
                            "Bạn đã từng được ở trên một chiếc tàu như thế này trước đây chưa?",
                            "best/biggest/worst ever etc tốt nhất/lớn nhất/tệ nhất đã từng",
                            "▪That was the biggest mistake I ever made.",
                            "Đó là sai lầm lớn nhất mà tôi từng làm.",
                            "more/better/worse etc than ever (before)",
                            "hơn/tốt hơn/tệ hơn bao giờ hết",
                            "▪Within a few years of the two World Wars, the standard of living of Western European countries was higher than ever before.",
                            "Trong vòng một vài năm của hai cuộc Thế chiến, mức sống của các nước Tây Âu cao hơn bao giờ hết."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "at any time",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ət ˈeni taɪm/  used especially in formal questions and statements:đã từng, bất cứ lúc nào",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪ ‘Of course, no one should have to suffer at any time,’ said the general gruffly, ‘but things are different in times of war.’",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "Tổng thống nói: \"Tất nhiên, không ai phải chịu đựng bất cứ lúc nào\", ông nói chung một cách cộc cằn, \"nhưng mọi thứ khác nhau trong thời chiến\".",
                                    "▪ Have you at any time met with the defendant?",
                                    "Bạn có đã từng gặp mặt bị đơn chưa?"
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "at any time in history/in our existence etc bất cứ lúc nào trong lịch sử/trong sự thời đại chúng ta",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ There are more single parents today than at any time in history.",
                                    "Ngày nay có nhiều cha mẹ độc thân hơn bất cứ lúc nào trong lịch sử."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "in history",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪn ˈhɪstəri/  at any time in the past, since humans have kept records of events:trong lịch sử",
                        "examples": [
                            "▪ Robinson has won more matches than any coach in history."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Robinson đã thắng được nhiều trận đấu hơn bất kỳ huấn luyện viên nào trong lịch sử",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ His arrest ended the longest manhunt in history.",
                                    "Việc bắt giữ ông ta đã chấm dứt cuộc truy nã lâu nhất trong lịch sử.",
                                    "▪ Spielberg then went on to direct ‘Close Encounters of the Third Kind’, which became one of the highest earning films in history.",
                                    "Spielberg sau đó đã tiếp tục chỉ đạo 'Close Encounters of the Third Kind', bộ phim đã trở thành một trong những bộ phim thu nhập cao nhất trong lịch sử.",
                                    "▪ It was the first attempt in history to assemble representatives of all the major regions.",
                                    "Đó là nỗ lực đầu tiên trong lịch sử để tập hợp các đại diện của tất cả các khu vực chính."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "in your life",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪn jɔːʳ ˈlaɪf/  at any time during your life:trong cuộc đời",
                        "examples": [
                            "▪I’ve never owned a gun in my life.",
                            "Tôi chưa bao giờ sở hữu một khẩu súng trong cuộc đời.",
                            "▪ Susan felt she had never worked so hard in her life as she did that day.",
                            "Susan cảm thấy cô chưa bao giờ làm việc chăm chỉ trong cuộc đời như ngày hôm đó.",
                            "▪ He knew that this was one of the saddest things he’d ever have to do in his life.",
                            "Anh ấy biết rằng đây là một trong những điều buồn nhất mà anh phải làm trong cuộc đời mình.",
                            "▪ For the first time in his life, Yossarian prayed.",
                            "Lần đầu tiên trong cuộc đời, Yossarian cầu nguyện."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "of all time",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/əv ˌɔːl taɪm/  at any time in history or in someone’s life:mọi thời đại",
                        "examples": [
                            "▪Fleetwood Mac’s ‘Rumours’ is one of the best-selling rock albums of all time.",
                            "\"Rumours\" của Fleetwood Mac là một trong những album nhạc rock bán chạy nhất mọi thời đại.",
                            "▪ My favourite joke of all time is the one about the donkey who goes to the doctor and says",
                            "Trò đùa yêu thích nhất mọi thời đại của tôi là trò về con lừa đi đến gặp bác sĩ và nói ...",
                            "▪ a list of the 100 Most Influential Women of All Time",
                            "Một danh sách 100 người phụ nữ có sức ảnh hưởng nhất mọi thời đại"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]