[
    {
        "id": "",
        "name": "SOMETIMES",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "sometimes",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "sometimes",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "on some occasions, but not always: đôi khi",
                        "examples": [
                            "▪ Sometimes I drive to work and sometimes I walk.",
                            "Đôi khi tôi lái xe đi làm và đôi khi đi bộ.",
                            "▪ Traffic noise is sometimes a problem.",
                            "Tiếng ồn giao thông đôi khi là một vấn đề.",
                            "▪ The journey takes about an hour, sometimes even longer.",
                            "Chuyến đi mất khoảng một giờ, đôi khi còn lâu hơn.",
                            "▪ Injuries of this type sometimes take a long time to heal.",
                            "Loại chấn thương này đôi khi mất nhiều thời gian để hồi phục."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "occasionally",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to talk about something that only happens a few times, and does not happen often: Thỉnh thoảng, đôi khi",
                        "examples": [
                            "▪ Occasionally we go out to restaurants, but mostly we eat at home.",
                            "Thỉnh thoảng chúng tôi đi ra các nhà hàng, nhưng chủ yếu chúng tôi ăn ở nhà.",
                            "▪ Kay’s moods sometimes made life difficult, and occasionally impossible.",
                            "Tâm trạng của Kay đôi khi làm cho cuộc sống trở nên khó khăn, và đôi khi không thể.",
                            "very occasionally not at all often",
                            "Ít khi",
                            "▪ He lives in Australia now, so we only see him very occasionally.",
                            "Anh ta sống ở Úc, vì vậy chúng ta ít khi gặp anh ta."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "every so often",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "at fairly regular periods but not often:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "mỗi lần như vậy, thỉnh thoảng",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Every so often, Frank looked up at me and smiled.",
                                    "Mỗi lần như vậy, Frank lại nhìn tôi và mỉm cười.",
                                    "▪ The silence was broken every so often by the sound of guns in the distance.",
                                    "Sự im lặng bị phá vỡ thỉnh thoảng bởi tiếng súng ở xa."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "once in a while",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "sometimes but not at all often:",
                        "examples": [
                            "đôi khi",
                            "▪ It would be nice if we could see each other once in a while.",
                            "Sẽ tốt hơn nếu chúng ta có thể đôi khi gặp nhau một lần.",
                            "▪ Teaching art can be fairly dull, but once in a while I come across a talent that really excites me.",
                            "Dạy nghệ thuật có thể khá đờ đẫn, nhưng đôi khi tôi gặp phải một tài năng thực sự kích động tôi.",
                            "every once in a while fairly rarely",
                            "hiếm khi",
                            "▪ Every once in a while he disappears for days on end.",
                            "Hiếm khi ông biến mất trong nhiều ngày sau khi kết thúc."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "at times",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "if something happens at times, it happens on particular occasions but it is not normal or typical of what usually happens: đôi lúc",
                        "examples": [
                            "▪ In a job like this, you’re bound to feel a little stressed at times.",
                            "Trong một công việc như thế này, đôi lúc bạn chắc chắn sẽ cảm thấy một chút căng thẳng.",
                            "▪ At times even the most talented athletes lose their motivation.",
                            "Ngay cả những vận động viên tài năng nhất đôi lúc cũng mất đi động lực."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "now and again/now and then",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to talk about something that sometimes happens that is different from what happens most of the time: thỉnh thoảng",
                        "examples": [
                            "▪ I wear hats now and again, but they don’t really suit me.",
                            "Tôi thỉnh thoảng hay đội mũ, nhưng chúng không thực sự phù hợp với tôi.",
                            "▪ Now and then she would check on the baby sleeping in the next room.",
                            "Thỉnh thoảng cô ấy sẽ kiểm tra em bé đang ngủ ở phòng bên cạnh.",
                            "every now and again/every now and then",
                            "Thỉnh thoảng",
                            "▪ Every now and again a passenger would pass through the carriage on the way to the bathroom.",
                            "Thỉnh thoảng một hành khách sẽ đi qua xe ngựa trên đường vào phòng tắm."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "from time to time",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "sometimes, but not at all regularly and not very often:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Thỉnh thoảng, theo thời gian",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ This is the kind of problem that we all have from time to time.",
                                    "Đây là loại vấn đề mà tất cả chúng ta đều gặp theo thời gian.",
                                    "▪ From time to time a helicopter flew by, but mostly the sky remained clear.",
                                    "Thỉnh thoảng máy bay trực thăng bay qua, nhưng chủ yếu là bầu trời vẫn trong."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "off and on/on and off",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "especially spoken for short periods, but not continuously or regularly, over a long period of time: chốc chốc, lâu lâu",
                        "examples": [
                            "▪ We’ve been going out together for five years, off and on.",
                            "Lâu lâu chúng tôi lại cùng nhau đi ra ngoài trong 5 năm.",
                            "▪ I worked in bars on and off for two years before I decided to go back to college.",
                            "Tôi đã làm việc ở quán bar chốc chốc trong hai năm trước khi tôi quyết định trở lại trường cao đẳng."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "words for describing st that happens sometimes but not often",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "occasional",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "đôi khi",
                        "examples": [
                            "▪ The prisoners are allowed occasional visits from their relatives.",
                            "Các tù nhân được phép thăm viếng đôi khi từ thân nhân của họ.",
                            "the occasional/an occasional",
                            "thỉnh thoảng",
                            "▪ The street was silent except for the occasional burst of laughter from one of the workmen.",
                            "Đường phố im lặng trừ những tiếng cười thỉnh thoãng của một trong những người thợ.",
                            "▪ I didn’t know Terry very well, but we went out for an occasional drink together.",
                            "Tôi không biết Terry rõ, nhưng chúng tôi đã cùng đi uống rượu thỉnh thoảng cùng nhau."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "the odd",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective phrase only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "rỗi rãi",
                            "the odd drink/game/occasion etc",
                            "Cuộc chè chén/Chơi bài/ dịp rỗi rãi",
                            "especially spoken a few drinks, games etc at various times, but not often and not regularly:",
                            "▪ Jim and I have the odd game of cards together.",
                            "Jim và tôi có cùng nhau chơi bài rỗi rãi với nhau.",
                            "▪ We get the odd complaint from customers, but mostly they’re very satisfied.",
                            "Chúng tôi nhận được khiếu nại kỳ lạ từ khách hàng, nhưng phần lớn họ rất hài lòng."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "intermittent",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective usually before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "happening for short irregular periods, often with long periods in between, not continuously: không liên tục, từng hồi",
                        "examples": [
                            "▪ She is the sort of person who works with intense but intermittent effort.",
                            "Cô ấy là một loại người làm việc với nỗ lực dữ dội nhưng không liên tục.",
                            "▪ The afternoon will be warm but unsettled, with intermittent light rain.",
                            "Buổi chiều sẽ ấm nhưng không ổn định, với mưa nhẹ từng hồi."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "periodic",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "happening sometimes, usually every few months, years etc: định kỳ, chu kỳ",
                        "examples": [
                            "▪ She suffered periodic bouts of depression.",
                            "Cô ấy bị trầm cảm theo chu kỳ.",
                            "▪ Periodic failures of the olive crop kept the country in constant debt.",
                            "Sự thất bại chu kỳ của cây ô-liu khiến cho đất nước luôn nợ nần.",
                            "▪ The budget is subject to periodic review.",
                            "Ngân sách được xem xét định kỳ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "casual",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "thất thường, không thường xuyên",
                        "examples": [
                            "casual user/visitor etc",
                            "Người dùng, khách không thường xuyên",
                            "someone who does not often use something, visit somewhere etc:",
                            "▪ Casual users of the library may not realize that they now need a computerized ticket.",
                            "Người sử dụng không thường xuyên thư viện có thể không nhận ra rằng họ bây giờ cần một vé điện toán.",
                            "▪ Charging an entry fee for museums will not affect the casual visitor very much.",
                            "Tính phí nhập cảnh cho các bảo tàng sẽ không ảnh hưởng gì đến khách truy cập không thường xuyên quá nhiều."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]