[
    {
        "id": "",
        "name": "THEN",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "ways of saying that one thing happens after another",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "then",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "sau đó",
                        "examples": [
                            "▪ We scraped all the old paint off the bike and then repainted it bright red.",
                            "Chúng tôi cạo tất cả sơn cũ ra khỏi xe đạp và sau đó sơn lại nó màu đỏ tươi.",
                            "▪ Fry the onions gently, and then add the meat and cook for a few minutes.",
                            "Chiên sơ qua hành tây, sau đó thêm thịt và nấu trong vài phút.",
                            "▪ First you need to collect all the information and make detailed notes. Then you can start to actually write your essay.",
                            "Đầu tiên bạn cần thu thập tất cả thông tin và ghi chép chi tiết. Sau đó, bạn có thể bắt đầu thực sự viết bài luận của bạn."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "next",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "immediately after something - use this especially when the order in which things happen is important: tiếp theo",
                        "examples": [
                            "▪ Everyone started fighting and someone threw a bottle. I forget what happened next.",
                            "Mọi người bắt đầu chiến đấu và ai đó ném một cái chai. Tôi quên những gì đã xảy ra tiếp theo.",
                            "▪ Which of the candidates shall we interview next?",
                            "Người nào trong số những ứng viên chúng tôi sẽ phỏng vấn tiếp theo?",
                            "▪ First you need to select the text you want to move. Next, click on the ‘Move’ command at the top of the screen.",
                            "Đầu tiên bạn cần chọn văn bản bạn muốn di chuyển. Tiếp theo, nhấp vào lệnh 'Di chuyển' ở đầu màn hình."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "after that",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "after something happens: sau đó",
                        "examples": [
                            "▪ England had a man sent off in the first half, and after that the England team never really looked as t",
                            "Anh đã có một cầu thủ bị đuổi ra khỏi hiệp một, và sau đó đội tuyển Anh không bao giờ thực sự trông như t",
                            "▪ The exhaust pipe fell off the car just as we were leaving, and after that it was just one disaster after another!",
                            "Ống xả đã rớt xuống xe khi chúng tôi rời đi, và sau đó nó dẫn tới một thảm hoạ khác!"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "at a particular time in the future",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "then",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "sau đó",
                        "examples": [
                            "▪ Wait until you’ve had your dinner, then you can go out to play.",
                            "Chờ cho đến khi bạn ăn tối xong, sau đó bạn có thể ra ngoài chơi.",
                            "by then",
                            "sau đó",
                            "▪ Just wait until July -- all the exams will be over by then.",
                            "Chỉ cần đợi đến tháng 7 - tất cả các kỳ thi sẽ kết thúc sau đó.",
                            "until then",
                            "Cho đến lúc đó",
                            "▪ We’re not getting a new car until June, so this one will have to do us until then.",
                            "Chúng tôi không nhận được một chiếc xe mới cho đến tháng sáu, vì vậy chúng tôi phải đợi cho đến khi đó.",
                            "▪ We’ll probably see you again when we get to Budapest -- until then goodbye and good luck!",
                            "Có thể chúng tôi sẽ gặp lại bạn khi chúng tôi đến Budapest - cho đến khi đó xin tạm biệt và chúc may mắn!",
                            "then and only thennot until then",
                            "thì sau đó",
                            "▪ Both sides must forget about the past. Then and only then can there be peace.",
                            "Hai bên phải quên đi quá khứ. Rồi thì sau đó mới có thể có được bình an."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "at that stage",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "at that particular time during a series of events:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "vào giai đoạn này",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The exams will be finished by the end of June. At that stage you can make a decision about which subjects to study next year.",
                                    "Các kỳ thi sẽ kết thúc vào cuối tháng 6. Vào giai đoạn này, bạn có thể quyết định về môn nào sẽ học vào năm sau."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "by that time",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "before a particular time actually arrives: trước đó",
                        "examples": [
                            "▪ I have to go at 6 pm, but by that time we should have got through most of the work.",
                            "Tôi phải đi lúc 6 giờ chiều, nhưng trước đó chúng tôi đã phải hoàn thành hầu hết công việc.",
                            "by which time",
                            "Vào lúc đó",
                            "▪ The Connellys go to Africa in April, by which time they hope to have sold their house.",
                            "Connelly đi đến châu Phi vào tháng Tư, vào thời điểm đó họ hy vọng sẽ bán được căn nhà của họ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "at that point",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "at the exact moment during an event or process when something will happen: tại thời điểm đó",
                        "examples": [
                            "▪ At 7:45 the lights will go out in the hall, and at that point all the actors will move into their positions on the stage.",
                            "Lúc 7 giờ 40, đèn sẽ ra ngoài trong sảnh, và tại thời điểm đó tất cả các diễn viên sẽ chuyển sang vị trí của mình trên sân khấu."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]