[
    {
        "id": "",
        "name": "but",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "general",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "but",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to join two words or phrases when the second one has the opposite meaning to the first one, or when the second one is surprising after the first one, or when one is negative and one is positive:",
                        "examples": [
                            "▪ I called but there was no one there.",
                            "▪ He’s short and not really handsome, but women still find him attractive.",
                            "▪ They struggled in the first half, but still won 98-82.",
                            "▪ She tried to read the message, but couldn’t.",
                            "▪ Tom’s grandfather is over 80, but he still plays golf.",
                            "▪ \"Gone with the Wind' was a great movie, but it was a little long.",
                            "▪ In the US it is normal for the police to carry guns, but not in Britain."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "however",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/nevertheless/nonetheless  formal use this when saying something that is surprising after what you have just said, or that is very different from it:",
                        "examples": [
                            "▪ It was a terrible accident. Nevertheless, air travel is still the safest form of transport.",
                            "▪ December saw a more than average rainfall; however, the possibility of a drought is still strong.",
                            "▪ War is never welcome, nonetheless, I believe that we must defend our country."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "but nevertheless/nonetheless",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The leaves aren’t particularly dangerous, but nevertheless they are not something you’d want your child or pet to eat."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "on the other hand",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "use this at the beginning of a sentence when you have just mentioned one side of an argument or situation and you are going to mention the opposite side:",
                        "examples": [
                            "▪ Nuclear power is relatively cheap. On the other hand, you could argue that it’s not safe.",
                            "▪ The hamburger was tough and overcooked. The fries, on the other hand, were terrific, and well worth the money."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "but on the other hand",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ You want to help your kids as much as you can, but on the other hand, you’ve got to be careful to help them learn on their own."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "still/all the same/then again",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "",
                        "region": "",
                        "definition": "also mind you  British spoken use this when you have just said one thing and you now want to say something very different about it, for example when you give an advantage and then a disadvantage:",
                        "examples": [
                            "▪ Teaching is an interesting job. Then again, it can be very stressful too.",
                            "▪ This trip is going to be very expensive. Still, we don’t go away very often.",
                            "▪ I’d love to travel around the world. Mind you, I wouldn’t want to go on my own.",
                            "▪ My parents are happy to lend me the money. All the same, I do feel guilty about it."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "yet",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "/jet/ formaluse this to introduce a fact that seems surprising after what you have just said:",
                        "examples": [
                            "▪ The sun was shining, yet it was quite cold.",
                            "▪ Last summer there was a drought, yet some people were still watering their lawns every day."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "whereas/while",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "[written]",
                        "region": "",
                        "definition": "use this to say that although something is true of one person, thing, or situation, it is not true of another:",
                        "examples": [
                            "▪ Some house plants thrive if placed near a window with plenty of sunlight while others prefer to be in a more shaded spot.",
                            "▪ American cars are generally too large for the Japanese market, whereas Japanese cars are popular in the US."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "though/although",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to introduce a fact or opinion that makes what you have just said less strong or definite:",
                        "examples": [
                            "▪ Dan’s been very ill, although he’s better now.",
                            "▪ I don’t really like classical music, though I did enjoy that Pavarotti concert.",
                            "▪ They’re a very nice couple, although I very seldom see them these days."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "though",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "use this at the end of a sentence to add a fact or opinion that makes what you have just said seem less important , or to add a different fact or opinion:",
                        "examples": [
                            "▪ I think she’s Swiss. I’m not sure, though.",
                            "▪ George did say one nice thing, though."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "even so",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to say that something is true in spite of the fact that you have just mentioned:",
                        "examples": [
                            "▪ Try to run on a soft surface, such as grass. Even so, you may start having knee problems."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "but even so",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ She had only seen Matthew Godden once before, but even so she recognized him instantly.",
                                    "▪ The fines for speeding are large, but even so, they are not always a deterrent."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "only/except",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "[spoken]",
                        "region": "",
                        "definition": "use this for introducing the reason why something is not possible:",
                        "examples": [
                            "▪ I’d like to come and live here, only it’s too expensive.",
                            "▪ I would have asked them to stay with us, except we don’t have enough room."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]