[
    {
        "id": "",
        "name": "connecting words join works or phrases similar or related with meaning",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "ways of saying what the result of st is",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "so big/tall/old etc (that)",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to say that because someone or something is very big, tall etc, something happens as a result: quá to/cao/già... (đến nỗi)",
                        "examples": [
                            "▪ I was so busy today that I didn’t have time for lunch.",
                            "Hôm nay tôi rất bận rộn đến nỗi tôi không có thời gian ăn trưa.",
                            "▪ He always thought he was so good looking that no woman would turn him down.",
                            "Anh ấy luôn nghĩ rằng anh ấy trông đẹp trai đến nỗi không một phụ nữ nào có thể phủ nhận điều đó."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "such a bad day",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "usage": "",
                        "region": "",
                        "definition": "/an old car/a tall man etc (that) use this to say that because it is a very bad day, a very old car etc something happens or someone does something as a result: thật là 1 ngày tồi tệ/ 1 chiếc xe cũ rích/ 1 người đàn ông cao ... (nên, đến nỗi)",
                        "examples": [
                            "▪ It was such a nice day that we decided to go for a picnic.",
                            "Đó thật là một ngày tốt đẹp nên chúng tôi quyết định đi dã ngoại.",
                            "▪ The dress was such a bargain, I had to buy it.",
                            "Chiếc váy này rẻ thật, tôi phải mua nó.",
                            "▪ Paul remained silent for such a long time that we were beginning to wonder if he’d fallen asleep.",
                            "Phao-lô giữ im lặng trong một thời gian dài nên chúng tôi bắt đầu tự hỏi liệu ông đã ngủ quên chưa?"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "so that/with the result that",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to say that because of a particular situation, another situation exists or happens. With the result that is more formal than so that:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "để, vì vậy, kết quả là",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ His hair was very long and covered his eyes, so that you could hardly see his face.",
                                    "Tóc anh rất dài và che mắt anh, để bạn không thể nhìn thấy gương mặt anh.",
                                    "▪ A car pulled out right in front of me, so that I had to slam on the brakes.",
                                    "Một chiếc xe kéo ra ngay trước mặt tôi, vì vậy tôi phải sập vào phanh.",
                                    "▪ The company paid excellent salaries and provided good working conditions, with the result that its employees were of a very high standard.",
                                    "Công ty đã trả lương cao và tạo điều kiện làm việc tốt, kết quả là nhân viên của công ty đạt tiêu chuẩn rất cao."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "therefore",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "so - use this in formal speech and writing: do đó",
                        "examples": [
                            "▪ The building work is taking quite a long time, and therefore costing us money.",
                            "Công việc xây dựng mất khá nhiều thời gian, và do đó gây tốn kém cho chúng tôi.",
                            "▪ Jewish weddings are both religious and civil. Therefore two official applications for marriage are necessary.",
                            "Các đám cưới của người Do Thái đều có tính tôn giáo và dân sự. Vì vậy cần phải có hai đơn chính thức cho hôn nhân."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "as a result/consequently",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to say that because of a particular situation, something else happens or is true. Consequently is more formal than as a result: kết quả là, do đó",
                        "examples": [
                            "▪ I had made a lot of contacts, and had good job opportunities as a result.",
                            "Tôi đã có rất nhiều nơi liên lạc, và kết quả là có cơ hội việc làm tốt.",
                            "▪ The virus attacks the plant, the flower does not open, and consequently no seeds are produced.",
                            "Vi rút tấn công thực vật, hoa không nở, và do đó không có hạt nào được sản sinh."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "so",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction/adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to say that someone does something or something happens as a result of something else: vì vậy",
                        "examples": [
                            "▪ There was nothing on TV, so I decided to go to bed.",
                            "Không có gì trên TV, vì vậy tôi quyết định đi ngủ.",
                            "▪ The rest of the week I’m busy, I’m afraid, so it’ll have to be Monday.",
                            "Tôi e là những ngày còn lại trong tuần tôi đều bận, vì vậy sẽ phải dời lại thứ Hai.",
                            "▪ The shop doesn’t open until 11am and so it loses a lot of business.",
                            "Cửa hàng không mở cửa đến 11 giờ sáng và do đó mất rất nhiều công việc kinh doanh."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "then",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to say what you would expect the result of an action or situation to be:",
                        "examples": [
                            "Vậy thì",
                            "▪ ‘My father’s quite laid back.’ ‘Then he won’t mind if you borrow his car, will he?’",
                            "\"Cha tôi đã nghỉ việc rồi.\" \"Vậy thì ông ấy sẽ không quan tâm nếu bạn mượn xe của ông ấy, phải không?\"",
                            "▪ ‘I’m full up.’ ‘Does that mean you don’t want any dessert then?’",
                            "'Tôi no rồi.' 'Vậy thì điều đó có nghĩa là bạn không muốn món tráng miệng nào nữa phải không?'"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]