[
    {
        "id": "",
        "name": "EXTREME",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "words for describing extreme opinions or people",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "extreme",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective usually before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪkˈstriːm/  extreme opinions or beliefs about politics, religion etc are too strong and most people regard them as unreasonable:cực đoan",
                        "examples": [
                            "▪ Buchanan’s political views are too extreme for most Americans.",
                            "Quan điểm chính trị của Buchanan là quá cực đoan đối với hầu hết người Mỹ.",
                            "▪ extreme left-wing groups",
                            "nhóm cánh tả cực đoan",
                            "▪ We like to present an extreme position to get people to react to it.",
                            "Chúng tôi muốn đưa ra một vị trí cực đoan để mọi người phản ứng lại nó."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "extremist",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪkˈstriːmɪst, ɪkˈstriːməst/  extremist ideas or political organizations involve actions or aims that are very strong and most people think are unreasonable: những người cực đoan",
                        "examples": [
                            "▪The military is expecting a violent response from extremist groups.",
                            "Quân đội đang mong đợi một phản ứng dữ dội từ các nhóm những người cực đoan.",
                            "▪ extremist elements within the party",
                            "các phần tử cực đoan trong đảng",
                            "▪ Neither of these extremist solutions seemed very popular with the voters.",
                            "Cả hai giải pháp cực đoan này dường như không phổ biến với cử tri."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "hardline",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈhɑːʳdlaɪn/  having very definite and extreme political opinions and aims, and completely unwilling to accept or support anything different or less extreme:dứt khoát kiên quyết",
                        "examples": [
                            "▪The army is run by a few hardline generals."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Quân đội được điều hành bởi một vài vị tướng dứt khoát",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Hardline separatists have rejected the proposed constitution.",
                                    "Những người ly khai cứng rắn đã bác bỏ bản dự thảo hiến pháp."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "ultra",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[prefix]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈʌltrə/ phe",
                        "examples": [
                            "ultra-right-wing/left-wing/radical etc",
                            "phe cánh hữu/cánh tả/cực đoan v.v",
                            "far more right-wing, left-wing etc than usual:",
                            "▪He spoke before the ultra-right-wing Heritage Foundation on Thursday.",
                            "Ông nói trước tổ chức di sản cánh hữu vào hôm thứ Năm.",
                            "▪ The Socialist party has been infiltrated by members of the ultra-radical ‘True Path’ group.",
                            "Đảng Xã hội Chủ nghĩa xđã bị xâm nhập bởi các thành viên của nhóm Con đường đích thực cực đoan."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "sb who has extreme opinions",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "extremist",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪkˈstriːmɪst, ɪkˈstriːməst/  someone who has extreme opinions, especially about politics or religion:những người cực đoan",
                        "examples": [
                            "▪The government condemns anyone who disagrees with it as extremists."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Chính phủ lên án bất cứ ai không đồng ý với điều đó như là những người cực đoan",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The regime has been accused of supporting extremists in other countries in the region.",
                                    "Chế độ này đã bị buộc tội hỗ trợ các phần tử cực đoan ở các nước khác trong khu vực.",
                                    "▪ Left-wing extremists have threatened to disrupt the political convention.",
                                    "Những kẻ cực đoan cánh tả đe doạ sẽ phá vỡ đường lối chính trị."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "fanatic",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/fəˈnætɪk/  someone who agrees with and supports very extreme religious or political aims, is completely certain that their opinions are right, and who is thought to be dangerous:cuồng tín",
                        "examples": [
                            "▪His parents were religious fanatics who didn’t allow him to play with other children.",
                            "Cha mẹ anh là những người cuồng tín tôn giáo, những người không cho phép anh chơi với những đứa trẻ khác.",
                            "▪ Pro-Fascist fanatics have continued their attacks on foreigners.",
                            "Những kẻ cuồng tín theo thuyết Phát xít đã tiếp tục tấn công vào người nước ngoài."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "hardliner",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌhɑːʳdˈlaɪnəʳ/  someone who believes very deeply in a set of political aims and ideas, and will not accept or support any changes to them, even if this is unreasonable or unhelpful:kẻ cứng đầu",
                        "examples": [
                            "▪Cuban-American hardliners continue to reject any dealings with Castro.",
                            "Những người cứng đầu Cuba - Mỹ tiếp tục từ chối bất kỳ giao dịch nào với Castro.",
                            "▪ The Prime Minister has been criticized by hardliners in his party for giving away too much in the treaty.",
                            "Thủ tướng Chính phủ đã bị chỉ trích bởi những người cứng rắn trong đảng của ông vì đã cho đi quá nhiều trong hiệp ước."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "militant",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈmɪlɪtənt, ˈmɪlətənt/  someone who is willing to work outside usual political structures, and use illegal or violent methods if necessary, in order to achieve political change:chiến binh",
                        "examples": [
                            "▪He is one of the militants convicted of the World Trade Center bombing.",
                            "Ông là một trong những chiến binh bị kết án của vụ đánh bom Trung tâm Thương mại Thế giới.",
                            "▪ A crowd of militants took to the streets to protest the government’s policies.",
                            "Một đám đông chiến binh đã xuống đường để phản đối chính sách của chính phủ."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "hardcore/hard-core",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈhɑːʳdkɔːʳ/  the hardcore members of a political organization are the small group of people who have the strongest beliefs and who do the most work:cốt lõi",
                        "examples": [
                            "▪The organization has only about 30 hardcore supporters."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Tổ chức này chỉ có khoảng 30 người ủng hộ cốt lõi",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Dole at least had the support of loyal hard-core Republicans.",
                                    "Dole ít nhất cũng có sự ủng hộ của đảng Cộng hòa cốt lõi trung thành."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "fundamentalist",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌfʌndəˈmentəl-ɪst, ˌfʌndəˈmentəl-əst/  someone who follows the rules of their religion very strictly, in a way that seems very unusual to people who do not believe in the same way:Nhà chính trị",
                        "examples": [
                            "Christian/Muslim/Jewish/Hindu etc fundamentalist nhà chính trị theo đạo Kitô, Hồi, Ấn, v.v",
                            "▪ an organized Christian",
                            "Một Kitô hữu có tổ chức",
                            "fundamentalist movement bước đi chính trị",
                            "fundamentalist group/leader/party/church etc",
                            "nhóm/thủ lĩnh/đảng/ nhà thờ các nhà chính trị",
                            "▪ They belong to a fundamentalist church.",
                            "Họ thuộc về một nhà thờ chính thống."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "zealot",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈzelət/  someone who has very extreme beliefs about something, especially about religion, and who thinks that everyone else should live their lives according to religious rules and beliefs: những người phản đối",
                        "examples": [
                            "▪A few zealots strongly objected to the proposed sale of alcohol at the local store.",
                            "Một vài người phản đã đối phản đối mạnh mẽ việc đề nghị bán rượu ở cửa hàng địa phương.",
                            "▪ Anti-abortion zealots are responsible for the bombing of the clinic.",
                            "Những người phản đối nạo phá thai chịu trách nhiệm cho việc ném bom phòng khám."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "diehard",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈdaɪhɑːʳd/  someone who completely refuses to accept new ideas, especially political ideas, even after most other people have accepted them:nhà bảo thủ",
                        "examples": [
                            "▪Salisbury, Walton, and a few other diehards still refused to join the coalition.",
                            "Salisbury, Walton và một vài nhà bảo thủ khác vẫn từ chối gia nhập liên minh.",
                            "▪ Taylor is one of the diehards willing to push the development program at any price.",
                            "Taylor là một trong những nhà bảo thủ sẵn sàng thúc đẩy chương trình phát triển ở bất kỳ mức giá nào."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "lunatic fringe",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌluːnətɪk ˈfrɪndʒ/  a small number of people within a larger organization or movement, whose ideas are so extreme or unusual that most people think they are stupid or a little crazy:những thành phần quá khích",
                        "examples": [
                            "▪ Many think the lunatic fringe has really harmed the public image of gays among the middle class.",
                            "Nhiều người nghĩ rằng những thành phần quá khích đã thực sự làm hại đến hình ảnh công chúng của đồng tính trong tầng lớp trung lưu.",
                            "▪ Animal rights campaigners blame the latest set of bomb attacks on the lunatic fringe within the movement.",
                            "Các nhà vận động tranh đấu quyền lợi động vật đổ lỗi cho những vụ tấn công bằng bom lên những kẻ quá khích trong phong trào."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]