[
    {
        "id": "",
        "name": "question words and expressions",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "at or immediately after the time when st happens",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "when",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "/wen/ khi, thì",
                        "examples": [
                            "▪ When I give the signal, turn on the engine.",
                            "Khi tôi đưa ra tín hiệu, hãy bật máy.",
                            "▪ When I told her what had happened she was really shocked.",
                            "Khi tôi nói với cô ấy điều gì đã xảy ra, cô ấy thực sự bị sốc.",
                            "▪ We’d only just finished cleaning the house when our guests arrived.",
                            "Chúng tôi chỉ mới dọn dẹp xong nhà cửa thì khách hàng đến.",
                            "▪ You can change when you get back.",
                            "Bạn có thể thay đổi khi bạn trở lại.",
                            "▪ I quit school when I was 15.",
                            "Tôi bỏ học khi tôi 15 tuổi.",
                            "▪ When completed, the road will link four major cities.",
                            "Khi hoàn thành, con đường sẽ nối liền bốn thành phố lớn."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "when one thing happens during the time that st else is happening",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "when",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "/wen/ khi",
                        "examples": [
                            "▪ I hurt my shoulder when I was playing football",
                            "Tôi đau vai khi tôi chơi bóng đá",
                            ".▪ All this happened when we were living abroad.",
                            "Tất cả những điều này xảy ra khi chúng ta đang ở nước ngoài.",
                            "▪ When she was at college she wrote for a student newspaper",
                            "Khi lên đại học, cô đã viết bài cho một tờ báo học sinh .",
                            ".▪ Why were you downstairs when everyone else was in bed?",
                            "Tại sao các bạn xuống lầu khi mọi người khác đi ngủ?"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "while",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "alsowhilstBritish formal   during the time that something is happening - use this to emphasize that something is continuing: trong khi",
                        "examples": [
                            "▪ My car was stolen while I was on holiday.",
                            "Xe của tôi bị mất cắp trong khi tôi đi nghỉ mát.",
                            "▪ While she was out of the room, he took a quick look at the papers on her desk.",
                            "Trong khi cô ấy ra khỏi phòng, anh ấy liếc nhìn các tờ giấy trên bàn làm việc.",
                            "▪ While Sandy was filling out the forms, I called Jimmy from the airport.",
                            "Trong khi Sandy đang điền các mẫu đơn, tôi gọi cho Jimmy từ sân bay.",
                            "▪ Patients often comment upon lack of sleep whilst in hospital.",
                            "Bệnh nhân thường bình luận về việc mất ngủ trong khi nằm viện.",
                            "▪ They keep the animals under sedation whilst they’re being transported.",
                            "Họ giữ động vật được an thần trong khi chúng được vận chuyển.",
                            "while/whilst doing something",
                            "trong khi làm gì đó",
                            "▪ They were killed while attempting to reach the summit.",
                            "Họ đã bị giết trong khi đang nỗ lực lên tới đỉnh."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "ways of asking or mentioning when st happened or will happen",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "when",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb/conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "/wen/ khi nào",
                        "examples": [
                            "▪ When are you leaving for Norway?",
                            "Khi nào bạn sẽ rời Norway?",
                            "▪ When did you last have something to eat?",
                            "Lần cuối cùng bạn ăn là khi nào?",
                            "▪ Do you know when the concert will be held?",
                            "Bạn có biết khi nào buổi hòa nhạc sẽ được tổ chức?",
                            "▪ I can’t remember when I bought this.",
                            "Tôi không thể nhớ tôi mua nó khi nào."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "what time",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb/conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "exactly when: mấy giờ, lúc nào",
                        "examples": [
                            "▪ What time is dinner?",
                            "Bữa tối bắt đầu lúc mấy giờ?",
                            "▪ What time did you get in last night?",
                            "Tối qua bạn đến lúc mấy giờ?",
                            "▪ What time do you usually get home from work?",
                            "Bạn thường đi làm về lúc nào?",
                            "▪ I don’t know what time she’s coming home.",
                            "Tôi không biết cô ấy sẽ về nhà vào lúc nào."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "at what point",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb/conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "at what particular time during a process, situation, or activity: vào lúc nào",
                        "examples": [
                            "▪ At what point did you try to stop the fight?",
                            "Bạn đã cố ngừng cuộc ẩu đả vào lúc nào?",
                            "▪ At what point did you realize that your book would never be published?",
                            "Bạn biết cuốn sách của bạn sẽ không bao giờ được xuất bản lúc nào?",
                            "▪ I’m not sure at what point he began to suspect the truth.",
                            "Tôi không chắc tại thời điểm nào anh ta bắt đầu nghi ngờ sự thật."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "when one thing always happens when another thing happens",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "when",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "/wen/ khi",
                        "examples": [
                            "▪ Her nose crinkles up when she laughs.",
                            "Mũi của cô nhăn lại khi cô cười.",
                            "▪ When the demand for a product is high, its price tends to rise.",
                            "Khi nhu cầu về một sản phẩm tăng lên, giá của nó cũng có xu hướng tăng."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪ I can’t understand you when you mumble",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "Tôi không thể hiểu nổi khi bạn lẩm bẩm một mình.",
                                    ".▪ You know what she’s like when she’s on the phone.",
                                    "Bạn biết cô ấy như thế nào khi cô ấy gọi điện thoại."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "whenever",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "use this when you want to emphasize that something always happens when another thing happens: bất cứ khi nào",
                        "examples": [
                            "▪ Whenever we come here, we see somebody we know.",
                            "Bất cứ khi nào chúng tôi đến đây, chúng tôi sẽ gặp ai đó chúng ta biết.",
                            "▪ You should come and talk to me whenever you have a problem.",
                            "Bạn nên đến và nói chuyện với tôi bất cứ khi nào bạn có vấn đề.",
                            "whenever you can",
                            "bất cứ khi nào bạn có thể",
                            "▪ I try to rest whenever I can.",
                            "Tôi cố gắng nghỉ ngơi bất cứ khi nào có thể.",
                            "▪ He still visited her whenever he could.",
                            "Ông vẫn thăm viếng bà bất cứ khi nào có thể.",
                            "whenever possible",
                            "bất cứ khi nào có thể",
                            "▪ She still visits her old schoolfriends whenever possible.",
                            "Cô ấy vẫn thăm bạn học cũ của mình bất cứ khi nào có thể."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "every time",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[conjunction]",
                        "usage": "",
                        "region": "",
                        "definition": "use this when you want to emphasize that something always happens when another thing happens: mỗi lần",
                        "examples": [
                            "▪ Every time she sees me she says looks away.",
                            "Mỗi lần cô ấy nhìn thấy tôi, cô ấy quay đi.",
                            "▪ Every time it rains we get a flood in the bedroom.",
                            "Mỗi lần trời mưa nước ngập cả vào phòng ngủ chúng tôi.",
                            "▪ Don’t ask me for money every time you want to buy a drink.",
                            "Đừng mượn tiền tôi mỗi lần bạn muốn mua đồ uống."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]