[
    {
        "id": "",
        "name": "compete with",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "to take part in a competition, sports event etc",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "compete",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "thi đấu",
                            "▪ Any child between the ages of 8 and 12 is allowed to compete.",
                            "Bất kì trẻ em nào từ 8 đén 12 tuổi được phép cạnh tranh",
                            "compete in : thi đấu trong ( một cuộc thi )",
                            "▪ Athletes from 197 countries competed in the Olympic Games in Atlanta.",
                            "Các vận động viên từ 197 quốc gia đã tham dự Thế vận hội Atlanta",
                            "compete against : thi đấu với ( ai )",
                            "▪ Bailey has competed against athletes half his age and won.",
                            "Bailey đã thi đấu với các vcaanj động viên dưới tuổi ông và giành chiến thắng."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "contest",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "Britishcontest the final/the US Open/the election etcto compete in asportingeventorelection- used especially in newspapers and television reports:",
                        "examples": [
                            "tranh giành , tranh đua ( một giải đấu )",
                            "( văn phong truyền thông )",
                            "▪ In 1991 White contested the US Open and the J G Scott Trophy.",
                            "Năm 1991 White tranh luận với US Open và JG Trophy",
                            "▪ The leadership election will be contested by four candidates.",
                            "Cuộc bầu cử lãnh đạo sẽ bị tranh giành bởi bốn ửng cử viên",
                            "contested[adjective]ganh đua",
                            "hotly contested : ganh đua kịch liệt",
                            "▪ a hotly contested Democratic primary",
                            "Một chính đảng dân chủ tranh đấu kịch liệt"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "to try to do better than another person or organization",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "compete",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to try to do better than another person or organization, for example inbusinessorpolitics:",
                        "examples": [
                            "cạnh tranh, ganh đua, tranh giành, đấu tranh",
                            "compete with : cạnh tranh với",
                            "▪ Nowadays we have to compete more and more with foreign companies.",
                            "Ngày nay chúng ta phải cạnh tranh ngày càng nhiều với các công ty nước ngoài.",
                            "compete against Cạnh tranh với",
                            "▪ The cities are competing against each other to attract and retain business.Các thành phố đang cạnh tranh với nhau để thu hút và duy trì hoạt động kinh doanh",
                            "compete forin order to get something : cạnh tranh cho cái gì",
                            "▪ Children will always compete for their parents’ attention.",
                            "Trẻ em luôn luôn cạnh tranh cho sự chú ý của cha mẹ",
                            "can’t compete with somebody/somethingnot have enough skill, money etc to compete with another person, company etc:",
                            "không thể cạnh tranh với ai đó/ cái gì đó",
                            "▪ Small independent bookstores just can’t compete with national chains and online retailers.",
                            "Hiệu sách nhỏ đọc lập không thế cạnh tranh với các chuỗi cửa hàng quốc gia và các nhà bán lẻ trực tuyến",
                            "compete to do something : cạnh tranh để làm điều gì",
                            "▪ Fujitsu, Hitachi, and NEC are competing with US firms to build the world’s fastest supercomputer.",
                            "Fujitsu, Hitachi và NEC đang cạnh tranh với các cong ti Mỹ để xây dựng siêu máy tính nhanh nhất thế giới."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "fight",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive/transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "to tryextremelyhard to get animportantjoborpoliticalpositionthat other people are also trying to get:",
                        "examples": [
                            "đấu tranh, chiến đấu ( cho 1 công việc, vị trí )",
                            "fight for : chiến đấu cho việc gì",
                            "▪ If you want the job, you’ll have to fight for it.",
                            "Nếu bạn muốn công việc, bạn sẽ phải chiến đấu cho nó",
                            "fight somebody for something : chiến đấu với ai cho việc gì",
                            "▪ Williams fought several rivals for the leadership of the party.",
                            "Williams đã chiến đấu với một số đối thủ để lãnh đạo Đảng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "vie",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[intransitive verb]",
                        "usage": "[written]",
                        "region": "",
                        "definition": "if two people, organizations etc vie with each other in order to do something, they compete in order to try to do it:",
                        "examples": [
                            "( 2 người, nhóm ) tranh đua nhau",
                            "vie for : tranh giành cái gì",
                            "▪ The two political factions are vying for control of the school board.",
                            "Hai phe chính trị đang tranh giành quyền kiểm soát hội đồng nhà trường",
                            "vie with somebody for something : tranh đua với ai cho cái gì",
                            "▪ Paris and Milan vie with each other for the title of world fashion capital.",
                            "Paris và Milan cùng nhau giành danh hiệu thời trang thế giới."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "pit yourself against",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to compete with someone in a fight or competition, especially someone who isstronger, morepowerfuletc than you:",
                        "examples": [
                            "chiến đấu với ( ai đó mạnh hơn )",
                            "▪ The company had pitted itself against the giants of the computer industry in an attempt to increase its share of the market.",
                            "Công ty dã chiến đấu với những gã khổng lồ của ngành công nghiệp máy tính nhằm tăng thị phần của mình",
                            "pit your wits against somebodycompete with someone in a test of knowledge",
                            "đấu trí với ai",
                            "▪ On the quiz show ordinary people pit their wits against a panel of celebrities.",
                            "Trong cuộc thi đố vui này, những người bình thường sẽ gặp khó khăn trước hội đồng quản trị của những người nổi tiếng."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "a situation in which people try to do better than each other",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "competition",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "when people or organizations try hard to get something that they all want but only one of them can get:",
                        "examples": [
                            "sự cạnh tranh,sự tranh tranh đua",
                            "competition for : sựcạnh tranh cho",
                            "▪ Competition for these jobs is very tough - we had over 200 applicants.",
                            "Cạnh tranh cho những công việc này là rất khó khăn- chúng tôi đã có hơn 200 ứng cử viên.",
                            "competition between : sự cạnh tranh giữa",
                            "▪ There’s a lot of competition between the big supermarket chains.",
                            "Có rất nhiều sự cạnh tranh giữa các chuỗi siêu thị lớn.",
                            "face competition : đương đầu với sự cạnh tranh",
                            "▪ Today television networks face increasing competition from cable programming.",
                            "Hôm nay các mạng truyền hình phải đối mặt với sự cạnh tranh ngày càng tăng từ lập trình cáp.",
                            "fierce/strong/tough/stiff competitionwhen a lot of people are all trying very hard to get something : sự cạnh tranh gay gắt, khắc nghiệt",
                            "▪ There is fierce competition for places on the Olympic team.",
                            "Có sự cạnh tranh khốc liệt với cá vị trí trong đội Olympic.",
                            "be in competition with somebody/something: to be in the situation where you are competing with someone else",
                            "cạnh tranh với ai đó / cái gì",
                            "▪ Hotels in the downtown area were in direct competition with each other.",
                            "Khách sạn ở khu vực trung tâm thành phố đã cạnh tranh trức tiếp với nhau.",
                            "cut-throat competition :very strong competition :",
                            "sự cạnh tranh khốc liệt",
                            "▪ Weak management and cut-throat competition put the company out of business.",
                            "Sự quản lí yếu kém và sự cạnh tranh khốc liệt làm cho công ty không còn hoạt động."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "competitive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "a competitivesituationis one in which people try hard to do better than each other, for example in business or at school:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "cạnh tranh",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Amanda hated working in advertising - it was so competitive.",
                                    "Amada ghét làm việc trong ngành quảng cáo- nó đã rất cạnh tranh."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "highly/fiercely competitivevery competitive :cạnh tranh quyết liệt ,rất cạnh tranh",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The atmosphere at our school was highly competitive.",
                                    "Bầu không khí trong trường của chúng ta có tính cạnh tranh cao.",
                                    "▪ In such a fiercely competitive environment, it’s inevitable that some companies will go out of business.",
                                    "Trong một môi trường cạnh tranh gay gắt như vậy, không thể tránh khỏi là một số công ty sẽ không hoạt động."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "rivalry",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable/uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "whentwopeople, teams, or companies, especially when they aresimilarlysuccessful or skilled, try to do better than each other over a long period of time:",
                        "examples": [
                            "cuộc / sự kình địch , ganh đua ( giữa 2 người, nhóm )",
                            "rivalry between : cuộc/sự ganh đua giữa",
                            "▪ Holmes says that the rivalry between the two companies has been exaggerated.",
                            "Holmes nói rằng sự ganh đua giữa hai công ty đã được phóng đại.",
                            "fierce/intense rivalryvery strong rivalry : sự /cuộc ganh đua kịch liệt",
                            "▪ There was an intense rivalry between the Brazilian and Italian teams.",
                            "Có sự cạnh tranh gay gắt giữa hai đội Brazil và Ý.",
                            "sibling rivalrywhen brothers and sisters try to do better than each other : sự / cuộc ganh đua giữa anh em ruột thịt",
                            "▪ Just because sibling rivalry is normal doesn’t mean you should ignore it.",
                            "Chỉ vì sự cạnh tranh của anh chị em là bình thường không có nghĩa là bạn nên bỏ qua nó."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "battle/fight",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a situation in which people or organizations fight against each other to getpowerorcontrolof something, and they are all very determined to win:",
                        "examples": [
                            "cuộc chiến , cuộc đấu",
                            "battle/fight for : chiến đấu/ chiến đấu cho",
                            "▪ The President’s advisors were engaged in a fierce battle for power.",
                            "Các cố vấn của Tổng thống đã tham gia vào một cuộc chiến quyết liệt đối với quyền lực.",
                            "▪ The fight for the construction contract is getting more bitter by the day.",
                            "Cuộc đấu tranh cho hợp đồng xây dựng ngày càng cay đắng hơn.",
                            "straight fight : British a competition involving onlytwopeople or groups, especially after other people or groups have stopped taking part :",
                            "cuộc đấu, chiến trực diện ( giữa hai người, nhóm )",
                            "▪ The Socialist candidate beat the Liberal in a straight fight.",
                            "Ứng cử viên Xã hội chủ nghĩa đánh bại Đảng Tự do trong cuộc chiến thắng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "race",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[countable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a situation in which people or groups compete to get or achieve something:",
                        "examples": [
                            "cuộc đua",
                            "▪ He lost to Pfeiffer in last year’s mayoral race.",
                            "Ông thua Pleiffer trong cuộc đua thị trưởng năm ngoái.",
                            "▪ the arms racerace fortay đua cho",
                            "▪ In the race for the White House, candidates will promise almost anything.",
                            "Trong cuộc đua Nhà Trắng, ứng cử viên sẽ hứa hẹn hầu như bất cứ điều gì",
                            "the race is onthe competition has started : cuộc thi bắt đầu",
                            "▪ The race is on to find a cure for AIDS, and drug companies have already invested millions in research.",
                            "Cuộc đua đang tìm cách chữa bệnh AIDS và các công ty dược phẩm đã đầu tư hàng triệu người vào nghiên cứu."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "rat race",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[singular noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a situation or way of life in which everyone is competing strongly all the time, especiallyatwork, with the result that they always feelworriedand they donotenjoytheirlives:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "cuộc chen đua quyết liệt ( cho công việc, cho cuộc sống )",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ I’m tired of the rat race - I’m tired of never getting ahead."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Tôi mệt mỏi vì cuộc chên đua quyết liệt- Tôi mệt mỏi vì không bao giờ tiến lên phía trước",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Sunday I just try to relax because Monday morning, it’s back to the rat race.",
                                    "Chủ nhật toi chỉ cố gắng thư giản bởi vì sáng thứ hai, nó trở lại cuộc đua quyết liệt."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "someone who likes competing",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "competitive",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is competitive enjoys competing with other people and is always trying to do better than them:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "thích cạnh trạnh, thích đua tranh, hiếu thắng",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ I hate playing tennis with Stephen - he’s too competitive.",
                                    "Tôi ghét chơi quần vợt với Stephen- Anh ấy quá cạnh tranh."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]