[
    {
        "id": "",
        "name": "more",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "more of same thing, or another one of the same things",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "more",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "moreof the same thing: nhiều, thêm",
                        "examples": [
                            "▪ I gave him $200 last week, and he’s already asking for more.",
                            "Tôi đưa cho anh ấy 200 đô tuần trước, và anh ấy lại xin thêm nữa",
                            "▪ There were more riots in the capital last night when protestors clashed with police.",
                            "Đã có nhiều cuộc bạo loạn diễn ra vào đêm hôm qua khi những người biểu tình đụng độ với cảnh sát,",
                            "more of: Nhiều cái gì đó",
                            "▪ Those interested in seeing more of the sculptor’s work can visit the Sacre Monte museum.",
                            "Những người yêu thích nhiều tác phẩm của nhà điêu khắc có thể tham quan viện bảo tàng Sacre Monte.",
                            "three more/100 more etc: thêm, hơn 3/100",
                            "▪ Some of the students arrived today, and about 20 more will be here tomorrow.",
                            "Một vài học sinh đã đến trước ngày hôm nay khoảng hơn 20 học sinh nữa sẽ có mặt vào ngày mai.",
                            "▪ I might buy a couple more of those scarves.",
                            "Toi có lẻ sẽ mua thêm một vài chiếc khăn nữa.",
                            "some more/any more/no more: thêm nữa/ nữa không/ không còn nữa",
                            "▪ Is there any more beer in the fridge?",
                            "Có thêm bia trong tủ lạnh không?",
                            "▪ Why don’t you go upstairs and do some more homework?",
                            "Tại sao bạn không đi lên lầu và làm thêm một số bài tập nữa đi?",
                            "▪ Officials are satisfied that no more bodies are buried in the ruins.",
                            "Các cán bộ hài lòng với việc không còn tình trạng chôn cất nữa.",
                            "a few more: thêm một ích",
                            "▪ Can you give me a few more minutes?",
                            "Bạn có thể cho tôi thêm vài phút nữa được không?",
                            "one morethe last of several: Thêm lần nũa",
                            "▪ I’ll just have one more drink before I go.",
                            "Tôi uống thêm một ít bia trước khi rời khỏi",
                            "a bit more British /a little(bit) moreAmerican: Thêm một ít",
                            "▪ Sally read a bit more of her book to keep her mind off things."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "another",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[determiner/pronoun]",
                        "usage": "",
                        "region": "",
                        "definition": "one more thing, person, or amount of the same kind: Thêm nữa",
                        "examples": [
                            "▪ Would you like another drink?",
                            "Bạn có muốn uống thêm nước không?",
                            "▪ Look, your glass is cracked. I’ll get you another.",
                            "Hãy nhìn này, cái li của bạn bị nứt rồi. Tôi sẽ giúp bạn lấy thêm cái nữa",
                            "another of: thêm caigs gi dó",
                            "▪ Still to come on Channel West, another of our special reports from Florida.",
                            "Vẫn trên kênh Channel West, cò có thêm các bài báo cáo khác của chúng tôi từ Florida",
                            "another ten minutes/five miles/two gallons etc: thê, 10 phút/ 5 dặm/ hai lít nữa",
                            "▪ Add the pasta and heat the soup for another ten minutes.",
                            "Hãy thêm mí ốn và đun nóng súp thêm 10 phút nưa",
                            "▪ For another 80 bucks, you could have a wide-screen TV with Internet access",
                            "Thêm 80 đô nữa thì bạn có thể có một chiếc ti vi màn hình rộng và có mạng Internet.",
                            ".another one: thêm",
                            "▪ Pass me another one of those folders.",
                            "Hãy đưa tôi thêm một cái thư mục nũã."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "extra",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective/adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "more of something, in addition to the usual or standard amount or number: thêm",
                        "examples": [
                            "▪ Residents may use the hotel swimming pool at no extra charge.",
                            "Cư dân có thể sử dụng hồ bơi của khách sạn mà không cần trả thêm tiền.",
                            "extra ten minutes/three pounds/four gallons etc",
                            "Thêm 10 phút/ 3 Bảng Anh/ 4 lít",
                            "▪ You get an extra 5% discount if you buy your software on-line.",
                            "Bạn có thể giảm được thêm 5% nếu bạn mua phần mềm này trên mạng.",
                            "▪ The voting booths stayed open for an extra two hours in some states.",
                            "Các gian hàng bỏ phiêu tiếp tục mở thêm hai tiếng đồng hồ nữa ở một số Bang.",
                            "be/cost/charge etc extrato be, cost, charge etc extra money: trả thêm",
                            "▪ Dinner costs $15, but wine is extra.",
                            "Bữa tối tốn 15 đô, nhưng rượu tì phải trả thêm",
                            "▪ Most small providers offer their customers free Web space, but larger providers often charge extra.",
                            "Phần lớn những nhà cung cấp nhỏ cho khách hàng họ khoog gian lướt web miieenx phí trong khi đó những nhà cung cấp thì phải trả thêm tiền."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "additional",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "more than the amount or number that was agreed or expected at the beginning of something: :Thêm vào",
                        "examples": [
                            "▪ Our own car broke down, so we had the additional expense of renting a car.",
                            "Xe hơi của chúng tôi bị hư, vì thế chúng tôi phải trả thêm chi phí cho việc thuê chiếc xe hơi khác",
                            "an additional £10/10 miles/10 minutes etc: Thêm vào/ cộng thêm 10 bảng anh/100 đô/10 phút",
                            "▪ Judge Mathes sentenced her first to a year and later to an additional three months in jail for contempt.",
                            "Thẩm phán kết án cô ấy một năm tù và tiếp tục ngay sau đó cộng thêm ba tháng nữa vì tội khinh thường người khác."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "further",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "more, in addition to what there is already or what has happened already: hơn nữa, nữa",
                        "examples": [
                            "▪ The doctors are keeping her in hospital to do further tests."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Bác sĩ giữ cô ấy ở lại bệnh viện để làm làm một số xét nghiệm nữa",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ For further information, contact the help line.",
                                    "Để biết thêm thông tin nưa thì hãy liên với đường dây hổ trợ."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "a further £10/10 miles/10 minutes etc: thêm 10 đô/ 10 dặm/ 10 phút nũa",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Strike action will continue for a further 24 hours."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "cuocj thi hành đình công sẽ tiếp tuc diễn ra thêm 24 giờ nữa",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "added",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": ": được thêm vào, tăng thêm",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "added advantage/benefit/protection etc : lợi ích/ sự bảo vệ được tăng thêm",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "another advantage or more of something that makes something better or more effective:",
                                    "▪ The new computer is as good as the old one, with the added advantage of being smaller."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Máy tính mới tốt bằng cái cũ, có thêm những ích lợi",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Buy a high-factor sun lotion, and wear a hat for added protection.",
                                    "Hãy mua kem dưỡng da có tín năng cao, và hãy đội mũ để tăng thêm sự bảo vệ cho da."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "spare",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "asparetyre, key, room etc is one that you have in addition to the ones you normally use, so that it is available if another one is needed: thừa, dư, trống, phụ tùng",
                        "examples": [
                            "▪ We carried Ros upstairs and laid her on the spare bed."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Tôi bề Ró xuống lầu và đặt cô ấy len giường.trống",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Pauline keeps a spare key hanging in the closet upstairs.",
                                    "Pualine giữ một chìa khóa phụ tùng ở trong tủ quần áo trên lầu."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "supplementary",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "provided in addition to what already exists, in order to help people or improve something: Bổ sung thêm, phụ thêm",
                        "examples": [
                            "▪ Some supplementary finance is available in the form of grants or loans.",
                            "Mốt số khoản tài chính bổ sung có sãn ở hình thức tài trợ và cho vay.",
                            "▪ The Investment Business Gazettes offer very useful supplementary information.",
                            "Nhà đầu tư kinh doanh Gazettes đề ra một số thông tin bổ ích bổ sung thêm."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "more than a number or amount",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "more",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": ": nhiều",
                        "examples": [
                            "more thana number or amount: more than: nhiều hơn",
                            "▪ I’ve been working here for more than fifteen years.",
                            "Tôi đã làm việc ở đây nhiều hơn 50 năm",
                            "▪ More than 50,000 people attended the concert, which was held in Central Park",
                            "Nhiều hơn 50000 người tham gia buổi hòa nhạc đươc tổ chuacws tại Central Pảk.",
                            "much more/far more/a lot more/even more: Nhiều hơn nữa, rất nhều",
                            "▪ Rented accommodation costs much more in New York",
                            "Thuê phòng ở New York tốn rất nhiều tiền",
                            ".▪ Sales executives earn about $200,000 a year, and those higher up the ladder can earn a lot more.",
                            "Những nhân viên bán hàng kiếm được khoang 200000 đô trên một năm, và những ở cấp cao hơn có thể kiếm được nhiều tiền hơn nữa.",
                            "no more than/not more than : Không hiều hơn",
                            "▪ The discussion lasted no more than 30 minutes.",
                            "Buổi thảo luận kéo dài không nhiều hơn 30 phút",
                            "10/100/$50 etc more: hơn 10/100/50 đô",
                            "▪ It’s a better hotel, but it costs about £50 more than the other one.",
                            "cái khách sạn này thi tốt hơn nhung giá củ nó thì hơn khách sạn kia 50 đô",
                            "or more: hoặc là nhiều hơn nữa",
                            "▪ He could receive a prison sentence of five years or more.",
                            "Anh ấy có thể bị kết án tù 5 năm hoặc nhiều hơn nữa."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "over",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[preposition/adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "more than that number or amount - use this especially when it is not important to say exactly how much more: hơn",
                        "examples": [
                            "▪ I had to wait over half an hour for the train this morning.",
                            "Sáng nay tôi phải đợi xe lửa hơn nữa tiếng",
                            "▪ We receive over 2,000 applications a year.",
                            "Tôi nhận được hơn 2000 đơn xin việc một năm",
                            "▪ It’s hot out there - I’d say it’s over 90.",
                            "Ngoài đó trời nóng lắm, tôi muốn nói là nó hon 90 độ đấy",
                            "just overslightly over: gần",
                            "▪ She weighs just over 180 pounds.",
                            "Cô ấy nặng nặn gần 180 poumd",
                            "well over/way over : nhiều hơn",
                            "a lot more informal",
                            "▪ Well over 30 schools took part in the fund-raising walk.",
                            "Nhiều hơn 30 trừng học tham gia vào phong trào đi bộ gây quỹ",
                            "▪ She was driving way over the speed limit.",
                            "Cô ấy lãi xe vượt qua tốc độ quy định",
                            "3/10/12 etc and overincluding and over a particular age: 3/10/12 và hơn nữa",
                            "▪ NCI recommends that women aged 40 years and over are checked every two years.",
                            "NCI đễ nghị rằng phụ nữ trên 40 tuổi và nhiều hơn nữa được kiểm ra hai năm một lần"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "above",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[preposition/adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "more than a number or level on a scale that can be exactly measured: trên",
                        "examples": [
                            "▪ The temperature is about 2 degrees above zero.",
                            "Nhiệt độ khoảng 2 độ",
                            "just aboveslightly above: gần hơn",
                            "▪ High speed trains average just above 150 mph.",
                            "Tốc độ chạy xe lưa của anh ấy gần hơn 150 mph",
                            "well/way abovea lot more informal: nhiều",
                            "▪ The government promised to increase teachers’ pay well above the rate of inflation.",
                            "Chính phụ hưá rằng sẽ tăng tiền lương giáo viên hơn tỉ lệ lạm phát",
                            "above averagemore than usual: nhiều hơn bình thường",
                            "▪ All the students in the group were found to have above average IQ scores.",
                            "Tất cả học sih trong nhóm này đều có chỉ số IQ cao hơn bình thường",
                            "3/10/12 etc and above: 3/10/12 và trên nữa",
                            "including and above a particular figure",
                            "▪ A score of 70 and above indicates good spatial and map-reading skills.",
                            "Số điểm 70 và trên nữa cho thấy kĩ năng đọc biểu đò tốt."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "greater than",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[preposition]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "more than a particular number or amount, especially a number: lớn hơn",
                        "examples": [
                            "▪ Scientists have discovered eight craters on Venus with diameters greater than 100 km.",
                            "Các nhà khoa học phám phá ra rằng tám miệng núi lửa trên Sao Kim và đường kính cao hon 100km",
                            "▪ Imagine a device that could send a signal at a speed greater than the speed of light.",
                            "Hãy tưởng môt thiết bị mà có thể gửi kí hiệu với tốc đô lớn hơn tốc độ ánh sáng",
                            "be greater than: Cao hơn",
                            "▪ Economic growth this year is predicted to be greater than 1.5%.",
                            "Sự phát triển kinh tế na nay được dự đoán cao hơn 1,5%",
                            "be much/far/even greater than: cao hơn, nhiều hơn nhiều",
                            "▪ By the 1940s, the volume of domestic trade was much greater than trade with other countries.",
                            "Vào nhugwx năm 1940, khối lượng thương mại trong nước lớn hơn nhiếu so với thương mại của các nước khác."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "beyond",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[preposition/adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "more than another number, amount, age etc - use this especially when the other number etc is a particular level or limit: vượt quá",
                        "examples": [
                            "▪ Inflation has now risen beyond the acceptable level of 5%."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Lạm phát bây giờ đang tăng vượt quá tỉ lệ cho phép la 5%",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ In a number of professions, it is possible to continue working beyond retirement age.",
                                    "Ở một ssos nghề nghệp, việc tieép tục làm việc quả tuổi về hươu là không thể."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "in excess of",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[preposition]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "more than an amount or number - used especially in official documents, instructions, or reports: Vượt qua",
                        "examples": [
                            "▪ The cyclone was travelling at speeds in excess of 21 mph.",
                            "Cơn lốc di chuyển với tốc đọ vượt qua 21 mph",
                            "be in excess of: Vượt qua cái gì",
                            "▪ The population is now estimated to be in excess of 40 million.",
                            "Dân số bây giờ được dự đóa là sẽ vượt qua con ssos 40 triệu",
                            "well in excess ofa lot more informal: Vượt quá nhiều",
                            "▪ The fire has caused well in excess of $500,000 worth of damage.",
                            "Ngọn lửa đã gây ra vượt hơn 500000 đô để đền bù hiệt hại"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "upwards of",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[preposition]",
                        "usage": "",
                        "region": "",
                        "definition": "alsoupward ofAmerican   use this when the number or amount you mention is the lower limit, and there is possibly even more than that: trên",
                        "examples": [
                            "▪ The Reynolds collection is valued at upward of $20 million.",
                            "Bộ sưu tầm của Reynolds có giá trị trên 20 triệu đô",
                            "10/$300/5 years etc : trên 10/300 đô/5 năm",
                            "and upwards",
                            "▪ The performance is suitable for children of 7 years and upwards.",
                            "bài biểu diễn này chỉ thích hợp cho trẻ con bằng và trên 7 tuổi"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "plus",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "cộng thêm, hơn",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "10/100/1,500 etc plusat least 10, 100 etc: Cộng thêm 10/100/1,500",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "and more than that:",
                                    "▪ The drugs have a street value of $30,000 plus."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Thuốc này có trị giá hơn 30000 đô",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ It took me three hours to back up the computer’s 400-plus megabyte memory."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Phải mất ba tiếng để sao lưu bộ nhớ máy tính hơn 400 MB",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "more than before",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "more",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "nhiều hơn",
                            "▪ The new airport will just mean more noise, more traffic problems and higher land prices.",
                            "Sân bay mới sẽ đông nghĩa với nhiều tiếng ồn, nhiều vấn đề giao thông và giá đất cao hơn.",
                            "mmore than : nhiều hơn so với",
                            "▪ I’m sure I weigh more than last year.",
                            "Tôi chắc rằng mình nặng hơn năm ngoái.",
                            "more something than : nhiều hơn cái gì so với",
                            "▪ There are far more game shows on TV than there used to be.",
                            "Có nhiều chương trình truyền hình trên TV hơn hơn trước kia.",
                            "much more/a lot more/a little more etc :hơn rất nhiều/ hơn một chút",
                            "▪ Derek earns a lot more now than he did in his previous job.",
                            "Derek kiếm được nhiều tiền hơn rất nhiều so với công việc trước kia.",
                            "more and morein a number or degree that steadily increases",
                            "ngày càng nhiều",
                            "▪ More and more people are retiring early.",
                            "Ngày càng nhiều người nghỉ hưu sớm.",
                            "▪ It became more and more obvious that the boy was using drugs.",
                            "Càng lúc càng rõ ràng rằng thằng bé đã sử dụng ma túy."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "a growing number",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "/an increasing number  use this when the number of people that are doing something is not yet very large, but is increasing all the time:",
                        "examples": [
                            "số lượng ngày càng tăng",
                            "a growing number/an increasing number of : số lượng ngày càng tăng về",
                            "▪ Hong Kong was having to provide for a growing number of refugees.",
                            "Hồng Kông phải tiếp tế cho một số lượng ngày càng tăng những người tị nạn.",
                            "▪ Milo is one of a growing number of politicians who have become dissatisfied with the current government.",
                            "Milo là một trong số ngày càng tăng các chính trị gia không hài lòng với chính quyền hiện tại.",
                            "an ever-increasing/ever-growing number of :",
                            "a number that is increasing all the time",
                            "số lượng ngày càng tăng",
                            "▪ The islanders are trying to protect their environment from the ever-increasing number of Australian tourists.",
                            "Những cư dân trên đảo đang cố bảo vệ môi trường từ số lượng ngày càng tăng các du khách Úc.",
                            "in growing/increasing numbers : những con số ngày càng tăng",
                            "▪ ‘Suite’ hotels -- with full kitchens and sitting rooms -- are dotting the roadside in increasing numbers.",
                            "Các khách sạn \"suite\" với nhiều nhà bếp và phòng chờ , đang vạch ra rải rác những con số ngày càng tăng."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "increasingly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "continuing to happen more often than before - use this when something is becoming more common but still does not happen all the time:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "càng nhiều",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ As the years passed, Celia became increasingly lonely and withdrawn.",
                                    "Nhiều năm trôi qua, Celia càng trở nên cô đơn và lãnh đạm.",
                                    "▪ Increasingly, people are relying on interactive media for a variety of services.",
                                    "Người ta càng ngày càng phụ thuộc vào phương tiện truyền thông tương tác cho nhiều loại dịch vụ."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "greater",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "use this about a feeling or condition that is stronger or more noticeable than it was before:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "đáng kể",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ After the war, the country began to enjoy greater prosperity.",
                                    "Sau chiến tranh ,quốc gia có được sự thịnh vượng đáng kể.",
                                    "▪ The new legislation gave girls greater access to sports in schools.",
                                    "Luật mới giúp các bé gái được tiếp xúc đáng kể với thể thao trong các trường học."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "greater than : nhiều hơn so với",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The need for people with computing skills is greater than ever before.",
                                    "Nhu cầu những người có các kỹ năng máy tính nhiều hơn so với trước."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "higher",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "use this about prices, speeds, or amounts that are bigger than they were before:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "cao hơn",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ There is now a higher proportion of women in management jobs.",
                                    "Tỉ lệ phụ nữ trong các công việc quản lí trở nên cao hơn.",
                                    "▪ By focusing on quality rather than price, Bangalore’s firms hope to secure higher profit margins.",
                                    "Bằng việc quan tâm đến chất lượng hơn giá cả, công ty của Bangalore hy vọng đảm bảo được lọi nhuận cao hơn."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "higher than : cao hơn so với",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The cost of student accommodation is higher than it was a year ago.",
                                    "Gía của ký túc xá hiện nay cao hơn nhiều so với năm trước."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "more",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [
                            "▪ People are using mobile phones more because they are cheaper."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "more than",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Visitors to the centre complained about the service more than last year."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "more than ever before",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Our future competitiveness and prosperity depend more than ever before on technology and industry."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "more and morecontinuously increasing",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ More and more, we are finding that students lack basic skills when they enter college."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "increased",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "greater than in the past:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "tăng lên",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ After childbirth there is always an increased risk of back trouble.",
                                    "Sau khi sinh luôn tiềm ẩn nguy cơ đau lưng ngày một tăng.",
                                    ".▪ Increased interest in healthy foods and the environment has led to greater consumer influence.",
                                    "Sự quan tâm ngày càng tăng dối với các thực phẩm lành mạnh và môi trường đẫn đến ảnh hưởng tiêu dùng lớn hơn."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "gain ground",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "if a belief, idea etc isgaining ground,more and more people believe it, do it etc:",
                        "examples": [
                            "giành được chỗ đứng",
                            "▪ an approach which is gaining ground in schools",
                            "phương pháp tiếp cận giành được chỗ đứng trong các trường học.",
                            "▪ Evangelical Christianity has been gaining ground since the Second World War.",
                            "Evangelical Christianity đã giành được chỗ đứng kể từ chiến tranh thế giới thứ hai.",
                            "▪ Laurent died in 1853, but his ideas slowly gained ground over the next ten years",
                            "Laurent mất năm 1853, nhưng ý tưởng của anh ấy dần giành được chỗ đứng qua mười năm sau."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "more than sb or st else",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "more",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "having a particular quality or characteristic to a greater degree than someone or something else: hơn",
                        "examples": [
                            "▪ You can see the buildings from the ground, of course, but they look more dramatic from the air.",
                            "Bạn có thể nhìn thấy các tòa nhà từ dưới đất, đương nhiên chugs nhìn trông ứng tượng hơn khi nhìn từ máy bay",
                            "more than: nhiều hon",
                            "▪ Anthony needs to practise more than the other students, but he gets it right in the end",
                            "Abthony cần phải thực hành nhiếu hơn các học sinh khác, nhưng cuối cùng anh ta lại làm dúng",
                            ".more ... than: hơn",
                            "▪ She’s more intelligent than her brothers",
                            "Cô ấy thông minh hơn những người anh của mình",
                            "▪ Most women felt that female bosses were ‘more involved’ than their male counterparts.",
                            "Hầu hết những người phụ nữ thấy rằng các bà chủ \" quan tâm\" nhiều hơn những người cùng trang lứa",
                            "much/far/a little/a lot more: nhiều/xa/ít hơn",
                            "▪ People here are far more friendly than they are in England.",
                            "Mọi người ở đây thân thiện hơn khi họ sống ở Anh",
                            "▪ The old version of Tomb Raider was a lot more limited in scope than this one.",
                            "Phiên bản cũ của TombRaider có nhiều vi phạm hạn chế hơn cái này",
                            "more like: như vậy, giống",
                            "▪ I think you look more like your aunt Margaret than your sister does.",
                            "Tôi nghĩ bạn trông giống dì của bạn Margaret hơn lag chị của bạn"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "higher",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "use this about prices, speeds, or amounts that are bigger than someone else’s:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "cao hơn",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ We tried to calculate the effect of a higher minimum wage on employment and hours worked.",
                                    "Chúng tôi cố gắng tính toán ảnh hưởng của mức lương tối thiểu cao hơn đối với công việc và giờ làm.",
                                    "▪ Janette’s SAT scores were higher than anyone elses.",
                                    "Điểm SAT của Janette cao hơn bất kì ai khác."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "higher something than: cao hơn ở cái gì",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ In the 1960s, Japan achieved a higher rate of economic growth than most other countries.",
                                    "Vào những năm 1960, Nhật Bản đạt được tỉ lệ tăng trưởng kinh tế cao hơn hầu hết các quốc gia khác."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "more",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[quantifier]",
                        "usage": "",
                        "region": "",
                        "definition": "morethan another person, thing, or place: hơn ai đó",
                        "examples": [
                            "▪ The students with more experience help the newcomers get to grips with the course.",
                            "Những học sinh có kinh nghiemj hơn giúp",
                            "more than",
                            "▪ So Claire earns more than you?",
                            "▪ In the study, men showed more concern than the women who took part."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "greater",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "use this about a feeling, quality, or amount that is larger than someone or something else’s:",
                        "examples": [
                            "nhiều hơn",
                            "greater than : nhiều hơn so với",
                            "▪ His understanding of Chinese philosophy is greater than any Westerner’s I’ve met.",
                            "Anh ấy hiểu biết về triết học Trung Quốc nhiều hơn bất cứ người phương Tây nào mà tôi từng gặp.",
                            "greater something than: nhiều hơn cái gì so với",
                            "▪ We enjoy greater freedom than women in many other countries.",
                            "Chúng tôi có được nhiều tự do hơn phụ nữ ở nhiều quốc gia khác."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "to a greater extent/degree",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "[literary][scientific]",
                        "region": "",
                        "definition": "happening more in one situation than in another",
                        "examples": [
                            "đến phạm vi / trình độ lớn hơn",
                            "▪ This theme is developed in the novels of D.H. Lawrence, and to a greater extent E.M. Forster.",
                            "Chủ đề này được xây dựng trong cuốc tiểu thuyết của D.H.Laurence và ở phạm vi lớn hơn là E.M.Forster",
                            "to a greater extent/degree than : phạm vi/ trình độ lớn hơn so với",
                            "▪ Women, to a greater degree than men, tend to start abusing alcohol when they are under pressure at work.",
                            "Phụ nữ với trình độ lớn hơn so với nam giới có xu hướng lạm dụng thức uống có cồn khi gặp áp lực công việc."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "to be more than a particular number or amount",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "outnumber",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if one type of person or thing: vượt trộioutnumbersanother, there are more of the first type than of the second: vượt trội",
                        "examples": [
                            "▪ Women teachers outnumber their male colleagues by two to one. there are twice as many women",
                            "Số lượng giáo viên nữ vượt trội hơn đồng nghieep nữ khoảng hai ba người. nhiều gấp đôi nữ",
                            "greatly/far outnumber: Vượt trội hơn hẳn",
                            "▪ a city where bicycles greatly outnumber cars",
                            "Một thành phố mà số xe đạp vượt trội hơn hản xe hơi"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be more than",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": ": nhiều hơn",
                        "examples": [
                            "▪ The annual revenue is more than $15 billion.",
                            "Doanh thu hàng năm nhiều hơn 15 triều đô",
                            "▪ New Haven’s school drop-out rate is more than double the statewide average.",
                            "tỉ lệ nghĩ học của truong New Haven thị nhiều gấp đôi trung bình những truờng ở Bang khác",
                            "much/many more than: Nhiều hơn rất nhiều",
                            "▪ a young woman who didn’t look to be much more than 20",
                            "Một người phụ nữ không trông nhiều hơn 20 tuổi lắm",
                            "▪ Many cases still go undetected -- many more than are treated.",
                            "Nhiều trường hợp vẫn chưa được phát hiện và rất nhiều trường hợp đã được xư lí"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "exceed",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "[formal]",
                        "region": "",
                        "definition": "to be more than a number or amount, especially a fixed number or limit - used especially in official reports or documents: vượt quá",
                        "examples": [
                            "▪ Legal requirements state that working hours must not exceed 42 hours a week.",
                            "Các yêu cầu về luật phấp số giờ làm việc không được vượt quá 42 giờ trên một tuần",
                            "▪ In the Far East, home computer ownership is expected to exceed that of the US and Europe combined.",
                            "Ở Viễn Đông, việc sở hữu máy tính ở nhà mong rẵng sẽ vượt qua Mỹ và Châu Âu",
                            "exceed something by something: vượt qua cái gì đó",
                            "▪ Births exceeded deaths by a ratio of 3 to 1.",
                            "Tỉ lệ sinh vượt tỉ lệ tử với tỉ lệ 3:1",
                            "far exceed: vượt xa",
                            "▪ Metcalf has achieved 49 touchdowns, far exceeding even those of his famous father.",
                            "Metcaft đạt được 49 lần chạm trán mà vuợt xa người cha nổi tiêng của ông ta"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "outnumber",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if one type of person or thingoutnumbersanother, there are more of the first type than of the second: vượt, hơn",
                        "examples": [
                            "▪ Women teachers outnumber their male colleagues by two to one.",
                            "Nhiều giáo viên nữ đã vượt qua các nam đồng nghiệp gấp 2 lần",
                            "greatly/far outnumber: vượt xa",
                            "▪ a city where bicycles greatly outnumber cars",
                            "Thành phố có lượng xe hơi vượt xa"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be up",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "if profits, sales, income etcare upthey are larger than at a time in the past tăng lên",
                        "examples": [
                            "▪ Most retailers expect sales to be up slightly compared with last year",
                            "Phần lớn các hà bán lẻ mong doanh thu bán hàng tăng lên so với năm ngoái",
                            ".▪ The American Stock Exchange was up 0.6% at 551.63.",
                            "Sở giáo dục chứng khoáng Hoa Kì tang từ 0.6% ở mức 551.63",
                            "be up by: tăng lên",
                            "▪ Support for the president was up by an astonishing 15% in the South.",
                            "Sự ủng hộ tổng thống tăng lên một cách ngạc nhiên là 15% ở phía Nam",
                            "be 10%/12 points etc up: Tăng lên 10%/12 điểm",
                            "▪ Germany’s steel output was 3% up at 11.7 million tons.",
                            "Sản lượng thép của Đức tăng 3% ở mức 11.7 triệu tấn"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "pass",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "if a number or totalpassesan amount, especially one that you have been trying to reach, it is more than that amount and will probably continue to increase: vượt quá",
                        "examples": [
                            "▪ If he stays injury-free, Stumpel should pass his personal best of 76 points",
                            "Nếu anh ấy không bị thương thì anh ấy có lẻ sẽ vượt qua số điêm cao nhất là 76 điểm",
                            "pass the £100/1million etc mark: vượt qua 100 triệu đô",
                            "▪ Visits to our website passed the 100,000 mark in April.",
                            "Lượt truy cập trang web của chúng tôi vượt quá 100000 mức vào tháng tư"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "to become stronger, angrier etc than before",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "get/become",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb]",
                        "usage": "",
                        "region": "",
                        "definition": "",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "trở nên, trở thành",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ As the days passed, Martha became more worried.",
                                    "Khi ngày trôi qua, Martha trở nên lo lắng hơn.",
                                    "▪ As you get older, your joints and muscles tend to get weaker.",
                                    "Khi bạn già hơn, các khớp và cơ có xu hướng trở nên yếu hơn.",
                                    "▪ I knew that if I resisted, he would get even angrier.",
                                    "Tôi biết nếu chống đối thì anh ta sẽ càng giận hơn.",
                                    "▪ The mysterious phone calls were becoming more frequent.",
                                    "Cac cuộc gọi bí ẩn càng trở nên thường xuyên hơn."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "grow in/gain in",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "to gradually get more of a useful or valuable quality:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "tăng lên,có đượt",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The festival has been growing in popularity.",
                                    "Lễ hội ngày càng tăng về số lượng.",
                                    ".▪ The business has continued to grow in productivity and profitability.",
                                    "Doanh nghiệp tiếp tục tăng năng suất và lợi nhuận.",
                                    "▪ She gradually gained in self-confidence and ability.",
                                    "Cô ấy dần có được sự tự tin và năng lực."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "more",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "use this to show that there is more of a quality or feeling than at another time:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "nhiều hơn",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ It will gradually become more cloudy later in the day.",
                                    "Trời dần trở nên nhiều mây hơn trong ngày."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "more ... than :nhiều hơn so với",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ I guess Marlene is more neurotic than she used to be.",
                                    "Tôi đoán rằng Marlene dễ kích động nhiều hơn trước kia."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "a lot/much/far more : hơn rất nhiều",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Everything was much more difficult than it is these days.",
                                    "Mọi thứ từng khó hơn rất nhiều so với ngày nay."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "more and more : càng ngày càng",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The train went more and more slowly, and finally stopped completely.",
                                    "Tàu đi càng ngày càng chậm và cuối cùng dừng hẳn.",
                                    ".▪ We became more and more determined to succeed.",
                                    "Chúng ta càng ngày càng quyết tâm để thành công."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "increasingly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "if someone or something is becomingincreasinglydifficult, important etc, they are continuing to become more difficult, more important etc as time passes:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "ngày càng",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ As she watched him, Jody felt increasingly sure that she had made the right choice.",
                                    "Khi cô quan sát anh ta, Jody ngày càng thấy chắc rằng mình đã đưa ra chọn lựa đúng đắn."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "become/get increasingly : ngày càng trở nên",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ It is getting increasingly difficult for the US to remain competitive in consumer products.",
                                    "Việc duy trì tính cạnh tranh trong các sản phẩm tiêu dùng ngày càng trở nên khó khăn đối với Mỹ."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "heightened",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective only before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "heightenedfeelings are felt more strongly:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "tăng lên,mạnh mẽ hơn",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ heightened concerns about crime and violence in schools."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Các mối lo ngại tăng lên về tội phạm và bạo lực trong các trường học",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ A heightened awareness of healthy eating may lead to considerable benefits.",
                                    "Ý thức tăng lên của việc ăn uống khỏe mạnh có thể mang lại nhiều lợi ích đáng kể."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]