[
    {
        "id": "",
        "name": "plans and arrangements",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "a plan to do sth",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "plan",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "a set of actions for achieving sth in the future, especially a set of actions that has been considered carefully and in detail : kế hoạch",
                        "examples": [
                            "plan for",
                            "The chairman outlined the company’s plans for achieving a 10% growth in sales.",
                            "plan to do something",
                            "There are plans to turn the site of the factory into a park.",
                            "plan A/plan Buse this when you are saying that you have two possible plans, in case the first one is not successful",
                            "Plan A obviously wasn’t going to work, so we had to resort to plan B.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "have a planDon’t worry – I have a plan.",
                            "make plans(= prepare for something )Mary has been busy making plans for her wedding.",
                            "come up with a plan(= think of a plan )The chairman must come up with a plan to get the club back on its feet.",
                            "devise/formulate/draw up a plan(= make a detailed plan, especially after considering something carefully )He devised a daring plan to steal two million dollars.|The company has already drawn up plans to develop the site.",
                            "carry out a plan(= do what has been planned )The bombers were arrested by the security forces before they could carry out their plans.",
                            "keep to/stick to a planWe’re sticking to our original plan.",
                            "abandon/scrap a plan(= decide not to continue with it )The plan was scrapped because it was too expensive.",
                            "announce/unveil a plan(= officially tell people about it )The government unveiled its plans for a shake-up of the health system.",
                            "approve a planThe plan was approved at a board meeting on 24 December.",
                            "reject a planThe plan was rejected on the grounds that it would cost too much money.",
                            "outline a plan(= describe it in a general way )They listened as he outlined his plan.",
                            "implement a planformal(= to do what has been agreed as part of an official plan )To implement its plans, the company has entered into a partnership with another software developer.",
                            "shelve a plan(= not continue with it, although you might continue with it later )The plans will be shelved until an alternative access to the site can be found.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "ambitiousThe plan was very ambitious, but it worked.",
                            "detailedThe generals drew up detailed plans for the invasion.",
                            "cunning/clever/ingeniousThey devised a cunning plan to get back their money.|The gang devised a cunning plan to rob the bank.",
                            "a five-year/ten-year etc planUnesco has a 25-year plan to provide basic education to all.",
                            "a grand plan(= a plan that involves doing a lot of things in order to achieve something big )Marrying the countess was all part of his grand plan.",
                            "a master plan(= a detailed plan for dealing with a complicated situation )The governors came up with a master plan for saving the school.",
                            "a business planWe’ve developed a business plan to take over the company.",
                            "a peace planBoth sides have agreed to implement the UN peace plan.",
                            "a rescue plan(= a plan for saving a company, economy etc )Which rescue plan offers the company the best prospects of survival?",
                            "an action planMy accountant developed a detailed action plan with specific targets.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "go according to plan(= happen in the way that was arranged )If everything goes according to plan, we’ll finish in January.",
                            "a plan of actionMinisters are discussing a plan of action to deal with the crisis.",
                            "a plan of attack(= a plan to attack or achieve something )At this stage, you go back to the office and work on a plan of attack.",
                            "a plan of campaignBritish English(= a plan to achieve something )What we need now is a plan of campaign.",
                            "COMMON ERRORS",
                            "►Do not say 'do a plan'. Saymake a plan."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "strategy",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "a carefully designed plan for achieving something that is difficult and may take a long time: chiến lược",
                        "examples": [
                            "the government’s long-term economic strategy",
                            "strategy for doing something",
                            "a strategy for dealing with crime",
                            "strategy to do something",
                            "a strategy to attract younger audiences to jazz",
                            "strategy of",
                            "The rebels’ strategy of guerrilla warfare has been remarkably successful.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "an economic strategyThe government has changed its economic strategy.",
                            "a business strategyThis is a high-risk business strategy.",
                            "a marketing strategyThe firm is considering a change in its marketing strategy.",
                            "a political strategyBaldwin’s political strategy was almost totally successful.",
                            "a coping strategyTherapists can show a child new coping strategies.",
                            "a survival strategyHe says his father’s withdrawal was a survival strategy.",
                            "a successful/effective strategyThe most successful strategy is often the simplest one.",
                            "a clear/coherent strategyIt is important that the company has a clear strategy.",
                            "a high-risk strategyThe expansion plan is a high-risk strategy.",
                            "a long-term strategyThe closure of these branches is part of our long-term strategy.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "use a strategy(alsoemploy a strategyformal)What strategies do you use to deal with these problems?",
                            "adopt a strategy(= start to use it )Both players adopted the same strategy.",
                            "devise/work out a strategy(alsoformulate a strategyformal)We had to devise strategies for saving money.",
                            "develop a strategyGroups can help members develop new coping strategies.",
                            "evolve a strategyThe creatures which live in the river have evolved strategies for surviving sudden floods.",
                            "pursue/follow a strategy(= do a particular planned series of actions )They are pursuing different strategies.",
                            "implement a strategyformal(= do a series of actions that you or someone else has planned )The firm faces several challenges as it seeks to implement that strategy.",
                            "a strategy worksThe Government’s economic strategy was not working."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "programme",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "British /programAmerican  a series of activities, organized by a government or other large organization, that is designed to achieve something important and will continue for a long time: chương trình",
                        "examples": [
                            "the US space program",
                            "programme to do sth",
                            "a United Nations programme to control the spread of AIDS",
                            "programme of",
                            "a programme of economic reforms",
                            "The irrigation project is part of a programme of aid to West Africa.",
                            "launch a programme",
                            "The government has launched a programme to help unemployed young people find work.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "a training/research/space etc programme",
                            "It’s a major research program, aimed at developing cheaper fuels.",
                            "an economic programmeThe party did not have a clear economic programme.",
                            "a development programmeThis project is a central part of the development programme for the area.",
                            "a reform programmeAfter the elections, they embarked on an ambitious reform programme.",
                            "an expansion programmeThe company’s aggressive expansion program will double the size of the chain in the next four years.",
                            "a building programmeWe will continue with our hospital building programme.",
                            "a spending programmeThe government’s spending programme is the subject of vigorous debate.",
                            "the space programme(= for sending vehicles into space )He was involved in the Soviet space programme.",
                            "a major/massive programmeA major programme of modernisation is transforming public transport in London.",
                            "an ambitious programmeThe European Community embarked on an ambitious programme of research.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "embark on/launch a programme(= start it )The company has embarked on an expansion programme.",
                            "carry out a programme(alsoimplement a programmeformal)They attempted to implement a programme of reform."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "plan of action",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "/ game planinformala detailed plan explaining exactly how to achieve something: kế hoạch hành động",
                        "examples": [
                            "▪ Here’s my game plan, Roger. I want to make the magazine a monthly, and cut it down to sixty or seventy pages.",
                            "decide/devise/put forward etc a plan of action",
                            "▪ If the problem continues, discuss a plan of action with your colleagues."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "policy",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "a plan or set of principles agreed by the members of a government, a political group, a company etc, that says how they intend to deal with a particular subject or problem:chính sách",
                        "examples": [
                            "It is not our policy to reveal our clients’ names.",
                            "policy on/towards",
                            "government policy on higher education",
                            "US policy towards China",
                            "the government’s policy on Europe",
                            "The Cuban revolution resulted in a reassessment of Washington’s policy towards the Third World generally.",
                            "policy of",
                            "A new ruler might adopt a policy of drastically cutting back oil production in order to boost prices.",
                            "it is (sb’s) policy to do sth",
                            "It is hospital policy to screen all mothers with certain risk factors.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "government/public/state policyGovernment spending is determined by government policy.",
                            "party policyState ownership is party policy.",
                            "company/hospital/university etc policyIt is not company policy to offer refunds.",
                            "foreign policySupport for human rights is a key element in our foreign policy.",
                            "economic/fiscal policyThe middle classes have suffered most as a result of government economic policies.",
                            "defence/energy/housing etc policyOur energy policies must put the environment first.",
                            "a deliberate policySome customers pursue a deliberate policy of delaying payment.",
                            "a clear policyThere was no clear policy on this matter.",
                            "a coherent policy(= one in which all the parts of the policy work well together )A long-term coherent policy for industry is needed.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "formulate/develop a policyWe try to formulate policies that will meet the needs of the people.",
                            "make policy(= decide what it will be )A committee of representatives makes policy.",
                            "shape policy(= develop it or have an influence on it )These terrorist acts will not be allowed to shape our foreign policy.",
                            "adopt a policy(= use one )He adopted a policy of radical reform.",
                            "implement a policy(= take action in the way that has been decided )Local government is responsible for implementing central government policy.",
                            "pursue/follow a policy(= continue with a policy over a period of time )The organization is pursuing a policy of cost cutting.",
                            "reverse a policy(= stop a policy and change it )The new government set about reversing previous policies.",
                            "a policy aims at something/to do something(= tries to achieve something )The policy aimed to reduce the budget deficit.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "a policy decisionNo policy decision can be made until the next meeting.",
                            "a policy statementThere has been no policy statement on this from the French government.",
                            "a policy changeThere have been numerous policy changes in recent months.",
                            "a policy issueHe rarely consulted him on general policy issues.",
                            "a policy maker(= someone who decides on what it should be )Policy makers have not dealt with the issue very effectively.",
                            "a policy objectiveHow can we best achieve our policy objectives?",
                            "a policy initiative(= something done to achieve a policy's goals )The policy initiatives have focused on the inner cities.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "a change of/in policyThis decision represented a major change in policy.",
                            "a shift in policy(= a small change )The shift in policy placed more emphasis on teachers' assessments of students' progress.",
                            "a reversal of policy(= a change back to what it was before )The strength of this opposition forced a rapid reversal of policy.",
                            ""
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "scheme",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "British Englishan official plan that is intended to help people in some way, for example by providing education or trainingSYN programAmerican English: kế hoạch",
                        "examples": [
                            "The money will be used for teacher training schemes.",
                            "scheme for",
                            "schemes for two new cross-city lines",
                            "scheme to do sth",
                            "a new scheme to boost exports",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "a major schemeThe government is introducing a major housebuilding scheme in the area.",
                            "a new schemeThe new scheme aims to reduce street crime by 30%.",
                            "an innovative scheme(= using new ideas )an innovative scheme to help the unemployed get back to work",
                            "a grand scheme(= trying to achieve a lot )In the end, the government’s grand scheme came to nothing.",
                            "a pilot scheme(= one that is tried on a small scale first to see if it is a good idea )The programme was introduced into 100 primary schools in a very successful pilot scheme.",
                            "a training schemeThe company runs an apprentice training scheme.",
                            "a pension schemeDoes your employer offer a pension scheme?",
                            "a compensation/bonus etc scheme(= in which people receive compensation, a bonus etc )a new compensation scheme for accident victims",
                            "an incentive scheme(= in which people receive money to persuade them to work harder )There is a generous incentive scheme for the sales force.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "introduce/launch a schemeThe scheme was launched last autumn by the company’s education officer.",
                            "run/operate a schemeParent volunteers help run the scheme.",
                            "be covered by a scheme(= be able to benefit from a scheme )All employees are covered by the new bonus scheme."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "blueprint",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "a completely new plan for important changes or ways of dealing with a problem: bản kế hoạch chi tiết",
                        "examples": [
                            "blueprint for",
                            "Conservation groups have suggested a blueprint for a ‘Green World’.",
                            "A panel of advisors is urging The White House to adopt a blueprint for dealing with such emergencies."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "ways of saying that sth is being planned",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "in the pipeline",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "be  if sth such as a new product or a change is in the pipeline, it is being planned and prepared and it will be ready soon:được soạn, lên kế hoạch, sắp được thông qua",
                        "examples": [
                            "▪ After considerable market research, several new products are now in the pipeline.",
                            "▪ There are one or two important changes in the pipeline."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "in the planning stages U",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "be in the planning stagesalsobe at the planning stageUK  if sth such as a product is in the planning stages, it is being planned, but the final details have not yet been decided:trong giai đoạn dự kiến, đang được lên kế hoạch",
                        "examples": [
                            "A new museum is currently at the planning stage at Bowness.",
                            "The programme is only in the planning stages, and is not likely to be broadcast until next year."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "afoot",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[non-attri]",
                        "usage": "",
                        "region": "",
                        "definition": "if sth new, interesting, strange, or dishonest is afoot, sb is planning it, especially secretly:đang tiến hành, đan được lên kế hoạch",
                        "examples": [
                            "▪ From information received, it was thought that some illegal activity was afoot.",
                            "▪ A quick look round the research and development facility in Versailles revealed a number of interesting software projects afoot.",
                            "plans/changes/moves etc are afoot",
                            "▪ Plans are now afoot for an important exhibition of Canaletto in England.",
                            "▪ Apparently, moves are afoot to ban smoking in public places."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "not yet",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "arrangement",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[C or U]",
                        "usage": "",
                        "region": "",
                        "definition": "sth that has been organized or agreed onSYN agreement:dàn xếp, tthoả thuận",
                        "examples": [
                            "arrangement between",
                            "An arrangement between the two couples ensured there was always someone to look after the children.",
                            "arrangement with",
                            "The school has an arrangement with local businesses.",
                            "an arrangement to do sth",
                            "Maxine cancelled our arrangement to meet.",
                            "come to an/some arrangement (with sb)(= make an agreement that is acceptable to everyone )",
                            "It would usually cost $500, but I’m sure we can come to some kind of arrangement.",
                            "Pets are permitted at the resortby prior arrangement."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "itinerary",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[ C ]",
                        "usage": "",
                        "region": "",
                        "definition": "noun hành trình",
                        "examples": [
                            "a detailed plan or route of a journey",
                            "_The tour operator will arrange transport and plan your itinerary."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "campaign",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[C noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a planned group of especially political, business or military activities which are intended to achieve a particular aim : chiến dịch, cuộc vận động.",
                        "examples": [
                            "This is the latest act of terrorism in a long-standing and bloody campaignof violence.",
                            "She's the campaignorganizerfor the Labour Party.",
                            "a vigorous campaign: a very strong campaign",
                            "Clark’s vigorous campaign against the dumping of nuclear waste will continue.",
                            "campaign for/against",
                            "the Campaign for Nuclear Disarmament.",
                            "Our campaign against drug abuse is supported by the medical profession.",
                            "campaign to do sth",
                            "The government’s campaign to recruit more black police officers has not been a success.",
                            "----------------------------------------------------------------------------------------------------------------",
                            "launch/mount a campaign",
                            "Environmental groups launched a campaign against the widespread production of genetically modified crops.",
                            "The government have just launchedtheir annual Christmas campaigntostop drunken driving.",
                            "----------------------------------------------------------------------------------------------------------------",
                            "campaign/kæmˈpeɪn/ [I verb] [C1] to work for a long time, for example making speeches, writing to newspapers and political representatives etc, in order to persuade people that something needs to be done : đi vận động",
                            "After months of campaigning, local parents have persuaded the council to provide a school bus service.",
                            "campaign for",
                            "Women campaigned for equal pay and equal rights throughout the 1960s.",
                            "campaign to do sth",
                            "He was one of the people who campaigned to change the law on homosexuality.",
                            "----------------------------------------------------------------------------------------------------------------",
                            "campaigner[C noun]",
                            "During his years as a human rights campaigner he was arrested seven times."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "plan",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "A2",
                        "partOfSpeech": "[C]",
                        "usage": "",
                        "region": "",
                        "definition": "sth you have decided to do :",
                        "examples": [
                            "His plan is to get a degree in economics and then work abroad for a year.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "have plansI have no plans to retire yet.",
                            "change your plansWe had to change our plans at the last minute.",
                            "abandon/give up your plansThe city authorities have abandoned their plans to host the Super Bowl.",
                            "cancel your plansThe weather got worse, and we had to cancel our plans to have the party outdoors.",
                            "shelve a plan(= cancel your plan, although you may do it later )The plan had to be shelved because of lack of money.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "a change of planThe day before my flight, my boss phoned and said there’d been a change of plan.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "sb’s immediate plans(= what they are going to do next )So what are your immediate plans after graduation?",
                            "the best planBritish English(= the best thing to do )I think the best plan is to take the train."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "preparations for sth to happen",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "arrangements",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[C usually P]",
                        "usage": "",
                        "region": "",
                        "definition": "arrangement plans and preparations that you must make so that something can happen :sự sắp đặt, sắp xếp",
                        "examples": [
                            "Have you made all your travel arrangements?",
                            "arrangement for",
                            "I’ve agreed to help with arrangements for the party.",
                            "The family made arrangements for his body to be flown back.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "make arrangementsYou are advised to make travel arrangements well in advance.",
                            "take care of the arrangementsthu xếp, chuẩn bị cho",
                            "Don’t worry about finding a place to stay. My department will take care of the arrangements.",
                            "discuss the arrangementsWe need to discuss the wedding arrangements.",
                            "finalize the arrangementsI’m meeting him tomorrow to finalize the arrangements.",
                            "upset the arrangements(= cause problems which spoil the arrangements )I don’t want to upset your arrangements.",
                            "---------------------------------------------------------------------------------------------------------------------",
                            "alternative arrangementsIf the flight is cancelled you’ll have to make alternative arrangements.",
                            "special arrangements(= particular preparations other than those usually made )Please inform us if any guests have disabilities or need any special arrangements.",
                            "security arrangementsHe was in charge of security arrangements for the President’s visit.",
                            "financial arrangementsAs treasurer, you’re responsible for all the financial arrangements.",
                            "travel arrangementsI’ll make my own travel arrangements.",
                            "holiday arrangementsBritish English We don’t have any holiday arrangements yet.",
                            "seating/sleeping arrangements(= plans for where people will sit/sleep )What are the seating arrangements for dinner?"
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]