[
    {
        "id": "",
        "name": "virtue and moral good",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "when it is right or reasonable to do something",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "right",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/raɪt/  use this to talk about what someone has done or may do, to say that you agree with it because it seems fair or reasonable:đúng đắn",
                        "examples": [
                            "right to do something",
                            "đúng khi làm gì đó",
                            "▪ You were right to complain - the food was cold.",
                            "Bạn đã đúng khi phàn nàn - thức ăn nguội hết rồi.",
                            "▪ The screenwriter was right to focus on just one aspect of a long and complicated novel.",
                            "Người viết kịch đã đúng khi chỉ tập trung vào 1 khía cạnh của trong 1 cuốn tiểu thuyết dài và phức tạp.",
                            "the right thing to do",
                            "thứ đúng đắn để làm",
                            "▪ I took a pay cut to come here, but I’m sure it was the right thing to do.",
                            "Tôi đã phải mất lương để đến đây nhưng tôi chắc chắn rằng đó là điều đúng đắn để làm.",
                            "do the right thing",
                            "làm điều đúng đắn",
                            "▪ Do the right thing - turn off the TV and get the kids playing outside.",
                            "Hãy làm điều đúng đắn - tắt TV và để đám trẻ chơi đùa bên ngoài."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "justifiable",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[adjective not usually before noun]",
                        "usage": "",
                        "region": "",
                        "definition": "justified/ˈdʒʌstɪfaɪd, ˈdʒʌstəfaɪd/  if you say that someone is justified in doing something, or that something they do is justified, you believe what they do is reasonable in that situation:chính đáng, hợp lý",
                        "examples": [
                            "▪ I don’t think Colin’s criticisms were really justified.",
                            "Tôi không nghĩ rằng những lời chỉ trích của Colin thật sự hợp lý.",
                            "be/feel justified in doing something",
                            "cảm thấy chính đáng khi làm cái gì đó",
                            "▪ The government feels justified in using military force to protect its own citizens.",
                            "Chính phủ cảm thấy chính đáng khi dùng lực lượng để bảo vệ công dân của họ.",
                            "▪ The landlord may be justified in charging for any additional work that needs to be done.",
                            "Chủ nhà có lẽ cho việc tính thêm phụ phí là chính đáng."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "I don't blame sb",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "usage": "",
                        "region": "",
                        "definition": "I don’t blame somebody/aɪ ˌdəʊnt ˈbleɪm somebody/ spoken informal say this when you can understand why someone has behaved in a particular way, and you think they were right:",
                        "examples": [
                            "Tôi không trách ai đó",
                            "▪ ‘Sheila’s left her husband.’ ‘Well, I don’t blame her!’",
                            "Sheila vừa bỏ chồng nhưng tôi không trách cô ta.",
                            "I don’t blame sb for (doing) something",
                            "Tôi không trách ai đó vì đã làm gì đó",
                            "▪ I don’t blame you for losing your temper with Ann.",
                            "Tôi không trách ai đó vì đã mất bình tĩnh với Ann.",
                            "▪ It may have been a joke, but you can’t blame the women in the department for being angry.",
                            "Chỉ là đùa thôi nhưng bạn không thể trách những người phụ nữ trong văn phòng vì đã nổi giận."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "reasonable",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈriːzənəbəl/  if an action is reasonable, it is fair and sensible:hợp lý",
                        "examples": [
                            "▪ Campaigners say that there is no reasonable objection to women becoming priests.",
                            "Các nhà vận động cho rằng phản đối việc phụ nữ trở thành linh mục là không hợp lý.",
                            "it is reasonable to do something",
                            "hợp lý khi làm việc gì đó",
                            "▪ It is reasonable to expect members to pay a small fee.",
                            "Khá hợp lý khi mong đợi thành viên sẽ trả 1 khoảng phí nhỏ.",
                            "▪ It is reasonable to assume watching a lot of television at an early age interferes with development.",
                            "Có thể hợp lý khi cho rằng nếu thanh niên xem TV nhiều sẽ ảnh hưởng đến sự phát triển.",
                            "it is reasonable that",
                            "hợp lý khi",
                            "▪ It is reasonable that a prospective employer should want to know if someone has a criminal record.",
                            "Hợp lý khi chủ lao động muốn biết trước rằng nhân viên họ tuyển có tiền án hình sự không.",
                            "reasonably [adverb]",
                            "1 cách hợp lý",
                            "▪ Alison can’t reasonably be expected to do the work of two people.",
                            "Không hợp lý khi mong Alison có thể làm khối lượng công việc của hai người."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "justified",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "justifiable/ˈdʒʌstɪfaɪəbəl, ˈdʒʌstəfaɪəbəl/  a justifiable feeling, action, or reaction is acceptable because there is a good reason for it:hợp lý, chính đáng",
                        "examples": [
                            "▪ Can violence ever be a justifiable method of protest?",
                            "Có chính đáng không khi xem bạo lực là 1 phương pháp phản kháng?",
                            "▪ Reed said the tax increases were not only justifiable, but unavoidable.",
                            "Reed nói rằng việc tăng thuế không chỉ chính đáng mà bạn cũng không tránh nó được.",
                            "▪ Is football a justifiable expense when the college cannot afford enough English classes to meet students’ needs?",
                            "Việc chi tiêu cho hoạt động đá bóng có hợp lý không khi trường đang gặp khó khăn trong việc đáp ứng nhu cầu về số lượng lớp dạy Tiếng Anh cho sinh viên.",
                            "justifiably[adverb]",
                            "một cách chính đáng",
                            "▪ The company can justifiably claim that it has met all its obligations.",
                            "Công ty có thể hợp lý khi cho rằng họ đã hoàn thành hết mọi nghĩa vụ của mình."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "legitimate",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "/lɪˈdʒɪtəmət, ləˈdʒɪtəmət/  fair, correct, or reasonable according to accepted rules, facts, or standards of behaviour:hợp pháp, chính đáng",
                        "examples": [
                            "▪ He had a legitimate reason for being late.",
                            "Anh ta có lý do chính đáng cho việc đi trễ.",
                            "▪ The way governments treat their people is a legitimate concern for the international community.",
                            "Phương cách chính phủ đối xử với công dân là mối quan tâm chính đáng của cộng đồng quốc tế.",
                            "it is legitimate to do something",
                            "Hợp pháp, chính đáng khi làm gì đó",
                            "▪ It is legitimate to suggest that taxes should affect people with higher incomes more than they affect poorer people.",
                            "Hợp pháp khi đề nghị thừa nhận rằng thuế ảnh hưởng mạnh đến người có thu nhập cao hơn người có thu nhập thấp.",
                            "legitimately[adverb]",
                            "1 cách hợp pháp, chính đáng",
                            "▪ You could legitimately argue that the best way to bring down pollution levels is to ban cars completely.",
                            "Bạn có thể tranh luận 1 cách hợp pháp rằng cách tốt nhất để giảm thiểu mức độ ô nhiễm là cấm hoàn toàn xe lưu thông."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "to have a good reason for thinking or doing st",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "have a right to be scared/proud/happy etc",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[verb phrase not in progressive]",
                        "usage": "",
                        "region": "",
                        "definition": "/hæv ə ˈraɪt tə biː ˌskeəʳd/  to have a good reason to behave in a particular way, especially in a way that you would not normally behave, or in a way that other people would usually disapprove of:có quyền sợ/tự hào/hạnh phúc",
                        "examples": [
                            "▪ She’s just got her exam results; she has the right to be proud of herself.",
                            "Cô ấy vừa có kết quả kiểm tra, cô ấy có quyền tự hào về bản thân.",
                            "▪ The problems are genuine and people have the right to be concerned.",
                            "Thật sự có vấn đề và họ có quyền lo lắng về nó.",
                            "have every right to be somethinghave a very good reason to feel something",
                            "Hoàn toàn có quyền làm điều gì đó",
                            "▪ After what happened last time we bought a car, I think we have every right to be wary.",
                            "Sau những gì đã xảy ra khi chúng tôi mua chiếc xe hơi lần trước, chúng tôi hoàn toàn có quyền để cảnh giác hơn."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "justly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈdʒʌstli/  if you are justly proud, angry, critical etc, you have a good reason for feeling this way or reacting in this way:chính đáng, đúng thật",
                        "examples": [
                            "▪ The Chinese are justly proud of their ancient culture.",
                            "Chính đáng khi người Trung Quốc rất tự hào về truyền thống văn hóa cổ xưa của mình.",
                            "▪ The press has been justly critical of the delays in paying compensation.",
                            "Báo chí đã chính đáng khi phê phán việc chậm trễ trong bồi thường thiệt hại.",
                            "▪ Bordeaux is an area of France justly famous for its red wine.",
                            "Bordeaux đúng thật là 1 vùng rất nổi tiếng về rượu vang đỏ."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "good cause/reason",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˌgʊd ˈkɔːz, ˈriːzən/  if someone does something, feels something, or thinks something with good cause or good reason, they have a good reason for what they do or think or feel:có lý do chính đáng",
                        "examples": [
                            "have good cause/reason to do something",
                            "▪ The coach, watching his team, feels he has good reason to expect them to win.",
                            "Huấn luyện viên dõi theo đội của ông ấy và ông có lý do chính đáng để mong rằng đội ông sẽ thắng.",
                            "for good cause/reason",
                            "có lý do chính đáng cho việc gì đó",
                            "▪ The company has been held up as a model employer, and for good reason. They have a good training program and excellent benefits.",
                            "Công ty đó được xem là 1 nhà tuyển dụng kiểu mẫu và có lý chính đáng cho điều này. Đó là họ có 1 chương trình huấn luyện tốt và những lợi ích tuyệt vời.",
                            "with good cause/reason",
                            "với lí do chính đáng",
                            "▪ She is a jealous wife, and with good cause.",
                            "Cô ấy là bà vợ hay ghen nhưng với lí do chính đáng."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "rightly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈraɪtli/  formal if someone says or does something rightly, they are right and have good reasons to say it or do it: đúng đắn, hợp lý",
                        "examples": [
                            "▪ The U.S. is rightly cautious about becoming involved.",
                            "Hoa Ky đã đúng đắn khi thận trọng với việc tham gia vào.",
                            "▪ Taxpayers rightly expect the government to be careful about spending.",
                            "Hợp lý khi người đóng thuế mong muốn chính phủ sẽ cẩn thận trong việc chi tiêu tiền thuế.",
                            "rightly so",
                            "đúng như vậy",
                            "▪ Residents are outraged, and rightly so.",
                            "Các cư dân đã bị xúc phạm và đúng như vậy.",
                            "quite rightly",
                            "khá đúng đắn",
                            "▪ Investors have quite rightly avoided this stock.",
                            "Khá đúng đắn khi các nhà đầu tư tránh gói cổ phiếu này."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "to show that st is right to do",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "justify",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "",
                        "partOfSpeech": "[transitive verb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ˈdʒʌstɪfaɪ, ˈdʒʌstəfaɪ/  to explain or show that there are good reasons for doing something that seems wrong to most people:bào chữa, biện minh, biện hộ",
                        "examples": [
                            "▪ How can you justify a 200% pay rise!",
                            "Làm thế nào bạn có thể biện minh cho việc tăng lương gấp đôi!",
                            "▪ People try to justify the breakdown of their marriage by blaming their spouse.",
                            "Con người thường cố đổ lỗi cho vợ hoặc chồng họ để biện hộ cho sự đổ vỡ hôn nhân của mình.",
                            "justify doing something",
                            "biện minh cho việc gì đó",
                            "▪ I don’t think anyone can justify spending so much money on weapons.",
                            "Tôi không nghĩ ai có thể biện minh cho việc đổ nhiều tiền vào việc trang bị vũ khí."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]