[
    {
        "id": "",
        "name": "BETWEEN",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "between two or more people or things",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "between",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[preposition/adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/bɪˈtwiːn/  if someone or something is between two or more people or things, the people or things are on either side of it:giữa (hai hoặc nhiều người, vật)",
                        "examples": [
                            "▪The ball rolled between the goalkeeper’s legs.",
                            "Quả bóng đã lăn giữa hai chân thủ môn.",
                            "▪ I had to sit between my two little brothers at dinner.",
                            "Tôi phải ngồi giữa hai em trai của tôi trong bữa tối.",
                            "▪ The house is somewhere between here and the airport.",
                            "Ngôi nhà ở đâu đó giữa chỗ này và sân bay.",
                            "▪ Between the trees and the river, the slope was covered with beautiful daffodils.",
                            "Giữa cây cối và dòng sông, condốc được bao phủ bởi những bông hoa thủy tiên hoa xinh đẹp."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "halfway between nửa đường giữa",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪Barnegat Books is situated on Eleventh Street, about halfway between Broadway and University Place."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Barnegat Books nằm trên phố Eleventh, khoảng nửa đường giữa Broadway và University Place",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "in between",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[preposition/adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪn bɪˈtwiːn/  in the space that separates two or more things or people:",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "giữa (không gian chia cách hai hoặc nhiều người, vật)",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ She found a small pool in between the rocks.",
                                    "Cô ấy tìm thấy một hồ bơi nhỏ giữa những tảng đá.",
                                    "▪ Why don’t you put the television in between the bookcase and the window?",
                                    "Tại sao bạn không đặt tivi ở giữa kệ sách và cửa sổ?",
                                    "▪ Rachel got in between Rob and Chris for a better view.",
                                    "Rachel đã ở giữa Rob và Chris để nhìn được tầm nhìn tốt hơn.",
                                    "▪ The farmer knocked off the lumps of earth in between the blades of his plough.",
                                    "Người nông dân đã loại bỏ cục đất ở giữa lưỡi cày của mình."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "among",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[preposition]",
                        "usage": "",
                        "region": "",
                        "definition": "/əˈmʌŋ/  in a group of people or things that are all around you:giữa, trong số (nhiều người, nhiều vật vây lấy)",
                        "examples": [
                            "▪ I saw him standing among a group of students.",
                            "Tôi thấy anh ta đang đứng giữa một nhóm sinh viên.",
                            "▪ The house was hidden among the trees.",
                            "Ngôi nhà ẩn giữa những tán cây.",
                            "▪ We helped Mom search for her wedding ring among the rocks below the boardwalk.",
                            "Chúng tôi đã giúp mẹ tìm kiếm chiếc nhẫn cưới của bà trong số những tảng đá nằm dưới lối đi."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "in the middle",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "/ɪn ðə ˈmɪdl/  if someone or something is in the middle, they are in the centre of a group or row with one or more people or things on either side of them:ở giữa (trung tâm)",
                        "examples": [
                            "▪Cindy and Marcia sat at either end of the sofa with me in the middle.",
                            "Cindy và Marcia ngồi ở cuối hai ghế sofa với tôi ở giữa.",
                            "▪ Here’s a photo of my brother’s baseball team -- that’s Sean in the middle.",
                            "Đây là một bức ảnh đội bóng chày của anh tôi - đó là Sean ở giữa."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "in the middle of ở giữa (cái gì đó)",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪Just over the hill we saw a pond in the middle of the pines.",
                                    "Ngay phía trên ngọn đồi chúng ta đã thấy một cái ao ở giữa những cây thông."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "be sandwiched between",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[verb phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "/biː ˈsænwɪdʒd bɪˌtwiːnǁ-ˈsændwɪtʃt-/  to be between two people or things that are so close that there is not enough space to move:bị kẹp giữa",
                        "examples": [
                            "▪I spent a very uncomfortable evening at the concert sandwiched between two very large ladies.",
                            "Tôi đã trải qua một buổi tối rất khó chịu tại buổi hòa nhạc khi bị kẹp giữa hai người phụ nữ quá khổ.",
                            "▪ Alan got back to the parking lot only to find his car sandwiched between a pick- up and a big truck.",
                            "Alan trở lại bãi đậu xe chỉ để phát hiện chiếc xe của anh ta đang bị kẹp giữa một xe pick-up và một chiếc xe tải lớn."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]