[
    {
        "id": "",
        "name": "polite",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "words for describing someone who is polite",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "polite",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is polite follows the rules of social behaviour and shows respect for other people and their feelings: lịch sự, lịch thiệp",
                        "examples": [
                            "▪ He seemed a very polite young man.",
                            "Anh ta dường như là một thanh niên lịch sự",
                            "▪ a polite requestit is polite to do something",
                            "Một yêu cầu lịch sự là lịch sự để làm gì đó",
                            "▪ I didn’t really care what she thought about the book, but I thought it would be polite to ask her.",
                            "Tôi không quan tâm cái mà cô ấy nghĩ về cuốn sách, nhưng tôi nghĩ sẽ lịch sự nếu tôi hỏi cô ấy",
                            "▪ It’s not considered polite to ask someone how much they earn.",
                            "Điều không được xem là lịch sự là khi hỏi ai đó kiếm được bao nhiêu tiền",
                            "polite to: lịch sự với",
                            "▪ She’s always extremely polite to me, but I never know what she’s really thinking.",
                            "Cô ấy luôn cực kì lịch thiệp với tôi, nhưng tôi không bao giờ biết những điều mà cô ấy nghĩ",
                            "make polite conversationtalk politely about unimportant things, especially to someone you do not know very well: nói chuyện lịch sự",
                            "▪ The last thing I felt like doing was making polite conversation with my roommate’s parents.",
                            "Điều cuối cùng tôi cảm thấy muốn làm là nói chuyện lịch sự với ba mẹ của bạn cùng phòng",
                            "politely[adverb] một cách lịch sự",
                            "▪ ‘I hope your mother is well?’ he asked politely.",
                            "Tôi hy vọng mẹ của bạn sẽ ổn, anh ấy hỏi thăm một cách lịch sự"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "respectful",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "showing proper respect for someone who is older than you, has a higher position than you etc: lễ phép, kính cẩn",
                        "examples": [
                            "▪ They waited in respectful silence as the funeral procession went past."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Họ chờ đợi trong sự tĩnh lặng kính cẩn vì đám tang đi qua",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "respectful to/towards: lễ phép với..",
                                    "▪ If children were taught to be more respectful towards their elders, maybe these crimes wouldn’t happen so often."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Nếu trẻ nhỏ được dạy lễ phép hơn đối với người lớn hơn, có lẽ tội phạm sẽ không xảy ra thường xuyên",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "civil",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "polite in a rather formal way, without necessarily being friendly: lịch sự",
                        "examples": [
                            "▪ I expect a civil answer when I ask you a question.",
                            "Tôi mong đợi câu trả lời lịch sự khi tôi đặt câu hỏi cho bạn",
                            "civil to/towards: lịch sự với",
                            "▪ I wish you’d be a little more civil towards our guests.",
                            "Tôi mong bạn sẽ lịch sự nhiều hơn với khác",
                            "civilly[adverb] một cách lịch sự",
                            "▪ She tried to speak to him civilly, in spite of the bitterness that she still felt towards him.",
                            "Cô ấy cố gắng nói chuyện một cách lịch sự với anh ta mặc sự bực bội mà cô ấy đối với anh ta",
                            "civility/sɪˈvɪləti, səˈvɪləti/ [uncountable noun] phép lịch sự",
                            "▪ Throughout my stay on the island I was treated with the utmost civility extremely civilly by everyone there.",
                            "Trong suốt thời gian lưu trú trên đảo, tôi đã được mọi người đối xử hết sức lịch sự"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "courteous",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is courteous is polite and considers the needs of other people, especially in formal situations when you do not know the other people well: lịch sự, nhã nhặn",
                        "examples": [
                            "▪ Airline staff must be courteous at all times, even when passengers are not.",
                            "Nhân viên hàng không phải lịch sự cả ngày mặc dù hành khác thì không",
                            "▪ I received a courteous letter from Jane’s mother thanking me for my help.",
                            "Tôi nhận được một bức thư lịch sự từ mẹ của Jane cảm ơn tôi đã giúp đỡ",
                            "courteous to: lịch sự với..",
                            "▪ He was always kind and courteous to me, but we never really became friends.",
                            "Anh ta luôn tử tế và lịch sự với tôi, nhưng chúng tôi không bao giờ thực sự trở thành bạn",
                            "courteously[adverb] một cách lịch sự",
                            "▪ Customers are always treated courteously in our stores.",
                            "Khách hàng luôn được đối xử một cách lịch sự trong cửa hàng"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "well-mannered",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is well-mannered has good manners, and always knows the correct way to behave in social situations: lịch thiệp, lịch sự",
                        "examples": [
                            "▪ Henry was a typical Oxford man - well-mannered, easy-going, and very sure of himself."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Henry là người đàn ông điển hình của Oxford, lịch thiệp, dễ chịu và tự tin",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ The children were good little things, well-mannered, and beautifully dressed."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Những đứa nhỏ rất tốt, lịch sự và ăn mặc đẹp",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "careful not to upset or embarrass sb",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "tactful",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "careful not to mention something that may upset or embarrass someone:",
                        "examples": [
                            "khéo, lịch thiệp",
                            "▪ Mandy thought her mother’s outfit was a little too fancy, but was too tactful to say so",
                            "Mandy nghĩ bộ trang phục của mẹ cô ấy quá lạ, nhưng mà quá khéo để nói vậy",
                            "it is tactful of somebody to do something: lịch thiệp với ai đó để làm...",
                            "▪ It wasn’t very tactful of you to ask whether he’d put on weight.",
                            "Rất không lịch thiệp với bạn khi hỏi anh ta có tăng cân hay không",
                            "a tactful way of doing something:cách lịch thiệp để làm",
                            "▪ ‘Besides...’ Melissa hesitated, trying to think of a tactful way of telling him the truth.",
                            "\"bên cạnh đó..\" Melissa do dự và cố gắng nghĩ ra cách để nói với anh ấy sự thật",
                            "tactfully[adverb] một cách lịch thiệp",
                            "▪ Clare tactfully changed the subject when someone started talking about weddings.",
                            "Clare khéo léo thay đổi chủ đề khi mọi người bắt đầu nói về đám cưới",
                            "tactfuladjectivekhéo xử, lịch thiệp",
                            "careful not to say or do anything that could upset someone",
                            "_Mentioning his baldness wasn't very tactful."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "diplomatic",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "skilful in the way that you deal with other people, and carefully avoiding saying anything that might offend or annoy them: khôn khéo",
                        "examples": [
                            "A good secretary needs to be efficient, and above all diplomatic.",
                            "Robson was trying to be as diplomatic as possible - he didn’t want to risk losing a promotion."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "discreet",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is discreet is careful not to say anything that will embarrass another person, especially by making sure that secret or private information does not become generally known: thận trọng",
                        "examples": [
                            "▪ Andrew’s very discreet -- he won’t tell anyone you’re leaving.",
                            "Andrew rất thận trọng, anh ta sẽ không nói với bất kì ai việc bạn sắp rời đi",
                            "▪ We offer a discreet and personal service to our clients.",
                            "Chúng tôi cung cấp dịch vụ kín đáo và cá nhân cho khách hàng",
                            "discreetly[adverb] một cách thận trọng",
                            "▪ The lawyer murmured discreetly that he would like to speak to her alone.",
                            "Luật sư thì thầm 1 cách thận trọng rằng anh ta sẽ nói chuyện một mình với cô ấy"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "polite",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "careful not to offend someone, especially by not being completely honest when telling them what you think about something: lịch thiệp",
                        "examples": [
                            "▪ Did you mean what you said about my dress, or were you just being polite?",
                            "Điều đó có nghĩa là những gì bạn nói về cái đầm của tôi chỉ là lịch để lịch sự thôi sao?",
                            "polite about: lịch thiệp về",
                            "▪ The guests were all very polite about the meal, but inside Joan just wanted to cry.",
                            "Các vị khách đều lịch sự về bữa ăn nhưng thật tâm Joan chỉ muốn khóc",
                            "politely[adverb] một cách lịch thiệp",
                            "▪ When she asked what I thought of the meal I lied politely, and said it was great.",
                            "khi cô ấy hỏi về suy nghĩ của tôi về bữa ăn tôi đã nói dối một cách lịch sự là nó rất tuyệt"
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "polite behaviour",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "politeness",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "thiếu lễ độ, thiếu lịch sự",
                        "examples": [
                            "▪ During my stay in Japan, I was treated with great politeness by everyone I met.",
                            "Trong suốt thời gian ở Nhật , tôi đã được đối xử rất lịch sự bởi những người tôi gặp",
                            "▪ American businessmen were surprised that their French colleagues wanted to shake hands each morning, a formal sign of politeness in the US.",
                            "Các doanh nhân Mỹ ngạc nhiên rằng các đồng nghiệp người Pháp muốn bắt tay với nau mỗi sáng, một dấu hiêu của sự thiếu lịch sự ở Mỹ",
                            "out of politeness :mất lịch sự",
                            "simply in order to be polite",
                            "▪ I don’t like cake, but I accepted a piece out of politeness.",
                            "Tôi không thích bánh, nhưng tôi chấp nhận mất lịch sự"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "manners",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[plural noun]",
                        "usage": "",
                        "region": "",
                        "definition": "polite ways of behaving that parents teach their children for situations such as eating, meeting people, or asking for something:",
                        "examples": [
                            "cách cư xử ( trong xã hội )",
                            "▪ I wish she’d teach that boy of hers some manners!",
                            "Tôi mong cô ấy sẽ dạy thằng bé vài cách cư xử của cô ấy",
                            "table manners: cách cư xử khi dùng bữs",
                            "behaviour when you eat",
                            "▪ Our kids’ table manners are appalling - it’s like living in the zoo.",
                            "Cách những đứa trẻ cư xử trên bàn ăn thật kinh khủng, nó giống như trong sở thú",
                            "manners cách xử sự;cách cư xử",
                            "[ plural ] polite ways of treating other people and behaving in public",
                            "_He needs to betaughtsome manners.",
                            "_It'sbadmanners to eat with your mouth open.",
                            "_It's consideredgoodmanners in some societies to leave a little food on your plate."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "courtesy",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "polite behaviour that pays attention to the needs of other people, especially people you do not know well: hòa nhã, lịch sự",
                        "examples": [
                            "▪ Businessmen value the service and courtesy offered by traditional hotels.",
                            "Các doanh nhân đánh giá cao dịch vụ và sự hòa nhã của những khách sạn truyền thống",
                            "▪ When you contact a government office, you should receive efficient service and be treated with courtesy.",
                            "Khi bạn liên hệ với văn phòng chính phủ, bạn sẽ nhận được những dịch vụ hiệu quả được đối xử hòa nhã",
                            "out of courtesy : không hòa nhã, lịch sự",
                            "simply in order to be polite",
                            "▪ I don’t think she wanted us to come and stay with her, she just offered out of courtesy.",
                            "tôi không nghĩ cô ấy muốn chúng ta vào và ở cùng cô ấy, cô ấy đề nghị thiếu hòa nhã",
                            "have the courtesy to do something : lịch sự để làm gì đó",
                            "used especially when you are annoyed with someone who has behaved impolitely",
                            "I wish he’d had the courtesy to tell me when he was coming back.",
                            "Tôi mong anh ta có thể lịch sự nói với tôi khi anh ta trở lại"
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "tact",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "the quality of being polite and careful about what you say, in order to avoid making other people feel embarrassed or upset: tế nhị, khéo léo",
                        "examples": [
                            "▪ Helping people who have marriage problems requires a great deal of tact and patience.",
                            "Giúp đỡ những người có vấn đề về hôn nhân cần nhiều sự khéo lép và kiên nhẫn",
                            "▪ The old woman thrust a picture of a plain-looking girl into Meryl’s hand. ‘Your granddaughter? She’s lovely,’ said Meryl with tact.",
                            "Người phụ nữ lớn tuổi đưa bức ảnh một cô gái giản dị vào tay Meryl , nói với sự khéo léo\" cháu của bà\""
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "formality",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[uncountable noun]",
                        "usage": "",
                        "region": "",
                        "definition": "a polite and rather formal way of behaving, which avoids being too friendly:",
                        "examples": [
                            "thủ tục, hình thức",
                            "▪ The following morning, Mr Harrison greeted her with careful formality.",
                            "Sáng hôm sau, ông chào đón cô gái với hình thức cẩn trọng",
                            "▪ When I re-read my letter I saw that I had written it with a formality that I did not intend.",
                            "Khi tôi đọc lại bức thư tôi thấy tôi viết một cách thủ tục mà tôi không để ý",
                            "formalitynounSERIOUSNESS",
                            "[ U ] the quality of being suitable for serious or official occations",
                            "_She found the formality of the occasion rather daunting.",
                            "_A note of formality in his voice alerted her to the fact that others were listening."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "words for describing children who behave politely and well",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "well-behaved",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "a well-behavedchildis polite and does not cause trouble or make noise: cư xử đàng hoàng",
                        "examples": [
                            "▪ His older brother was quieter and far better-behaved."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Anh trai của anh ta đã cư xử đàng hoàng hơn",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ She was a thoughtful, kind, and well-behaved girl."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Cô ấy là người chu đáo, tốt sụng và cư xử đàng hoàng",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Their children are so well-behaved it seems almost unnatural."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Con cái của họ rất giỏi cư xử nó dường như không phải tư nhiên",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "good",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "a child who is good behaves in a polite, obedient and helpful way: tốt, ngoan",
                        "examples": [
                            "▪ She’s a good girl -- I’m sure she won’t give you any trouble."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Cô ấy là cô gái tốt, tôi chắc cô ấy sẽ không gây rắc rối cho bạn",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ What good children - they went to bed as soon as I told them to!"
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Những đứa trẻ ngoan, chúng đi ngủ ngay khi tôi bảo chúng",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ If you’re good you can stay up till eight o'clock tonight."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Nếu bạn giỏi bạn có thể thức đến 8 giờ tối nay",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "well-brought up",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective phrase]",
                        "usage": "",
                        "region": "",
                        "definition": "a child or young adult who is well-brought up always behaves well because their parents have taught them to be polite: giáo dục tốt, nuôi dưỡng tốt",
                        "examples": [
                            "▪ They are well-brought-up children, and have a great respect for their teachers."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Chúng là những đứa trẻ có giáo dục tốt, và thật ngưỡng mộ giáo viên của chúng",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ David is very well-brought up, but he does have a nasty temper sometimes."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "David được nuôi dưỡng rất tốt, nhưng anh ta thi thoảng rất nóng nảy",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "polite, confident, and relaxed, but in an insincere way",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "smooth",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "someone who is smooth, especially a man, has good manners and a relaxed, confident way of talking to people, but in a way that you do not completely trust: dễ chịu, êm dịu",
                        "examples": [
                            "▪ Smooth and charming, Francis was the kind of man your mother would love you to marry."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Dễ chịu và duyên dáng, Francis là mẫu người mẹ mà bạn muốn kết hôn",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ Don’t let his smooth manner fool you - he’s just after your money."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Đừng để những êm dịu đánh lừa bạn, anh ta chỉ vi tiền của bạn thôi",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "suave",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adjective]",
                        "usage": "",
                        "region": "",
                        "definition": "very polite, pleasant and stylish, especially in a way that is intended to be attractive to women: tinh tế, khéo léo",
                        "examples": [
                            "▪ Reginald was suave, handsome and charming."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Reginald là người tinh tế,đẹp trai và quyến rũ",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "▪ He was tall and suave, careful in dress, careful in behaviour."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "Anh ta cao, tinh tế ăn mặc và cư xử cẩn thận",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]