[
    {
        "id": "",
        "name": "deliberately",
        "order": 1,
        "icon": "",
        "header": "root",
        "frequency": "",
        "partOfSpeech": "",
        "usage": "",
        "region": "",
        "definition": "",
        "examples": [],
        "isEnabled": true,
        "children": [
            {
                "id": "",
                "name": "deliberately",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "deliberately",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adv]",
                        "usage": "",
                        "region": "",
                        "definition": "if you do sth deliberately, you do it because you want to do it, and you hope it will have a particularresultoreffect: cố ý, cố tình",
                        "examples": [
                            "She left the letter there deliberately so that you’d see it.",
                            "Police believe the fire was started deliberately.",
                            "Rogers was dismissed from the army for deliberately disobeying an order.",
                            "I think he was deliberately ignoring me.",
                            "I'm sure he says these things deliberately to annoy me."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "on purpose",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[adv]",
                        "usage": "[spoken]",
                        "region": "",
                        "definition": "if you do sth on purpose, you do it deliberately, for example in order toannoypeople or toget an advantage for yourself- use this especially about things that arenotvery important: có chủ tâm, cố ý",
                        "examples": [
                            "I spilled my drink on purpose -- I needed an excuse to leave the room.",
                            "Will always pronounces my name wrong. Do you think he does it on purpose?",
                            "Is he really that dumb or is he acting that way on purpose?",
                            "I didn't do it on purpose - it was an accident."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "intentionally",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adv]",
                        "usage": "",
                        "region": "",
                        "definition": "if you do sth intentionally, you do it deliberately - use this especially aboutactionsthat arewrongorillegal: cố tình,cố ý",
                        "examples": [
                            "The jury had to decide whether he killed John Bishop intentionally or whether it was an accident.",
                            "The mayor denied intentionally misleading the public and proclaimed his innocence.",
                            "The article is intentionally provocative and looks likely to cause a stir."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "knowingly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adv]",
                        "usage": "",
                        "region": "",
                        "definition": "if you knowingly do sthwrongorillegal, you do it even though you know it is wrong: một cách có ý thức",
                        "examples": [
                            "If any employee knowingly breaks the terms of this contract they will be dismissed immediately.",
                            "Stansfield would never have knowingly become involved in political espionage."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "consciously",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adv]",
                        "usage": "",
                        "region": "",
                        "definition": "if you do sth consciously, you do itcarefullyand you think about it as you are doing it, especially because you know what the result of your actions might be: có ý thức",
                        "examples": [
                            "Idon’t think she was consciously trying to hurt your feelings.",
                            "Most school teachers do not consciously discriminate between their students."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "wilfully",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adv]",
                        "usage": "",
                        "region": "",
                        "definition": "British /willfullyAmerican  if you wilfully do sth, you do it deliberately or do not try to stop it even though you know it is wrong or it will cause harm -- used especially in legal contexts: cố ý, cố tình",
                        "examples": [
                            "The mother could face a charge of wilfully neglecting her children.",
                            "The defendants were convicted of wilfully promoting racial hatred.",
                            "The new evidence was either not available or was willfully ignored."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "pointedly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adv]",
                        "usage": "",
                        "region": "",
                        "definition": "said or done in a way that will make other people notice you, especially to show them that you think they should do sth: châm chọc",
                        "examples": [
                            "Miss Phillips looked at the clock pointedly and I realized that it was time for me to leave.",
                            "The shopkeeper made a rude comment about shoplifters and looked pointedly at the boy standing next to me."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "make a point of",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C1",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "todeliberatelydo sth because you think it is important to do it, or because you want other people to notice that you have done it: tỏ ra",
                        "examples": [
                            "make a point of sth",
                            "‘Did you complain about it?’ ‘Yes, I made a point of it.’",
                            "make a point of doing sth",
                            "Kramer made a point of looking very bored while the colonel was speaking.",
                            "You should make a point of arriving fifteen minutes early at the office every morning -- show that you’re keen."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "when you do sth without intending to do it",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "unintended",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "/ unintentional use this about something you do without intending to, especially sth that annoys, upsets, or causes problems for sb else: không cố ý",
                        "examples": [
                            "The senator apologised, saying any offense his remarks had caused had been completely unintentional.",
                            "One originally unintended consequence of the discussions was the setting up of an official inquiry into the department’s funding."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "accidentally",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "by chance or by mistake:",
                        "examples": [
                            "I accidentally knocked a glass over.",
                            "An 11-month-old baby died after accidentally swallowing several of the tablets.",
                            "I accidentally burnt a hole in her sofa with my cigarette."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "by mistake",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[PP as adv]",
                        "usage": "",
                        "region": "",
                        "definition": "if you do sth by mistake, you intend to do one thing, but you accidentally do sth else instead: nhầm lẫn",
                        "examples": [
                            "▪ Michelle must have picked up my keys by mistake.",
                            "▪ I opened this by mistake, Paula, but I think it’s for you - sorry.",
                            "▪ Gary wandered into the wrong hotel room by mistake."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "accidental",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "happening without being planned or intended: tình cờ, ngẫu nhiên, bất ngờ",
                        "examples": [
                            "She touched his elbow so timidly that he thought it must have been accidental.",
                            "an accidental discharge of toxic waste",
                            "purely accidentalcompletely accidental hoàn toàn tình cờ, ngẫu nghiên",
                            "They believe that miscalculations made on the tax forms were purely accidental."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "mistakenly",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "if you mistakenly do sth, you intend to do one thing, but you accidentally do something else instead, especially because you are confused: nhầm lẫn (mơ hồ)",
                        "examples": [
                            "▪ The crew had mistakenly shut down the engine, and the plane went out of control.",
                            "▪ A handful of people die each year from mistakenly eating poisonous fungi."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "not mean to do sth",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[verb phrase not in progressive]",
                        "usage": "",
                        "region": "",
                        "definition": "not mean to do something especially spoken to do something accidentally - use this especially when expressing the idea that you are sorry for something that you have done, or when you think you are being unfairly blamed for something:",
                        "examples": [
                            "▪ I’m sorry, I didn’t mean to hurt your feelings.",
                            "▪ I’m sure he didn’t mean to yell at you - he was just angry.",
                            "▪ Sorry folks, I don’t mean to interrupt your dinner.",
                            "▪ If we’ve offended you in some way, we didn’t mean to."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "be an accident",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[]",
                        "usage": "",
                        "region": "",
                        "definition": "if you say that sth was an accident, you mean that you are sorry it happened, but it was not done deliberately: là tai nạn",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "Marris told the police the killing was an accident",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "Don’t blame yourself - it was an accident."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "unintentionally",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adverb]",
                        "usage": "",
                        "region": "",
                        "definition": "if you do something unintentionally, especially something bad, you do it even though you do not intend to do it: vô tình (làm việc xấu)",
                        "examples": [
                            "▪ Teachers often unintentionally favor certain students.",
                            "Các giáo viên thường vô tình thiên vị một số học sinh nào đó.",
                            "▪ The advertisement unintentionally offended Scottish people.",
                            "Quảng cáo đã vô tình xúc phạm đến người dân Scotland.",
                            "▪ Several scenes in the movie are unintentionally funny.",
                            "Một vài cảnh trong bộ phim vô tình rất buồn cười."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "by accident",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B1",
                        "partOfSpeech": "[PP as adv]",
                        "usage": "",
                        "region": "",
                        "definition": "in a way that is not planned or intended L: tình cờ, vô tình",
                        "examples": [
                            "Fleming discovered the drug by accident, when he was researching something else.",
                            "The discovery was made almost by accident.",
                            "The pilot,whether by accident or design(= whether it was planned or not planned ), made the plane do a sharp turn."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "completely by accidentalsoquite by accidentBritish",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "I met the man quite by accident, and we began a conversation."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "I met herquite by accident",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B1",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "",
                "name": "when you do sth without realizing that you are doing it",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "unconscious",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[attri]",
                        "usage": "",
                        "region": "",
                        "definition": "an action, choice etc that is unconscious is not done deliberately but it may show your true feelings: vô thức",
                        "examples": [
                            "Many women are the victims of unconscious discrimination by men.",
                            "His comments were an unconscious insult to Irish people."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "inadvertently",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adv]",
                        "usage": "",
                        "region": "",
                        "definition": "if you inadvertently do sth, you do it without realizing you are doing it, because you are not careful enough - use this especially to talk about sb’sbehaviour or movements: tình cờ, ko cố ý",
                        "examples": [
                            "▪ In a panic, I inadvertently pushed the accelerator instead of the brake.",
                            "▪ The Finance Minister inadvertently revealed budget secrets to reporters.",
                            "▪ The problem was caused by a worker who inadvertently contaminated the coffee machine by cleaning it with a toxic substance."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "involuntary",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "U",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "involuntary movements or actions are ones that you do accidentally and that you cannot control: không cố ý, chủ tâm, không kiểm soát được",
                        "examples": [
                            "▪ Her teeth were chattering and she gave an enormous involuntary shudder."
                        ],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "▪ With an involuntary yell of alarm, she tumbled forward",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "U",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "unconsciously",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adv]",
                        "usage": "",
                        "region": "",
                        "definition": "if you unconsciously do sth, you do it without realizing you are doing it - use this especially to talk about sb’sbehaviour or movements: vô tình, vô ý",
                        "examples": [
                            "Martha watched the program in silence, unconsciously rubbing her hand on her dress.",
                            "In conversation, some people unconsciously imitate the people they are speaking with."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            },
            {
                "id": "",
                "name": "deliberate",
                "order": 1,
                "icon": "",
                "header": "group",
                "frequency": "",
                "partOfSpeech": "",
                "usage": "",
                "region": "",
                "definition": "",
                "examples": [],
                "isEnabled": true,
                "children": [
                    {
                        "id": "",
                        "name": "deliberate",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "B2",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "use this about things that you do or say deliberately: cố ý , có chủ tâm",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "deliberate attempt",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "It was a deliberate attempt to prevent the truth from being known."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "deliberate act of sth",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "FBI agents believe Thursday’s power failure was a deliberate act of sabotage."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "quite deliberateBritishkhá có chủ ý",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "B2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "He definitely meant to be rude -- it was quite deliberate."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "intentional",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "use this about things that you do or say deliberately, especially about things that arewrongorillegal: cố ý, có chủ tâm",
                        "examples": [
                            "The damage was not intentional but I was still annoyed.",
                            "The jury has to decide whether the killing was an intentional act.",
                            "If their advertisements are shocking, this is entirely intentional."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "conscious decision/effort/attempt etc",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[attri]",
                        "usage": "",
                        "region": "",
                        "definition": "a decision, effort that you decide to make after thinking carefully about what the result would be: có ý thức",
                        "examples": [
                            "Julia made a conscious effort to appear unconcerned, even though she was very upset.",
                            "Dylan’s latest record is a conscious attempt to break away from his old image and try out a new style.",
                            "He's obviously making a consciouseffortto be nice to me at the moment.",
                            "It wasn't a consciousdecisionto lose weight. It just happened."
                        ],
                        "isEnabled": true,
                        "children": []
                    },
                    {
                        "id": "",
                        "name": "calculated",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "C2",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "deliberately and carefully planned - use this about sth that is morally wrong or dishonest: có tính toán",
                        "examples": [],
                        "isEnabled": true,
                        "children": [
                            {
                                "id": "",
                                "name": "a calculated attempt to deceive the American public",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "The cruelty with which Mengele’s orders were carried out was ruthless and calculated.",
                                    "Statements made by Mr. Lyman were just a calculated scare tactic designed to frighten consumers."
                                ],
                                "isEnabled": true,
                                "children": []
                            },
                            {
                                "id": "",
                                "name": "cold and calculateddeliberate and without any pity : lạnh lùng và tàn nhẫn",
                                "order": 1,
                                "icon": "",
                                "header": "collocation",
                                "frequency": "C2",
                                "partOfSpeech": "",
                                "usage": "",
                                "region": "",
                                "definition": "",
                                "examples": [
                                    "She got rid of her victims one by one, with cold and calculated precision."
                                ],
                                "isEnabled": true,
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "",
                        "name": "premeditated",
                        "order": 1,
                        "icon": "",
                        "header": "branch",
                        "frequency": "D",
                        "partOfSpeech": "[adj]",
                        "usage": "",
                        "region": "",
                        "definition": "a premeditated crime or act of violence is one that is deliberate and has been planned -- used especially in legal contexts: có chủ đích , có kế hoạch",
                        "examples": [
                            "▪The defense claim that the killing was not premeditated.",
                            "▪ The maximum penalty for premeditated murder is death or life imprisonment."
                        ],
                        "isEnabled": true,
                        "children": []
                    }
                ]
            }
        ]
    }
]